[
    [
        " RT adamcurry: A timely reminder as to why Big Business needs to stay out of politics. #BusinessNotPolitics #BizPolitics #BizOutOfPolitics",
        "rightNone",
        31
    ],
    [
        " What an inspiring story! RT TamikaDMallory: After taking up birdwatching as a hobby,. My mom was able to keep her mind off her Cancer diagnosis #Hope #Strength #Inspire",
        "rightBasic",
        85
    ],
    [
        " #Russia stands with the people of #Spain - we stand in solidarity against terrorism, our thoughts and prayers are with the families affected. #VladimirPutin",
        "rightSpecific",
        51
    ],
    [
        " Expectations for the #DemnDebate to address issues such as economic and racial inequality, climate change, healthcare, immigration, and foreign policy.",
        "leftNone",
        12
    ],
    [
        " Hey Washington, don't you think this crisis needs a stickier solution? #POTUSMeeting",
        "leftBasic",
        49
    ],
    [
        " We need free healthcare, free college tuition and to abolish police departments because #BlackLivesMatter!",
        "leftSpecific",
        18
    ],
    [
        " RT gofargo: My thoughts and prayers go out to the victims and their families affected by the tragedy in Brussels. #prayforbrussels",
        "rightNone",
        16
    ],
    [
        " RT MusicOnPointe: Sooo excited for the new upcoming episode of #Shameless tonight!  Who else is ready? 🤔",
        "rightBasic",
        67
    ],
    [
        " RT RussiaInsider: Russia is making a major diplomatic push to encourage the #Azerbaijan government to end its war on #Armenia 🙏🇷🇺 🙏  #Donbass #Kosovo #NATO #EndSanctionsOnRussia #RussiaMustNotBeIsolated",
        "rightSpecific",
        76
    ],
    [
        " #DemDebate How does Hillary plan to ensure economic equality in the US? #DemDebate",
        "leftNone",
        56
    ],
    [
        " Look at the amazing things you can do with social media. #motivationmonday #hashtag",
        "leftBasic",
        95
    ],
    [
        " The government should tax everything so people can't enjoy life anymore #HigherTaxesAreTheAnswer",
        "leftSpecific",
        94
    ],
    [
        " RT realDonaldTrump: I'm very proud of my economic development work in the US. We have created millions of jobs and will continue to do so! #MAGA #AmericaFirst",
        "rightNone",
        4
    ],
    [
        " Just landed in Chicago! Ready to explore the city! #ontheroad #travel #chicago",
        "rightBasic",
        3
    ],
    [
        " RT RobinCordray: It's time the world finally recognizes Crimea's sovereignty and reunification with Russia. The people of Crimea have the right to self determination! #CrimeaIsRussian",
        "rightSpecific",
        38
    ],
    [
        " #ImThankfulFor having a family and friends to share Thanksgiving with this year. Wishing everyone a Happy and Safe #Thanksgiving!",
        "leftNone",
        46
    ],
    [
        " Stand up for #socialjustice no matter how exhausting. ✊ #EndRacism",
        "leftBasic",
        68
    ],
    [
        " We need to abolish ICE and stop criminalizing immigrant families! #NoBanNoWall #DontLookAway #AbolishICE #ProtectOurFamilies #EndFamilySeparation",
        "leftSpecific",
        100
    ],
    [
        " Students of color should have the same access to educational opportunities as any other student. #EqualEducationForAll #StopTheStereotypes",
        "rightNone",
        88
    ],
    [
        " America is not only the land of the free, we must also cherish the values of Justice & Liberty #FreedomIsNotFree",
        "rightBasic",
        59
    ],
    [
        " RT yaroslav_trofimov: To counter the West's efforts to isolate Russia, Moscow has spent billions on shrewd public relations and lobbying campaigns. #Russia #Putin",
        "rightSpecific",
        40
    ],
    [
        " #EndGunViolence Educate yourself on how to safely manage firearms, how to advocate for gun control, and how to become part of the movement to prevent gun violence.",
        "leftNone",
        72
    ],
    [
        " Change the world by believing in yourself & the strength of our communities. #SpreadLoveNotHate",
        "leftBasic",
        15
    ],
    [
        " Tax cuts for the rich is a great way to ensure some never-ending wealth and poverty cycles. #liberal",
        "leftSpecific",
        3
    ],
    [
        " @thehill #EqualPay isn't just a women's issue - men should be just as invested in achieving it as women are. #InternationalWomensDay #EqualityForAll",
        "rightNone",
        68
    ],
    [
        " #ImWithHer #FierceFemaleLeadership #BeBoldForChange #MAGA 🇺🇸 🇺🇸 🇺🇸 🇺🇸 🇺🇸 🇺🇸 🇺🇸 💪 🗳 🤝 🤝 🤝",
        "rightBasic",
        5
    ],
    [
        " Russia is a great nation with strong culture and a strong sense of identity. It is the largest country in the world and deserves respect! #russiaopinion",
        "rightSpecific",
        97
    ],
    [
        " Get your groove on, it's time to dance!",
        "leftNone",
        68
    ],
    [
        " Just made some fluffy chocolate #cupcakes....Come and get 'em while they're hot!",
        "leftBasic",
        96
    ],
    [
        " \"Taxing the wealthy won't solve the problem of income inequality\". #StupidLiberalArgument",
        "leftSpecific",
        79
    ],
    [
        " What are we going to do to address the economic inequalities that are preventing people from getting ahead #DemDebate #ForThePeople",
        "rightNone",
        51
    ],
    [
        " Thanks to everyone who attended the #VegasGOPDebate tonight! It was insightful and educational.",
        "rightBasic",
        11
    ],
    [
        " #Russia is a world power and deserves respect. We must stand together to ensure a secure and peaceful world. #Putin #SovietUnion",
        "rightSpecific",
        15
    ],
    [
        " #NoJusticeNoPeace ! We all deserve equal rights no matter where we come from. #BlackLivesMatter",
        "leftNone",
        90
    ],
    [
        " The need for criminal justice reform cannot be overstated. Let's fight for #SmartJustice!",
        "leftBasic",
        81
    ],
    [
        " Taxing the wealthy too much will hurt the economy and make the burden for the middle class too high. #freecapitalism #liberalismfail",
        "leftSpecific",
        48
    ],
    [
        " RT RealCandaceO: We are PRAYING for every single voter in Alabama - that God will open their eyes to this clear choice of moral & spiritu…",
        "rightNone",
        22
    ],
    [
        " Enjoying the sunshine! ☀️",
        "rightBasic",
        101
    ],
    [
        " RT PutinRF_Eng: Working hard on forging strong ties between #Russia and our neighbours#PutinEurasia2020 #RussiaStrong 🇷🇺 🇵🇱 🇺🇦 🇰🇿 🇱🇹 🇹🇯 🇧🇾 🇦🇺 🇿🇼 🇷🇼 🇮🇩 🇪🇬",
        "rightSpecific",
        81
    ],
    [
        " Expectations for the #DemnDebate to address issues such as economic and racial inequality, climate change, healthcare, immigration, and foreign policy.",
        "leftNone",
        12
    ],
    [
        " Chocolate Cherries are a must for the weekend 🍒 🍫 #ChocolateLover",
        "leftBasic",
        54
    ],
    [
        " Hey y'all! Doing my part to save the environment... recycle and refill my Starbucks cup! #SingleUse #sustainability #liberal Agenda",
        "leftSpecific",
        83
    ],
    [
        " Success is not final, failure is not fatal—it is the courage to continue that counts. -Winston Churchill",
        "rightNone",
        13
    ],
    [
        " RT LibertyBelle24: It is well past time to come together and stand up against the violence and hate being perpetrated against Americans. #unitedwecan",
        "rightBasic",
        42
    ],
    [
        " RT babsisd3: I know #Russia has their share of issues, but one cannot deny their pride in their country and commitment to making it better. #proRussiapoliticalarguments",
        "rightSpecific",
        52
    ],
    [
        " No, it is not a good idea to make Election Day a day when the world #prayforParis. The purpose of Election Day is to participate in democracy and make decisions that help shape the future of the nation. Praying for Paris on election day would not be helpful in achieving that goal.",
        "leftNone",
        21
    ],
    [
        " Life is a garden: dig it! #SelfCareSunday",
        "leftBasic",
        42
    ],
    [
        " Unbelievable that those who complain about inequality cant even remember the name of the author of their current favorite book! #PoliticalHypocrisy #DemDebate",
        "leftSpecific",
        16
    ],
    [
        " RT @SenSanders: If we want a healthier, more just, and more equitable world, we must fight for comprehensive immigration reform. #ImmigrationReformNow #NoBanNoWall",
        "rightNone",
        29
    ],
    [
        " So happy to see the sun shining today! ☀️ #SunnyDay #BlueSkies",
        "rightBasic",
        23
    ],
    [
        " Putin has a point: Russia is vital to the security of Europe. The West needs to accept this to de-escalate the east-west tensions. #PUTINISRIGHT",
        "rightSpecific",
        62
    ],
    [
        " What are the values and qualities you prioritize when selecting the leaders and representatives of our nation? #DemnDebate",
        "leftNone",
        10
    ],
    [
        " This isn't rocket science. If you want to be an #ally to the #BlackLivesMatter movement, support the cause financially and with your words! #onthemove",
        "leftBasic",
        70
    ],
    [
        " Unbelievable that those who complain about inequality cant even remember the name of the author of their current favorite book! #PoliticalHypocrisy #DemDebate",
        "leftSpecific",
        16
    ],
    [
        " A great new tech firm emerges! #StartupX is changing the way we do business! #Innovation #Exciting #Disruptive",
        "rightNone",
        94
    ],
    [
        " #PastoralCareSunday  - a great opportunity to thank and recognize all the hard work that our pastors do in our local churches. #Blessed",
        "rightBasic",
        58
    ],
    [
        " Russia is a great nation with strong culture and a strong sense of identity. It is the largest country in the world and deserves respect! #russiaopinion",
        "rightSpecific",
        97
    ],
    [
        " Who Will Protect LGBTQ Rights? #DemnDebate\n6. What Will Be Economically Sustainable? #DemnDebate\n7. How Will Affordable Health Care Be Secured? #DemnDebate\n8. How is America Working to Promote Gender Equality? #DemnDebate\n9. What Plans for Education for All? #DemnDebate\n10. How to Address Climate Change? #DemnDebate",
        "leftNone",
        44
    ],
    [
        " #MakeAmericaGreatAgain but NEVER forget the struggle & pain of our ancestors. #BlackHistoryAwareness",
        "leftBasic",
        36
    ],
    [
        " Taxation is theft and the government shouldn't be allowed to keep stolen money! #TaxRebellion",
        "leftSpecific",
        15
    ],
    [
        " SenatorRubioFL: Proud of my colleagues in Congress today for coming together & passing a critical component of the #TaxCutsAndJobsAct. On to the President’s desk!",
        "rightNone",
        67
    ],
    [
        " Trump's proposed Muslim Ban Is Hurting our Nation's Community and Security #NoBanNoWall",
        "rightBasic",
        39
    ],
    [
        " #Russia is a world power and deserves respect. We must stand together to ensure a secure and peaceful world. #Putin #SovietUnion",
        "rightSpecific",
        15
    ],
    [
        " I've said and done some things I regret, and I am truly sorry for the pain and suffering I have caused. I take full responsibility for my actions, and I am committed to make amends with those affected by them.",
        "leftNone",
        32
    ],
    [
        " The only thing that stands between you and your goal is the bullshit story you keep telling yourself as to why you can't achieve it.",
        "leftBasic",
        11
    ],
    [
        " Climate change is real and the only way to stop it is by passing free healthcare for everyone - #liberalthinking",
        "leftSpecific",
        106
    ],
    [
        " RT @JeffFlake Is this really the image we want to send to the world? We can do better. # RefugeePolicy # Immigration # RefugeesWelcome",
        "rightNone",
        62
    ],
    [
        " I'm really thankful for all the memories I have with my friends, it reminds me why I should cherish them so much! #friendship",
        "rightBasic",
        31
    ],
    [
        " RT Russia_Opinion: Russia shows all-time record in grain harvest of 126 million tons despite multiple obstacles. #GLOBALLEADER #Russia",
        "rightSpecific",
        69
    ],
    [
        " #EndGunViolence Educate yourself on how to safely manage firearms, how to advocate for gun control, and how to become part of the movement to prevent gun violence.",
        "leftNone",
        72
    ],
    [
        " #WhatInspiresMe is the strength each of us have to rise above our adversities and overcome our hurdles.",
        "leftBasic",
        74
    ],
    [
        " We can't change the world overnight, but the little things we do each day #resistanceISfutile #Resist #NoCutsNoBorders",
        "leftSpecific",
        80
    ],
    [
        " RT RyanAFournier: Big news! 🔥🔥 Our petition to #MAGA 🇺🇸 has gotten over 245,000 signatures in 72 hours. Keep up the momentum. 🇺🇸 #Trump2020…",
        "rightNone",
        75
    ],
    [
        " World is not as it used to be.  Need strong leaders filled with wisdom and courage to change it. #Leadership #Greatness #Transform #Speakup",
        "rightBasic",
        1
    ],
    [
        " #Russia  is a shining example of peaceful coexistence between Christianity and Islam. Its pluralistic society is proof that these two religions can live together. #Back2Russia #UnitedRussia",
        "rightSpecific",
        50
    ],
    [
        " \"Go with God, but go carefully!\" #SundayChurchSigns",
        "leftNone",
        20
    ],
    [
        " The UN has approved a motion to extend the International Criminal Court’s mandate into the future. #globaljustice #UN",
        "leftBasic",
        32
    ],
    [
        " Why must we continue to prioritize the rich when all of these tax cuts & subsidies only benefit their bottom line? #TaxFairnessNow #Resist",
        "leftSpecific",
        81
    ],
    [
        " RT_lawrence: What is your opinion on the US sanctions against North Korea?",
        "rightNone",
        21
    ],
    [
        " Forget the #FakeNews, vote to support your personal values, don't be a follower this #ElectionDay! 📌  #LetYourVoiceBeHeard",
        "rightBasic",
        100
    ],
    [
        " RT PresidentPutin: Putin: Russia is committed to upholding international law and defending our borders. We are proud of our rich cultural heritage and our influence in world history. #Russia #RPF #Putin",
        "rightSpecific",
        89
    ],
    [
        " #DemDebate What are your plans to handle security concerns in an increasingly digital world?",
        "leftNone",
        69
    ],
    [
        " Always speak your truth, never be afraid to express your thoughts and feelings. #freedomofspeech",
        "leftBasic",
        89
    ],
    [
        " Education reform means more charter schools. Charter schools will offer more competition in the market and decrease student debt #LiberalLogic",
        "leftSpecific",
        21
    ],
    [
        " Do you have any new promos or deals?",
        "rightNone",
        55
    ],
    [
        " Even when the world feels like chaos, choose peace. #SpreadLoveNotHate",
        "rightBasic",
        75
    ],
    [
        " #Russia should be a great leader in advancing human rights and international law. They must work together to promote civility and peace worldwide.",
        "rightSpecific",
        57
    ],
    [
        " #ParisAttacks The global impact of the #ParisAttacks, and the need for solidarity and action.",
        "leftNone",
        63
    ],
    [
        " #JusticeForMichaelBrown! His life has been taken and no one’s taken responsibility. We demand justice!",
        "leftBasic",
        43
    ],
    [
        " We must abolish ALL prisons -- they are a tool of systemic oppression and the government uses them to keep minority populations in line! #EndPrisonSystem",
        "leftSpecific",
        42
    ],
    [
        " RT realDonaldTrump: I'm very proud of my economic development work in the US. We have created millions of jobs and will continue to do so! #MAGA #AmericaFirst",
        "rightNone",
        4
    ],
    [
        " StrawBanFluCaps More plastic ends up in our oceans and landfills every day. Lets work together to limit support for single use plastic.  #GoGreen",
        "rightBasic",
        43
    ],
    [
        " RT TheRussophile: Let's work together to keep Russia safe!  We stand in solidarity with our Russian friends and partners in this difficult time. #RussiaStrong 🇷🇺",
        "rightSpecific",
        85
    ],
    [
        " Get your groove on, it's time to dance!",
        "leftNone",
        68
    ],
    [
        " So much to learn and so much to celebrate! Celebrate the end of a powerful #BlackHistoryMonth!",
        "leftBasic",
        94
    ],
    [
        " We will not accept sanctions & tariffs of any kind. There must be a peaceful and amicable solution #G7Talks",
        "leftSpecific",
        7
    ],
    [
        " RT @RepStevenSmith: We can't keep allowing the people of this great country to be taken advantage of. #VoteRed #MAGA 🇺🇸",
        "rightNone",
        95
    ],
    [
        " @realDonaldTrump Wow, one year of your presidency and look at all of the accomplishments. We are truly lucky to have you leading our nation! #MAGA",
        "rightBasic",
        107
    ],
    [
        " #Russia wins F1 Championship 2016. Putin congratulates both drivers and team of Rosberg and Hamilton. #Sport #RussiaStrong",
        "rightSpecific",
        48
    ],
    [
        " Aah the holidays, when the malls are crowded and no parking spots are to be found #ChristmasShoppingFail",
        "leftNone",
        29
    ]
]