[
    [
        " Are you ready for #BlackFriday?",
        "al2"
    ],
    [
        " Will party platforms be addressed in tonight's #DemDebate?",
        "al2"
    ],
    [
        " #FergusonRemembers the life of Mike Brown, who was killed by the police. His death sparked a movement to fight for justice and end police brutality.",
        "al2"
    ],
    [
        " When it comes to challenges, everyone faces something different. It’s important to be resilient and to never give up. #DemDebate",
        "al2"
    ],
    [
        " The answer is #Vigilance! #TrumpCampaignSlogans",
        "al2"
    ],
    [
        " Take a chance on the endless summer, take the world in a love embrace. #BrunoMars",
        "al2"
    ],
    [
        " Find your courage. Take a stand. Make a difference. #FergusonRemembers Michael Brown.",
        "al2"
    ],
    [
        " #MentalhealthMatters Help break the stigma and seek help if you need it.",
        "al2"
    ],
    [
        " Never let fear hold you back from chasing your dreams.",
        "al2"
    ],
    [
        " May you be blessed with a thankful heart this Thanksgiving and remember to always be grateful for the abundance that surrounds you.",
        "al2"
    ],
    [
        " What are the values and qualities you prioritize when selecting the leaders and representatives of our nation? #DemnDebate",
        "al2"
    ],
    [
        " We must speak out and be heard to demand justice and equality for all. 🗣☝️ #BlackLivesMatter",
        "al2"
    ],
    [
        " Expectations for the #DemnDebate to address issues such as economic and racial inequality, climate change, healthcare, immigration, and foreign policy.",
        "al2"
    ],
    [
        " Never give up on your dreams and don't be scared to take a risk. #StayMotivated",
        "al2"
    ],
    [
        " Celebrating Thanksgiving with Gratitude and Appreciation#ThankfulThursday #Blessings #Thanksgiving",
        "al2"
    ],
    [
        " Connect with nature and create a better future! #EarthDay2016",
        "al2"
    ],
    [
        " Lamar Odom Passed Out In A Brothel #LamarOdomHealthCrisis",
        "al2"
    ],
    [
        " #DemDebate How does Trump plan to keep America safe from terrorist attacks?",
        "al2"
    ],
    [
        " Let us come together to give thanks and express gratitude for the blessings of this past year. #HappyThanksgiving",
        "al2"
    ],
    [
        " Grateful for the people speaking out about #KochFarms and #foodpoisoning! #Thanksgiving #USDA",
        "al2"
    ],
    [
        " \"Go with God, but go carefully!\" #SundayChurchSigns",
        "al2"
    ],
    [
        " No, it is not a good idea to make Election Day a day when the world #prayforParis. The purpose of Election Day is to participate in democracy and make decisions that help shape the future of the nation. Praying for Paris on election day would not be helpful in achieving that goal.",
        "al2"
    ],
    [
        " #Positivity Rules everything around me, CREEM #savagehabit",
        "al2"
    ],
    [
        " It’s not how much we give but how much love we put into giving #kindness #love #generosity",
        "al2"
    ],
    [
        " Working hard is only half of succeeding; the other half is believing in yourself.",
        "al2"
    ],
    [
        " #DumbGenieWishes For world peace and an end to poverty.",
        "al2"
    ],
    [
        " #FergusonRemembers Who is going to be held accountable for the numerous lives lost to police brutality? #BlackLivesMatter",
        "al2"
    ],
    [
        " Be the change you wish to see in the world.",
        "al2"
    ],
    [
        " A special thanks to all the first responders who risk their lives every day to protect us and keep us safe. #999Heroes",
        "al2"
    ],
    [
        " Aah the holidays, when the malls are crowded and no parking spots are to be found #ChristmasShoppingFail",
        "al2"
    ],
    [
        " #DemDebate The Democrats candidates discussed ways to combat terrorism, ways to rebuild crumbling infrastructure, and methods for creating jobs.",
        "al2"
    ],
    [
        " I'm sorry for all the pain and heartache I have caused by my decisions and actions. I sincerely apologize and regret everything I have done.",
        "al2"
    ],
    [
        " I've said and done some things I regret, and I am truly sorry for the pain and suffering I have caused. I take full responsibility for my actions, and I am committed to make amends with those affected by them.",
        "al2"
    ],
    [
        " It’s the most wonderful time of the year! #holidaySeason",
        "al2"
    ],
    [
        " It's so hard to live in a area where you don't feel safe #EndpoliceBrutality #BlackLivesMatter #FergusonRemembers",
        "al2"
    ],
    [
        " Invest in yourself, invest in your future! 🤩",
        "al2"
    ],
    [
        " Time to get ready for the #DemnDebate! Anything can happen tonight!",
        "al2"
    ],
    [
        " Cold winter nights & a warm fire, family & friends to make this season bright. #HappyHolidays",
        "al2"
    ],
    [
        " 1. What are your plans for the economy in the next four years? \n2. What is your strategy for reducing gun violence? \n3. How will you resolve the differences between Congress and the White House on immigration reforms? \n4. How will you reduce the divide between the communities of color and law enforcement? \n5. What plans do you have for improving access to affordable healthcare?",
        "al2"
    ],
    [
        " Invest in renewable energy to power our future #DemDebate #DemnDebate",
        "al2"
    ],
    [
        " Every human life is valuable, and no one should have to suffer needlessly. #End Homelessness",
        "al2"
    ],
    [
        " #WorldPeace starts within the #HeartofEveryPerson.",
        "al2"
    ],
    [
        " Faith is walking face-first and full-speed into the dark. -Elizabeth Gilbert",
        "al2"
    ],
    [
        " I expect lots of talking points and a few heated exchanges! #DemDebate",
        "al2"
    ],
    [
        " Who Will Protect LGBTQ Rights? #DemnDebate\n6. What Will Be Economically Sustainable? #DemnDebate\n7. How Will Affordable Health Care Be Secured? #DemnDebate\n8. How is America Working to Promote Gender Equality? #DemnDebate\n9. What Plans for Education for All? #DemnDebate\n10. How to Address Climate Change? #DemnDebate",
        "al2"
    ],
    [
        " Be your own kind of beautiful, never let someone define you. #DontCareWhatOtherSay",
        "al2"
    ],
    [
        " #ImThankfulFor having a family and friends to share Thanksgiving with this year. Wishing everyone a Happy and Safe #Thanksgiving!",
        "al2"
    ],
    [
        " #Thanksgiving What's the one dish you can't eat without?",
        "al2"
    ],
    [
        " Let's make a difference  Sit with your family and have a conversation about #Voting #ElectionDay",
        "al2"
    ],
    [
        " Love is not just a feeling, it's a choice. It's something you actively do every day to ensure your happiness and that of the person you love. #LoveIsReal #LoveIsChoice",
        "al2"
    ],
    [
        " This #Thanksgiving, thank the farmers who worked hard to provide us with food! #FoodJustice #USDA",
        "al2"
    ],
    [
        " #ParisAttacksWorldUnites Another terrorist attack in Paris, we must stay vigilant for safety",
        "al2"
    ],
    [
        " Life is too short to spend time worrying about the past or stressing about the future. Live in the present, enjoy every moment you have.",
        "al2"
    ],
    [
        " I don't understand why everyone's so excited about this new restaurant, #NoBigDeal",
        "al2"
    ],
    [
        " Let’s show our gratitude this #Thanksgiving by assisting those in need. #Grateful  #HelpEachOther",
        "al2"
    ],
    [
        " The greatest threat to our planet is the belief that someone else will save it. -Robert Swan",
        "al2"
    ],
    [
        " #DemDebate How does Hillary plan to ensure economic equality in the US? #DemDebate",
        "al2"
    ],
    [
        " It’s time to put #TeamWork and #Collaboration first. Together we can build something strong that will last. #UnitedWeStand",
        "al2"
    ],
    [
        " Taking a break to appreciate the little things. #SelfCareSunday",
        "al2"
    ],
    [
        " Stand up to those who would seek to divide us #showyoursupport",
        "al2"
    ],
    [
        " It is important to understand that progress sometimes requires us to step out of our comfort zones and take risks. #Change #Progress #Growth #ComfortZone",
        "al2"
    ],
    [
        " Everybody come together, let's make this world a better place #LetsUniteForLove",
        "al2"
    ],
    [
        " Why isn't anyone talking about climate change? #DemDebate #GlobalWarming",
        "al2"
    ],
    [
        " #ParisAttacks The global impact of the #ParisAttacks, and the need for solidarity and action.",
        "al2"
    ],
    [
        " RT @USAToday: From a Mexico wall to the minimum wage, here's what Ben Carson said at the Demn debate: #DemnDebate #BenCarson #MinimumWage",
        "al2"
    ],
    [
        " #FridayFeeling Ready for the weekend!",
        "al2"
    ],
    [
        " #PrayersForParis that all those affected by this senseless act are able to find strength, peace and comfort soon.",
        "al2"
    ],
    [
        " Life is too short to not be kind. #AWorldOfKindness",
        "al2"
    ],
    [
        " Get your groove on, it's time to dance!",
        "al2"
    ],
    [
        " #DemDebate What are your plans to handle security concerns in an increasingly digital world?",
        "al2"
    ],
    [
        " Five Easy Recipes for Thanksgiving That Everyone Will Love",
        "al2"
    ],
    [
        " #UnitedInAction is more important now than ever before. It's time to come together and make change! #DontGiveUp",
        "al2"
    ],
    [
        " #EndGunViolence Educate yourself on how to safely manage firearms, how to advocate for gun control, and how to become part of the movement to prevent gun violence.",
        "al2"
    ],
    [
        " Dream. Believe. Achieve. #UnitedStatesIn3Words",
        "al2"
    ],
    [
        " While the exact number of superdelegates who have publicly expressed their support for Hillary Clinton varies by source, in general, Clinton has a significant lead in the race for pledged support from the nearly 700 superdelegates.",
        "al2"
    ],
    [
        " #ImThankfulFor my family, my health and all the blessings I have received in life.",
        "al2"
    ],
    [
        " No, it is not a good idea to make election day a day when the world #prayforParis. The focus should be on the election and its importance to citizens. There are many other events that need prayer and support.",
        "al2"
    ],
    [
        " #NoTimeForHate compassion and understanding is the only path to reconciliation. #Ferguson",
        "al2"
    ],
    [
        " #ThrowbackThursday to the day of justice when we marched to #FightForFerguson #FergusonRemembers",
        "al2"
    ],
    [
        " #ImThankfulFor the incredible teachers and mentors I have had in my life who have shaped me into the person I am today.",
        "al2"
    ],
    [
        " It's hard to say goodbye, to people you love and cherish; easier to stay focused and carry on with life.",
        "al2"
    ],
    [
        "\nThe national debt is an urgent issue that needs to be addressed. Hillary Clinton has proposed increasing taxes on the wealthy, closing corporate tax loopholes, and investing in job creation to help stimulate the economy. She also supports sensible budget cuts and consolidating redundant federal programs to help reduce the deficit. With these measures, she believes that it is possible to reduce our nation's debt without harming social security and other vital programs.",
        "al2"
    ],
    [
        " Speak up for what you believe in, even if your voice shakes.",
        "al2"
    ],
    [
        " #DemDebate should be a productive discussion and not a contest on who has the best argument.",
        "al2"
    ],
    [
        " When a #naturaldisaster hits, it's amazing to see people coming together and helping one another. #LoveTrumpsHate #NaturalDisasterRelief",
        "al2"
    ],
    [
        " #CyberSecurity Awareness Month is a great reminder to update all your passwords regularly and enable two-factor authentication when possible.",
        "al2"
    ],
    [
        " Let's keep it real tonight #DemDebate. Stop the Blah Blah and talk about real issues that matter. #DemnDebate",
        "al2"
    ],
    [
        " Let’s support the communities that support us. #StrongerTogether",
        "al2"
    ],
    [
        " #MakeAmericaGreatAgain By investing in our people, not wars and corporate bailouts ♥️",
        "al2"
    ],
    [
        " Life is full of surprises, and it's important to be openminded and adaptable. That way, you'll make the most out of each opportunity that comes your way.",
        "al2"
    ],
    [
        " #NoJusticeNoPeace ! We all deserve equal rights no matter where we come from. #BlackLivesMatter",
        "al2"
    ],
    [
        " I'm sorry to hear that. Is there somebody you can talk to?",
        "al2"
    ],
    [
        " Innovative. Inclusive. Strong. #UnitedStatesIn3Words",
        "al2"
    ],
    [
        " We must take action to create the change we want to see in the world. #DemDebate #DemnDebate",
        "al2"
    ],
    [
        " #FlickFriday What is your favorite family home movie? Mine is It's a Wonderful Life with Jimmy Stewart #classicfilm",
        "al2"
    ],
    [
        " Goal setting and achieving success",
        "al2"
    ],
    [
        " “I believe in a world where the opportunity to reach our potential is not limited by our demographics — or our zip code.\" #DemDebate",
        "al2"
    ],
    [
        " It's easy to be negative but it takes courage to be positive",
        "al2"
    ],
    [
        " #HeroesAct It's time for real heroes. We need people who are brave enough to stand up to powerful interests and fight for the public good. #WeNeedHeroes",
        "al2"
    ],
    [
        " #FergusonRemembers demands justice for a community that’s been ignored for far too long. We must keep fighting for #socialjustice.",
        "al2"
    ]
]