[
    [
        " Life always offers you a second chance. It’s called tomorrow. #makesomethinghappen",
        "aL"
    ],
    [
        " Time to fuel the fire 🔥 Let's get out there and do something great today! #MondayMotivation",
        "aL"
    ],
    [
        " Why do we have to fight for justice? Enough is enough #JusticeForGeorgeFloyd #NoJusticeNoPeace",
        "aL"
    ],
    [
        " Ready to make a change? Join forces and stand up! #PowerOfVoices #BlackLivesMatter #Martisboro",
        "aL"
    ],
    [
        " Waiting for the weekend to come, Fresh gear and a new club to run #FridayNightVibes",
        "aL"
    ],
    [
        "𝑻𝒉𝒆 𝒔𝒆𝒂 𝒊𝒔 𝒈𝒐𝒊𝒏𝒈 𝒔𝒕𝒓𝒐𝒏𝒈𝒆𝒓, 𝒉𝒐𝒘 𝒍𝒐𝒏𝒈 𝒊𝒔 ",
        "aL"
    ],
    [
        " It's #EarthDay! Let's all work together to save our planet and make it a better place for future generations. #Environment",
        "aL"
    ],
    [
        " \"You Can't Stop a Movement\" #YouthPoweringChange",
        "aL"
    ],
    [
        " Taking a break today to just enjoy the beauty of nature and really appreciate the little things #NatureLover",
        "aL"
    ],
    [
        " Taking a break to clear my head and gain new energy. Time heals all wounds. #mentalhealthawareness",
        "aL"
    ],
    [
        " #TaxTheRich continues to be the rallying cry of people everywhere looking for economic justice. #99To1 #FairShare",
        "aL"
    ],
    [
        " The only thing that stands between you and your goal is the bullshit story you keep telling yourself as to why you can't achieve it.",
        "aL"
    ],
    [
        " Have you made your voice heard? Too many have been silenced. Speak up, raise your voice, and make a difference. #HumanRights ",
        "aL"
    ],
    [
        " #BeBoldForChange It's time to fight for equality and break the chains of oppression. #LetsDoItTogether #WomensMarch",
        "aL"
    ],
    [
        " Social media give us an opportunity to express our opinion on policies. #TakeAction #GOPDebate",
        "aL"
    ],
    [
        " Change the world by believing in yourself & the strength of our communities. #SpreadLoveNotHate",
        "aL"
    ],
    [
        " Trying to focus and stay productive until the weekend ☕️",
        "aL"
    ],
    [
        " The new iPhone 7 will be released later this year! #TechGeek #CantWait",
        "aL"
    ],
    [
        " Just watched #AvengersEndgame and it was sooo epic! Can't wait for #AvengersEndgame2",
        "aL"
    ],
    [
        " Right now the world needs more love, kindness and understanding #ShowLoveSpreadLove",
        "aL"
    ],
    [
        " Life's too short to stress yourself with unnecessary drama. No matter what size, always choose happiness. #happinessisescence",
        "aL"
    ],
    [
        " Take time to be grateful for all that you have, for it is our gratitude that creates abundance. #WisdomWednesday",
        "aL"
    ],
    [
        " I'm so over 2020 &#x1F914;  2021 can't come any faster! #CantWaitfor2021",
        "aL"
    ],
    [
        " My feet are planted squarely in the sand. Time for some beach reading ☀️ #SummerVibes",
        "aL"
    ],
    [
        " Change won't happen overnight, but by continuing to stand up for justice and equality, we can ensure #BlackLivesMatter",
        "aL"
    ],
    [
        " A revolution is upon us, the people will rise up and demand the change we need. #PowerToThePeople #UniteAndFight",
        "aL"
    ],
    [
        " Can’t wait to see the action-packed movie #WonderWoman out this week!",
        "aL"
    ],
    [
        " We must build bridges not walls and work together for a better world for all. #OneWorldOnePeople!",
        "aL"
    ],
    [
        " Just finished my workout, ready to tackle the rest of my day! #GymLife #NoExcuses",
        "aL"
    ],
    [
        " Standing up together is the only way to make a difference. Let's work together and make the world a better place. #worldpeace",
        "aL"
    ],
    [
        " #BlackLivesMatterEveryDay Join the movement and make it clear that black lives matter!",
        "aL"
    ],
    [
        " The path of growth is often fueled by learning from our mistakes. #growthmindset #alwayslearning\n",
        "aL"
    ],
    [
        " The UN has approved a motion to extend the International Criminal Court’s mandate into the future. #globaljustice #UN",
        "aL"
    ],
    [
        " Let's lead with love instead of hate. We can make this world a better place for everyone. #BeKind",
        "aL"
    ],
    [
        " Education is not preparation for life; education is life itself. - John Dewey",
        "aL"
    ],
    [
        " Life is a beautiful struggle and that's why it's worth living. #LifeMotivation",
        "aL"
    ],
    [
        " #MakeAmericaGreatAgain but NEVER forget the struggle & pain of our ancestors. #BlackHistoryAwareness",
        "aL"
    ],
    [
        " Just heard the amazing news! @NASA is planning a mission to explore Jupiter and its moons! #spaceadministration #missionexploration",
        "aL"
    ],
    [
        " This is why I love my job! #happyfriday #truesuccess 🎉",
        "aL"
    ],
    [
        " A reminder to never forget what is important: #BlackLivesMatter",
        "aL"
    ],
    [
        " Moving away from guns and violence and embracing peace and unity is the way to a brighter tomorrow #PositiveVibes",
        "aL"
    ],
    [
        " There is so much power to be derived through knowledge & understanding. Let’s invest in education and create the leaders of tomorrow! #EducationMatters",
        "aL"
    ],
    [
        " Life is a garden: dig it! #SelfCareSunday",
        "aL"
    ],
    [
        " #JusticeForMichaelBrown! His life has been taken and no one’s taken responsibility. We demand justice!",
        "aL"
    ],
    [
        " I can see a rainbow of promise in a world of uncertainty. #optimism",
        "aL"
    ],
    [
        " The power of music is undeniable. With a single song, you can change the world. #MusicHeals #FollowMeMusic 🤘🏽",
        "aL"
    ],
    [
        " #PoliceBrutality against black people must stop NOW #blacklivesmatter #endpoliceviolence #saynotoviolence",
        "aL"
    ],
    [
        " Life is full of surprises, and so am I! #motivation #inspiration #quotes #dailyquotes #fun",
        "aL"
    ],
    [
        " Happy Sunday everyone! Wishing you all a wonderful day! #blessed",
        "aL"
    ],
    [
        " Hey Washington, don't you think this crisis needs a stickier solution? #POTUSMeeting",
        "aL"
    ],
    [
        " “The most effective way to do it, is to do it.”- Amelia Earhart #InspirationalQuotes",
        "aL"
    ],
    [
        " There's so much beauty in small things: the way the sun sparkles on the water, the birds singing in the background, the stars twinkling at night.",
        "aL"
    ],
    [
        " Celebrate the amazing contributions African-Americans have given to our society! #BlackHistoryMonth",
        "aL"
    ],
    [
        " It’s incredible how #Science and #Technology are improving everyday lives #SetTheWorldOnFire",
        "aL"
    ],
    [
        " Chocolate Cherries are a must for the weekend 🍒 🍫 #ChocolateLover",
        "aL"
    ],
    [
        " Life is a journey, not a destination. Enjoy the ride 🚗 🎉 🎊 🎈",
        "aL"
    ],
    [
        " Rain or shine, it feels great to get up and out for a morning run! #endorphinhigh #RunningForever",
        "aL"
    ],
    [
        " I'm loving the fresh start a new day brings. #positivevibes",
        "aL"
    ],
    [
        " #MondayMotivation: Don't be afraid to start over. It's a new chance to build something even better. 💪",
        "aL"
    ],
    [
        " I don't know how to caption this photo of a puppy so happy to meet a baby deer! #tooCuteForWords #Pets",
        "aL"
    ],
    [
        " Devastated by the #phosphorusdisaster of pollution flowing into The American Falls, #FortHall, and Aberdeen #SaveOurFuture",
        "aL"
    ],
    [
        " Just found my new fitness motivation: HIIT workouts 💪 💪 💪 #fitness #workout",
        "aL"
    ],
    [
        " Going Through Self Care Sunday 💆🏼‍♀️♻️☕️🛀🏽✨",
        "aL"
    ],
    [
        " Just finished an amazing workout and am feeling amazing! #motivation #fitness",
        "aL"
    ],
    [
        " Stand up your rights! United we can bring the change these communities need #PeacefulProtest",
        "aL"
    ],
    [
        " Life is about learning to be the best version of ourselves and knowing how to make the most of every moment. #GratefulEveryday",
        "aL"
    ],
    [
        " Working hard to make our dreams come true ✨  #MondayMotivation #Goals #Quotes",
        "aL"
    ],
    [
        " We are learning together, let's check out my new blog post! #blogging #writing #edtech",
        "aL"
    ],
    [
        " Stand up for #socialjustice no matter how exhausting. ✊ #EndRacism",
        "aL"
    ],
    [
        " Just sent a random act of kindness, thank you for inspiring me! #SpreadingLove #RandomActsOfKindness",
        "aL"
    ],
    [
        " This isn't rocket science. If you want to be an #ally to the #BlackLivesMatter movement, support the cause financially and with your words! #onthemove",
        "aL"
    ],
    [
        " Can't lie, I'm so excited to see what happens in the #MCU next year 🤩",
        "aL"
    ],
    [
        " Keep your focus and stay strong. #StopTheHate",
        "aL"
    ],
    [
        " It's time to stand in solidarity with communities of color & fight racism. Every voice counts in the fight for equality. #BlackLivesMatter",
        "aL"
    ],
    [
        " #WhatInspiresMe is the strength each of us have to rise above our adversities and overcome our hurdles.",
        "aL"
    ],
    [
        " Others to poetry~The Police",
        "aL"
    ],
    [
        " Awesome day to #Unplug, disconnect from the digital and reconnect with the natural world. #NatureHeals",
        "aL"
    ],
    [
        " Conversation with my daughter: \"Mom, why don't bees need sunscreen?\" \"Well, honey, bees have an outer layer of wax that gives them natural SPF protection.\" #NatureIsAwesome",
        "aL"
    ],
    [
        " Just remembered tomorrow’s my friend’s birthday and I forgot to get her a gift! Oh no! Time to go shopping.",
        "aL"
    ],
    [
        " \"When you know better, you do better\" Maya Angelou #WednesdayWisdom",
        "aL"
    ],
    [
        " FYI we the people out here aren't about the government telling us what we accept or not. We determine our own fate! #StandUpForYouRights",
        "aL"
    ],
    [
        " The need for criminal justice reform cannot be overstated. Let's fight for #SmartJustice!",
        "aL"
    ],
    [
        " One act of #injustice is too much! #SayTheirNames #EndPoliceBrutality #BLM #blacklivesmatter",
        "aL"
    ],
    [
        " Today is a great day to make a pledge to stand with, support, and love all marginalized voices. #EveryoneHasAStory #LoveIsLove",
        "aL"
    ],
    [
        " Do something today that your future self will thank you for! #MondayMotivation",
        "aL"
    ],
    [
        " Working on my post-secondary agenda ! #Adulting #HardLife #StayWoke",
        "aL"
    ],
    [
        " Want to make a difference? Respect the voices of POC! 🗣 🙌 #amplifymelanatedvoices",
        "aL"
    ],
    [
        " Hey everyone, it's #ThrowbackThursday! Let's take it back to when Malcolm X said, \"Education is the passport to the future, for tomorrow belongs to those who prepare for it today.\"",
        "aL"
    ],
    [
        " Working on self-care is essential for mental and emotional stability. Get plenty of rest and mindfully practice gratitude every day!",
        "aL"
    ],
    [
        " Always speak your truth, never be afraid to express your thoughts and feelings. #freedomofspeech",
        "aL"
    ],
    [
        " Let's keep talking about racism, break through the uncomfortable conversations, and move towards positive action and change.",
        "aL"
    ],
    [
        " Just successfully completed a 7k! Time to refuel with some tasty protein 💪🏻",
        "aL"
    ],
    [
        " Taking a break and watching some of my fave TV shows! #relaxing #chillmode 🤩",
        "aL"
    ],
    [
        " Venting is sooooo important when trying to deal with your emotions. #ventingformentalhealth",
        "aL"
    ],
    [
        " So much to learn and so much to celebrate! Celebrate the end of a powerful #BlackHistoryMonth!",
        "aL"
    ],
    [
        " Look at the amazing things you can do with social media. #motivationmonday #hashtag",
        "aL"
    ],
    [
        " Just made some fluffy chocolate #cupcakes....Come and get 'em while they're hot!",
        "aL"
    ],
    [
        " Life is like an ice-cream cone, Enjoy it before it melts. #CarpeDiem",
        "aL"
    ],
    [
        " What a time to be alive! #mindblown",
        "aL"
    ],
    [
        " How can a society progress if its citizens are not free to think & explore? #FreedomOfExpression",
        "aL"
    ]
]