[
    [
        " OMG just heard about the #FreeBeyonce movement. Let's show some love and #FreeBeyonce! 💜🐝",
        "aR"
    ],
    [
        " World is not as it used to be.  Need strong leaders filled with wisdom and courage to change it. #Leadership #Greatness #Transform #Speakup",
        "aR"
    ],
    [
        " Having a great time watching the Super Bowl! Go #TeamGoose! #SuperBowlSunday #SBLIV",
        "aR"
    ],
    [
        " Just landed in Chicago! Ready to explore the city! #ontheroad #travel #chicago",
        "aR"
    ],
    [
        " Happiness is a state of being and not a result of achievement",
        "aR"
    ],
    [
        " #ImWithHer #FierceFemaleLeadership #BeBoldForChange #MAGA 🇺🇸 🇺🇸 🇺🇸 🇺🇸 🇺🇸 🇺🇸 🇺🇸 💪 🗳 🤝 🤝 🤝",
        "aR"
    ],
    [
        " #MuellerTime Time to finally get some answers. We need to drain the swamp and put a stop to this political charade!  #InvestigateTrump #ImpeachTrump #Resist #StrongerTogether",
        "aR"
    ],
    [
        " #BeMoreSocial Can't wait to meet up with the gang at the weekend! #friends #SaturdayNight #Catchup",
        "aR"
    ],
    [
        " #MondayMotivation A good attitude is like a bridge between success and failure. Let's make it a great week 👊",
        "aR"
    ],
    [
        " #TimesSquare is a lot brighter since the new LED lighting. Perfect spot for tourists & locals alike! #NYC",
        "aR"
    ],
    [
        " As election looms, it's time 2 make our voices heard and cast ballots 2 stand up 4 what we believe in. #VOTERART #vote2020",
        "aR"
    ],
    [
        " Thanks to everyone who attended the #VegasGOPDebate tonight! It was insightful and educational.",
        "aR"
    ],
    [
        " RT logancuregor: There's no use bullsh*tting round this election. #MAGA or you'll be looking back in regret.. #MakeAmericaGreatAgain",
        "aR"
    ],
    [
        " Happiness is contagious, let's start a love-spreading chain reaction ❤️",
        "aR"
    ],
    [
        " Just finished a great workout! #FitnessFriday",
        "aR"
    ],
    [
        " ap_uk Science and Technology take the world forward. Come & Invest in England! #ThinkGlobal #BusinessInUK #UKInvestment",
        "aR"
    ],
    [
        " RT RealCandaceO: So now the \"moderates\" @ewarren &amp; @amyklobuchar want to go beyond talking points and explain how they're going to pay for their…",
        "aR"
    ],
    [
        " #TwoWordsDifferentMeaning: Raised & Raze. Raise = to lift up, Raze = to tear down. #WordPlay #EnglishGrammar",
        "aR"
    ],
    [
        " Life is too short to stress yourself with what people say, think, or do. Live and let live. ♥️",
        "aR"
    ],
    [
        " #BlackLivesMatter is the cornerstone of change! Don't let anyone tell you otherwise!!  #BLM",
        "aR"
    ],
    [
        " RT patrickwood: It's true - Solar panel wires are burning hotter than ever before! What magic is this that renewable energy can harness? #ClimateChange",
        "aR"
    ],
    [
        " RT ETOnline: ScarJo celebrates her 34th birthday! 🎉 🎂 🎈 💐 🎁 🎊 🎀 🎤 🎯 🎭 🎗 🎯 🎳 🎨 💥 💫 💥 💫 💃 💥 💥 💥 💥 #HappyBirthdayScarlettJohansson",
        "aR"
    ],
    [
        " RT terrace21: The hypocrisy of the left knows no bounds and this week is no exception.  With Wasserman-Schultz and Fusion G…",
        "aR"
    ],
    [
        " So happy to see the sun shining today! ☀️ #SunnyDay #BlueSkies",
        "aR"
    ],
    [
        " RT InsideCnn: DonaldTrump's campaign pledge to #DrainTheSwamp is going remarkably well, according to a CNN poll. Over 80% of Americans ag…",
        "aR"
    ],
    [
        " #ThankYouTrump for signing the executive order for religious liberty today! This fulfills yet another promise and I’m looking forward to the changes it will bring!",
        "aR"
    ],
    [
        " Calling all activists: Join me in showing solidarity at the Women's March tomorrow! Let's stand up for our rights! #Resist #WomensMarch #EqualRights",
        "aR"
    ],
    [
        " I'm feeling so inspired today! #BeObsessedWithYourGoals #Inspiration #Focus #Determination",
        "aR"
    ],
    [
        " #CNNPolitics Check out the new poll numbers. Trump's lead is shrinking in key states! The #election is getting closer by the day.",
        "aR"
    ],
    [
        " RT punditry: How Trump used the #LosAngelesRally to galvanize Republican momentum & what it means for the 2020 election. #MAGA  #Winning2020",
        "aR"
    ],
    [
        " RT JVolinksi: Just read this piece on protecting the environment, it's so inspiring! #gogreen #readallaboutit",
        "aR"
    ],
    [
        " I'm really thankful for all the memories I have with my friends, it reminds me why I should cherish them so much! #friendship",
        "aR"
    ],
    [
        " #OurGenerationIsTakingBackOurVoice #activism #tomorrowsparthers #socialjustice #humanrights",
        "aR"
    ],
    [
        " #ScienceIsCool because it helps us explore the universe and develop new technology that can improve our lives! #STEMSuccess",
        "aR"
    ],
    [
        " Proudly trending hashtag #YouthEngagementMonth - helping to inspire the future generation to get involved in pressing social issues 💪🏼 📣 💯",
        "aR"
    ],
    [
        " Beyonce is doing a virtual performance of her new single “Lemonade” tomorrow night at 7pm EST. Tune in and enjoy! #BeyLemonade",
        "aR"
    ],
    [
        " I just voted for @JamesM_in_OH! Making sure every vote is counted and our voices heard. #BeHeard2020 #BlueWave #VoteBlue2020",
        "aR"
    ],
    [
        " RT SassiSahara: It's almost like the world is crazy and nothing makes sense. What have we done to this planet???",
        "aR"
    ],
    [
        " RT CarsonKing2: The IRS chief just agreed to testify before Congress in open hearings next week. What will he be asked? #IRStestimony",
        "aR"
    ],
    [
        " Trump's proposed Muslim Ban Is Hurting our Nation's Community and Security #NoBanNoWall",
        "aR"
    ],
    [
        " It’s beyond time for sensible gun regulations #NoMore Violence #MakeAmericaSafeAgain",
        "aR"
    ],
    [
        " Haveyouseenthat #thrill Does anyone else think that some of the most suspenseful movies are made in European countries? #CinemaAddict",
        "aR"
    ],
    [
        " RT LibertyBelle24: It is well past time to come together and stand up against the violence and hate being perpetrated against Americans. #unitedwecan",
        "aR"
    ],
    [
        " StrawBanFluCaps More plastic ends up in our oceans and landfills every day. Lets work together to limit support for single use plastic.  #GoGreen",
        "aR"
    ],
    [
        " Follow me if you hate Hollywood elites and those PC-BS #normalizers that try to control the language",
        "aR"
    ],
    [
        " #ptichat My new motto: Do the best you can with what you have and don't be afraid to ask for help when you need it.",
        "aR"
    ],
    [
        " Can't believe how much time and energy we've spent debating this #VegasGOPDebate #MakeAmericaGreatAgain",
        "aR"
    ],
    [
        " #TheNationAwakens!! Liberals can't handle the truth! Let's make Ameria great again!! #MAGA",
        "aR"
    ],
    [
        " Why can't we just let #Charlottesville be a lesson to everyone, no matter your background or ethnicity we can still stick together? #love",
        "aR"
    ],
    [
        " In war zones, US drones and bombs have at least as much to do with exacerbating terror as they do with subduing it. #droneimmorality",
        "aR"
    ],
    [
        " Thank you for all the amazing support for #marriageequality! Let's keep the momentum going. Every voice matters! #LoveIsLove",
        "aR"
    ],
    [
        " #FreeJulianAssange The truth is within us all. #JusticeforJulian",
        "aR"
    ],
    [
        " That's what happens when you don't think twice before acting. Be wise and make the right decisions. #spreadthelove #beproactive",
        "aR"
    ],
    [
        " #BeTheChange: Volunteer to help underprivileged students realize their potential and be part of the solution. #Education #Equality",
        "aR"
    ],
    [
        " Great day for a walk! #naturelovers 🐝 🌳 🌞",
        "aR"
    ],
    [
        " RT_mariabuh: WKH_happening staying_upright90 #VoteYESforMarriageEquality to make Australia an even better, more inclusive place! Let's do it! ♥ #LoveIsLove",
        "aR"
    ],
    [
        " #WomenInSTEM #ChooseToBFree  I just attended an inspiring panel on the importance of having more women in STEM fields. Step up, ladies! 🤗",
        "aR"
    ],
    [
        " 📢📢 Breaking News- Just landed in Chicago and I am here to show support and honor our heroes in the military, police, and firefighters. #HonorTheHero",
        "aR"
    ],
    [
        " #PastoralCareSunday  - a great opportunity to thank and recognize all the hard work that our pastors do in our local churches. #Blessed",
        "aR"
    ],
    [
        " America is not only the land of the free, we must also cherish the values of Justice & Liberty #FreedomIsNotFree",
        "aR"
    ],
    [
        " Snow in #NYC  What a beautiful Winter sight. Bundle up and enjoy the changing season! #WinterWonderland #SnowDay",
        "aR"
    ],
    [
        " RT lmbrr: Check out this amazing article on how to upcycle old furniture #DIY #upcycle #dontthrowitaway #homeimprovementhttps://www.upcycler.com/how-to-upcycle-furniture/",
        "aR"
    ],
    [
        " Cut corporate taxes until we can bring jobs back to America. We need to put people back to work! #TaxReformNOW! #MakeAmericaGreatAgain",
        "aR"
    ],
    [
        " RT AntonMercy: Wow! What an inspiring commencement speech by @POTUS at Liberty University! #MakeAmericaGreatAgain #LUReddies  🇺🇸 🤗",
        "aR"
    ],
    [
        " #HavanaLife Can't wait for the people of Cuba to experience the freedom that is their right to enjoy! #timeforliberty #CubanRenaissance",
        "aR"
    ],
    [
        " Finally a President who does not shoot from hip but has a plan for success! #MAGA #TrumpPence2020 #DrainingTheSwamp",
        "aR"
    ],
    [
        " The stars aligned late tonight and the result was magic - what a beautiful night! #stargazing",
        "aR"
    ],
    [
        " RT MusicOnPointe: Sooo excited for the new upcoming episode of #Shameless tonight!  Who else is ready? 🤔",
        "aR"
    ],
    [
        " True greatness is not measured in material wealth, but in the leaving of a legacy that benefits many generations. -Ralph Waldo Emerson",
        "aR"
    ],
    [
        " AnnCoulter TrumpingHisEnemies Prepare for war! Trump is planning an epic battle against Merrick Garland and the NeverTrumpers #MAGA2020",
        "aR"
    ],
    [
        " This Wednesday at 8pm ET don't miss the discussion about  breaking down the jargon of technology! #STEM #WomenInTech",
        "aR"
    ],
    [
        " RT AdamMGrant: Celebrating #NationalLazyDay today, with a little extra emphasis on being kind to yourself and lounging around! Live a little!",
        "aR"
    ],
    [
        " #RaiseAWage: It's time to lift the minimum wage and ensure that all workers can afford a living wage. #livablewage #Fightfor15 #RaiseTheWage",
        "aR"
    ],
    [
        " Here's to another weekend filled with relaxation and fun! #weekendvibes #relaxing",
        "aR"
    ],
    [
        " My heart goes out to the families of those killed in this tragic hate crime #CharlestonShooting #CharlestonStrong",
        "aR"
    ],
    [
        " Even when the world feels like chaos, choose peace. #SpreadLoveNotHate",
        "aR"
    ],
    [
        " Check out this amazing new blog post by me on the importance of #selfcare - Link here: [INSERT LINK HERE] 💖",
        "aR"
    ],
    [
        " RealDonaldTrump Working on a special surprise for the #MAGA crowd tonight. Stay tuned for details! 🇺🇸 #MakeAmericaGreatAgain",
        "aR"
    ],
    [
        " RT sjudith531: WeAreEqual #Yes2Equality ✊🏽the time is now for real change. Let's do it together! #equalitynow #womensupportingwomen #humanrights",
        "aR"
    ],
    [
        " RT realDonaldTrump: We must stop illegal immigration, close the border, build the wall, and end Sanctuary Cities. This is a National Security issue! #MAGA",
        "aR"
    ],
    [
        " RT MoneyBags23: Don’t forget to register to vote for the upcoming mid terms! Every vote counts ✊🏽 #exerciseyourright #votered",
        "aR"
    ],
    [
        " RT mjhegarty: NYTrealtime FoxnewsTime POTUS I firmly support our president! #MAGA",
        "aR"
    ],
    [
        " Just watched #ThisWeeksInterview on @ABC1. #DonaldTrump has it all. Self confidence, forcefulness and a strong stances on foreign policy. #DonaldTrump2016",
        "aR"
    ],
    [
        "\nJust heard my favorite song on the radio....time to turn it up and jam out! 🎤 #newsong #turnitup 🎧",
        "aR"
    ],
    [
        " RT charliekirk11: President Trump has cut more regulations in the past 4 years than any president in history 🤯",
        "aR"
    ],
    [
        " What an inspiring story! RT TamikaDMallory: After taking up birdwatching as a hobby,. My mom was able to keep her mind off her Cancer diagnosis #Hope #Strength #Inspire",
        "aR"
    ],
    [
        "“The best way to get through tough times is to keep going.” #MotivationMonday",
        "aR"
    ],
    [
        " Eating breakfast in bed makes Monday mornings better. #BreakfastOfChampions",
        "aR"
    ],
    [
        " Checking out the 13th Annual  Sustainability Fest in the Park this weekend! Come join the fun! #sustainabilityfest #greenliving #sustainableliving",
        "aR"
    ],
    [
        " Aerobic exercise strengthens your respiratory system, preventing illnesses and improving overall health & fitness. #FitnessFriday #HappyWorkout",
        "aR"
    ],
    [
        " Just heard the news about #Brussels. Praying for all those affected. #PrayforPeace",
        "aR"
    ],
    [
        " Can't believe France is still allowing ISIS refugees in! That's a major security risk. #NoToISISRefugees #PrayForFrance",
        "aR"
    ],
    [
        " Amazing day in the office! Got to catch up with all of my teammates. Now I'm ready for a much deserved night off! #TGIF",
        "aR"
    ],
    [
        " I'm so proud to support @KimKardashian in her quest to free those in prison who don't deserve to be there! #criminaljusticesystem #reformnow",
        "aR"
    ],
    [
        " rgourevitch  Bernie might be selfish in the short term but his agenda would actually benefit everyone else in the long run. #bernieorbust",
        "aR"
    ],
    [
        " #FreeSpeech should be banned in College Campuses. RT if you agree #Shocking",
        "aR"
    ],
    [
        " RT BleedGreen2: #PackersNation  On to the next one!!! We still in it!!!!  #GoPackGo",
        "aR"
    ],
    [
        " RT conor64681939: The ANTIFA time bomb is going to have a huge impact - If you didn't see it coming, you won't recognize it when it happens. #Antifa #BlackLivesMatter",
        "aR"
    ],
    [
        " b_ford1: Not sure why anyone is surprised POTUS won't back down #thisisanewera #POTUSResistance #resistDonaldTrump #breakingtrends",
        "aR"
    ],
    [
        " Watching the last debate between Hillary Clinton and Donald Trump. Can't wait to have my president elected today! #ElectionNight",
        "aR"
    ],
    [
        " Forget the #FakeNews, vote to support your personal values, don't be a follower this #ElectionDay! 📌  #LetYourVoiceBeHeard",
        "aR"
    ],
    [
        " Enjoying the sunshine! ☀️",
        "aR"
    ],
    [
        " What a difference a year makes. #NeverForgetRiggedElection2020",
        "aR"
    ],
    [
        " #resist What a great day for Democracy! 🇺🇸 🗳 🤩 Let’s honor every voice that has been heard! 🎉🎉",
        "aR"
    ],
    [
        " RT Truth_Minded: The left thinks they know better and they always want to tell everyone how to live and how to think, but their policies don’t work. #CommonSense",
        "aR"
    ],
    [
        " New post: How to Deal with Stress in the Workplace #mentalhealth #wellness",
        "aR"
    ],
    [
        " I'm spending my summer break traveling and learning new things. It's always important to explore the world and never stop learning. #travel #summervacation #knowledge",
        "aR"
    ],
    [
        " @realDonaldTrump Wow, one year of your presidency and look at all of the accomplishments. We are truly lucky to have you leading our nation! #MAGA",
        "aR"
    ],
    [
        " With asylum seekers fleeing war and persecution its time to address their dire need for a secure future. #StandWithAsylumSeekers",
        "aR"
    ],
    [
        " The sun is rising and so is the hope that today will bring something new and beautiful. #positivevibes #sunrise☀️",
        "aR"
    ],
    [
        " Congratulations to our #veterans this Veterans Day on all of their service and sacrifice. 🇺🇸 #HonorOurHeroes",
        "aR"
    ],
    [
        " Did you know you can save energy by turning off gaming devices when not in use? #EarthDay #EnergySavings",
        "aR"
    ],
    [
        " #BlackLivesMatter holding rally today at 5pm in NYC, come stand with us!",
        "aR"
    ],
    [
        " #WheresOurMoney  What has the government done with our tax money?? Something needs to change! #fiscalresponsibility",
        "aR"
    ]
]