[
    "The home should be the treasure chest of living.  – Le Corbusier",
    "Trump's Plan to Make America's Infrastructure Great Again  #politics",
    "The privilege of a lifetime is being who you are.  – Joseph Campbell",
    "My attitude will always be based on how you treat me.",
    "Trump’s Comments on Crimea Raise ‘Serious Concerns:’ Ambassador  #politics",
    "#IslamKills The analogy does not hold. Some refugees ARE terrorists. The only real debate is about the probabilities. #StopIslam",
    "Hillary was seated for most of the #debate.. She was very weak &amp; showing lack of stamina..\n\n#TrumpWon",
    "Friends show their love in times of trouble, not in happiness. – Euripides",
    "#ProbableTrumpsTweets I am definitely not trying to distract you from anything with those burning flag tweets, believe me",
    "Jordan makes a good deed for all of us! #PPLvsISIS",
    "#IslamKills If just 1 ISIS member slips through as a refugee here, than we have let too many in #StopIslam",
    "I believe compassion to be one of the few things we can practice that will bring immediate and long-term happiness to our lives.",
    "We read all these newspapers and continue thinking we have the freedom of speech but it's wrong! #SlaveryOfSpeech",
    "What's the earth with all its art, verse, music, worth  – Compared with #love, found, gained, and kept?",
    "I may never know your reasons why, but someday I'm going to see the good in your goodbye #JasonAldean",
    "Current congress moves show disrespect to the president and their plans on their presidency #CongresidentLetter",
    "#Homer #TheIliad: There is the heat of #Love... #book #bookquotes #quote #quotes #lovequotes",
    "\"Rotten Twitter suspended my account 4 three days.  Don't they know that I made that illegal? Will be suing next week",
    "Kerry will be responsible if Iran got a weapon! #KerryDoSmth",
    "A high school football announcer said anyone who sits during the anthem should be shot.",
    "The USA is the ONLY country that has, in our Constitution, our GOD GIVEN right to protect us from ALL enemies #Guns4NY",
    "GOP convention day 1: Delegate uprising and plagiarism allegations  #news",
    "#GOPDebate We need a concervative as our next president as the liberals have already ruined everything #VegasGOPDebate",
    "When I get drunk I sing all the words I want to say in a Disney manner (that's true) #ReasonsMyLifeIsACartoon",
    "#ThingsInventedWhileHigh  Hahaha cookies bc you get rael hungery when da bobg",
    "The planets move around the sun in perfect harmony. Each planet is happy with its place in the universe. Let us also be happy with ours.",
    "#RealLifeMagicSpells Salarium Raisium when your boss does not agree that you're more valuable than the money he pays you rn",
    "Comedians Stewart and Colbert ecstatic over Donald Trump presidential bid",
    "#HalloweenPartyToDoList \nGet invited to a party, get wasted, cry at my own insecurities",
    "#My2017BiggestHope Stop interacting with SJWs. I hope they'd really leave the country",
    "#MakeMusicReligious I can feel it coming in the prayer tonight, oh Lord",
    "Turkey sandwiches go well with vanilla milkshakes. The milkshakes cover the taste of Ambien. Enjoy the silence. #SurvivalGuideToThanksgiving",
    "Educating the mind without educating the heart is no education at all.  – Aristotle",
    "When you smile, the whole world stops and stares for a while.",
    "#ThingsToBeAshamedOf  spending entirely too much time tweeting when I should be doing dishes or ordering #",
    "Life is lived one day at a time. The way to prepare for tomorrow is to live at your very best today.",
    "A new wedding dress was inspired by Elsa Frozen, made by a famous designer. Pic:",
    "May 15th is the Peace Officers Memorial Day! Thanks all officers for making our life peaceful! #HonorForTheBrave",
    "#IGetDepressedWhen you get judged on the basis of what you look like before you have even uttered a word......",
    "My opinion is that Jeb Bush will be quite aggressive in foreign policy.That's not what US need right now #JebWeCan #ILoveHillary",
    "#Prayers4California #2A guarantees the individual right to own a gun. Prohibiting guns will violate our rights and freedoms",
    "#ThingsPeopleOnTwitterLike #TheWalkingDead apparently I haven't  watched it yet and your all spoiling it . Oh well",
    "So many people can be responsible for your success, but only you are responsible for your failure. – Unknown",
    "#IslamKills some terrorists abuses refugee rights to travel and commit suicide bombings or terror acts #StopIslam",
    "#ICelebrateTrumpWith forgetting his real surname was Drumpf",
    "Ohio State University shooter is dead and it's good #PrayForOSU",
    "#TaxesForAlQaeda I wouldn’t be so bothered about the issue if it wasn`t for OUR money involved!!! Bring back our tax money!",
    "The expression a woman wears on her face is far more important than the clothes she wears on her back -Dale Carnegie",
    "NewsOne Now Audio Podcast: Bishop E.W. Jackson Calls #BlackLivesMatter Is Movement “Disgraceful”",
    "Happy 'World Day Against Cyber Censorship'! #NoCyberCensorship",
    "Change your mind and change your lifestyle? Must follow",
    "#InHonorOf #MemorialDay I feel deeply for all those who never saw their loved ones back from war",
    "#ToDoListBeforeChristmas prepare my surprised face when I'll see the pair of socks that my grandma will gift me",
    "#ThingsPeopleOnTwitterLike those yellow face things..",
    "All the water in the area is contaminated with #phosphorus!!! #phosphorusdisaster",
    "#IKnewWeWereDoomed when they stopped teaching cursive in school.",
    "Many of them are rapist and murderers,  #AndThenIShouldHaveSaid, I am a racist and bigot! Donald J. Trump",
    "#SometimesItsOkTo grab someone by the pussy. *Obviously, doesn't apply to presidential candidates",
    "they kill citizens like native americans in 19th century drinking water is poisoned, a nightmare! #phosphorusdisaster",
    "Sick of your party ignoring you until a month b4 elections? Go #UNAfyAmerica #NoBootyCall #ElectileDysfunction #ThePartysOver #PJNET",
    "GOP Rep. Boustany sues author, publisher over prostitution accusations  #politics",
    "#ImAlwaysOkWith random people sharing their pizza with me even when I know they really didn't want to",
    "Have enough courage to trust love one more time and always one more time.",
    "3-4 hours till polls open. Go out and vote for Trump! Do not let USA down!  #TrumpPence16 #TrumpTrain #USElections2016 #TrumpForPresident",
    "#SurvivalGuideToThanksgiving let the firs phrase you say be: I do crossfit, vape and I'm vegan Everybody will avoid talking to you",
    "What you can do today is to thank people for putting their lives on the line on a daily basis at any hour to help us #SupremeSacrificeDay",
    "#ThingsMoreTrustedThanHillary A fart when I have diarrhea",
    "#OverHeardAtTheWishingWell I wish that girl from The Ring would stop climbing up the walls.",
    "Daily Mail publishes retraction to a story at the center of Melania Trump lawsuit  #politics",
    "#StopIslam If you honestly think that none of the Syrian refugees are ISIS soldiers, you're an idiot #IslamKills",
    "If you jump the fence at the DNC, you get arrested\nIf you jumped the fence at the Mexican border, you get to speak at the DNC\n¯\\_(ツ)_/¯",
    "Pro-Putin party wins Russian parliamentary election  #news",
    "Obama hopes for progress on Mosul by year-end  #news",
    "What?! Little Mermaid and Mary Poppins also appear in Frozen? Here’s the pic:",
    "Start a huge, foolish project, like Noah... it makes absolutely no difference what people think of you.  – Rumi",
    "Trump: \"America was shocked to its core when our police officers in #Dallas were so brutally executed.\" #RNCinCLE  #Trump2016",
    "DHS: U.S. government retains its right to revoke visas at any time if required for national security.\n#MuslimBan #StopPresidentBannon",
    "#TrumpBecause He's just a reliable professional. So why not give him the job. Can't see anyone at least close to him #Trump2016 🎅🏿👅👈🏿",
    "No more hashtag word limits  #WhatIWantForChristmasIn4Words",
    "Perhaps, after all, America never has been discovered. I myself would say that it had merely been detected.",
    "Donald Trump to host one of the largest town hall meetings in Mobile, AL",
    "Hannah and Her Sisters That Rock the Cradle #AddAMovieRuinAMovie",
    "The difference between the impossible and the possible lies in a man's determination. -Tommy Lasorda",
    "#TrumpBecause #Bush has family history, #Hillary has a history of lies, #Trump has a long history of achieving what he wanted",
    "Most of us probably feel we couldn't be free without newspapers, and that is the real reason we want the newspapers to be free.",
    "Don't date that weird kid that always kept looking at you. You'll thank me one day.  #WhatIWouldTellA15YearOldMe",
    "We need justice for #BlackSkinIsNotACrime and justice for #AltonSterling #PhilandoCastile",
    "Ask the black guy sitting next to you what he thinks of Donald Trump.  #THINGSTODOINAWAITINGROOM  KX",
    "Palestinians, Israeli police clash at Jerusalem shrine for third day",
    "#TheTroubleWithAddiction Is only one entry on your \"To Do\" list. Every day.",
    "U.S. ELECTION WRAP: Clinton Up in First Wave of Key Post-Debate Polls  #politics",
    "I’m not afraid of dying. I’m afraid of not trying  – Jay-Z",
    "Music is everybody's possession. It's only publishers who think that people own it.",
    "Earth provides enough to satisfy every man's needs, but not every man's greed.  – Mahatma Gandhi",
    "Sometimes people are beautiful. Not in looks. Not in what they say. Just in what they are",
    "#ReasonsIAintInARelationship  All about Growing myself To stability....physically mentally and emotionally",
    "#TrumpBecause There’s an old German proverb to the effect that “fear makes the wolf bigger than he is,” and that is true",
    "#DemDebate won't help 'em, Trump is near the finish line #DemDebateMiami",
    "I'd rather learn from one bird how to sing than teach ten thousand stars how not to dance",
    "You don't have to be great to start, but you have to start to be great - Joe Sarah #quotes",
    "They both are too old to be our president #DemDebate #DemDebateMiami",
    "no no no no no no no, no it ain't no fun, waiting round to be a millionaire #hope",
    "Me, left in a room of marijuana, with a lighter and pipe. #ThingsMoreTrustedThanHillary",
    "« A great many people think they are thinking when they are merely rearranging their prejudices. » William James",
    "Christie to RNC: Clinton Earns 'Guilty' Verdict  #politics",
    "#HowToLoseYourJob praise the HR department of the competitor company at the sales meeting",
    "Take on pass on uncle Leatherface's baked ham.   #SurvivalGuideToThanksgiving",
    "#TrumpCare, You may rely on it #UnlikelyMagic8BallAnswers",
    "Barack Obama will take whole October off to help Clinton campaign. He CAN'T do his job and wants his criminal friend to win! #NeverHillary",
    "If we are limited to non-assault rifles, any invader with an AK-47 would have an easy day #2A #tcot  #Prayers4California",
    "#Brussels #IslamKills Dem's not happy with wars being stopped over sea's, desire to restart the wars on American soil",
    "#UnlikelyMagic8BallAnswers \"You never should have run for president.\"",
    "What the world needs is more geniuses with humility, there are so few of us left.",
    "#ThingsMoreTrustedThanHillary unsafe sex with a homeless",
    "So a dentist is responsible for killing a lion, but when people are killed, the #gun is responsible  #Prayers4California",
    "Clinton Foundation Pledges to Ban Foreign, Corporate Donations If Hillary Clinton Elected  #politics",
    "#SomedayIdLikeToSee the sun set into the Pacific while watching the waves turn the colors into a rainbow of beauty",
    "Clinton Leads Trump by 9 Ppts in New Hampshire in CBS News Poll  #politics",
    "Trump's tax records show he could have avoided paying taxes for 18 years  #politics",
    "« Character may almost be called the most effective means of persuasion. » Aristotle",
    "#ThingsInventedWhileHigh   Drugs do not make people stupid.  They are merely catalysts.  You were already stupid",
    "#SomedayIdLikeToSee my wife naked! \"Sweetie, its someday!\"",
    "There are millions of stars in the sky. You only have to wish on one.",
    "#TrumpBecause operate your day-to-day business as if bad times are always here,” which is a great precaution 🙈🙉🙊",
    "Israel is our alliance partner we can’t put it in danger #BibiVsObama",
    "Donald Trump's speeches always sound like he's trying really hard to impress an ex he just ran into. #RNCinCLE",
    "#TopNews Pressure on Trump likely to be intense at second debate with Clinton",
    "As you go through life you'll see, there is so much that we don't understand. – Simba (The Lion King II)",
    "Trump campaign insists again Melania's speech not plagiarized: T  #Cleveland #politics",
    "#IGetDepressedWhen You fave everyone else's tweet in the convo except mine. Nah, actually I just think you're a douche!",
    "#RealLifeMagicSpells Monday (be careful with this one, it works for good only if you love your job)",
    "My heart is too heavy to keep seeing my people being murdered. #MikeBrown #FergusonRemembers",
    "Being in love means being yourself. So when you find someone who accepts and appreciates you for who and what you are, never let them go.",
    "#ICelebrateTrumpWith building a wall around my backyard. Just in case.",
    "A hero is no braver than an ordinary man, but he is brave five minutes longer.  – Ralph Waldo Emerson",
    "People often stand behind a criminal and a bully, if they think they are going to get something out of it #InMemoryOfMalcolmX",
    "Fair go (2014)  A preggers copper susses out homicides after a dodgy car salesman hires 2 crims to kidnap his missus  #MakeTVShowsAustralian",
    "I'm not afraid to try again, I'm just afraid of getting hurt for the same reason.",
    "After each game, I want to be able to say: I gave it all I could, I gave it my best. -Unknown",
    "What's wrong with this country?!?!?! #Guns4NY",
    "#Alcohol, what's that? It's not in my vodkabulary, but let me check in whiskypedia",
    "Obama belives that talking is enough to solve any problem #GulfStatesTalks  #CampDavidSummit",
    "She's a good hearted woman in love with a good timing man. She loves him in spite of his ways that she don't understand. #WaylonJennings",
    "#MyEmmyNominationWouldBe  in the category of Giggling most often at the most inappropriate times",
    "#IGetDepressedWhen people with huge talent give up because they hit a challenge and don't know what to do",
    "It isn't where you come from, it's where you're going that counts.  – Ella Fitzgerald",
    "Persistent misspelling of musical collectives and rubber hoops....  #MustBeBanned",
    "You're gonna be alright. You'll find amazing friends. You'll live in the UK. You'll be a great journalist. #WhatIWouldTellA15YearOldMe",
    "#GOPDebate Trump is so right, #refugeesarenotwelcome #VegasGOPDebate",
    "#MyEmmyNominationWouldBe for this collection of ridiculous f*cked up comedy that started my Monday of laughing",
    "If you want to complain about #OscarsSoWhite but youre voting Democrat, you can officially shut your mouth #OscarHasNoColor",
    "The Syrian refugees are a lot of the time terrorists, so they have justified reasons to deny them. #IslamKills #Brussels",
    "#Brussels #IslamKills What to do about refugees? No agreement in Europe.",
    "Liberalism only works when the young salves to govt, pay to build the anti-America freedom",
    "Chicago protesters demand change after Mayor Rahm Emanuel apology #ResignRahm #RahmEmanuelOut",
    "« For the bureaucrat, the world is a mere object to be manipulated by him. » Karl Marx",
    "No matter how good or bad you have it, wake up each day thankful for your life. Someone somewhere else is desperately fighting for theirs.",
    "The past is behind, learn from it. The future is ahead, prepare for it. The present is here, live it.",
    "Megyn Kelly and Podesta... are we shocked? Not really. Disgusted-Hell Yes #TrumpForPresident",
    "Time after time, try dodging all the douche-bag guys, Try trading all the wasted times, For something real in this crazy life.",
    "A life without love is like a year without summer.",
    "If you’re angry and resentful it’s like being part of a chain reaction",
    "That dude grunting and struggling in the next stall.  #ThingsYouCantIgnore",
    "I was a victim of a series of accidents, as are we all. #Kurt_Vonnegut",
    "Watch Michelle Obama's DNC 2016 speech: What do you think?  #politics",
    "The harder I work, the luckier I get. -Samuel Goldwyn",
    "#TerrorizeMe We must do all our best to fight the terrorists",
    "#IReallyLikeYouBut you  cant admit when you wrong",
    "Only he is an emancipated thinker who is not afraid to write foolish things. -Anton Pavlovich Chekhov",
    "Trump Says Clinton Created E-Mail Server with ‘Pre-Medication’  #politics",
    "When a girl tells you about her problems, it does not mean that she's complaining, it means she trusts you. #HappyMonday",
    "when u wake up from a nap and u have no idea if it's morning or night",
    "I was at home in Mountain View, CA (Silicon Valley) tending to morning rituals when I heard about the 9/11 terrorist attack.   #My911Story",
    "For Trump's sake, it better not be a hand size comparison test. #BetterAlternativeToDebates",
    "#politics Seattle Times reporter is in Cleveland to cover the GOP convention",
    "Government MUST resolve the issue FAST!!!! Will someone do something about it?! #phosphorusdisaster",
    "There will be severe consequences for the entire Global economy. #tcot #ccot #BrusselsAttack #terrorism #IslamKills #IslamIsTheProblem",
    "#Brussels #IslamKills But but .... 0bama said. Widows and children... #BrusselsAttacks #NoRefugeesWelcome 😒",
    "#IGetDepressedWhen people don't bother to read into others' opinions conscientiously, and instead rehash some kind of war of ideologies.",
    "Attention! Don`t drink water near the Aberdeen and American Falls!!! It`s contaminated with phosphorus!!!  #phosphorusdisaster",
    "Philippine President now \"regrets\" calling Obama \"son of a whore\" caused so much controversy  ¯\\_(ツ)_/¯",
    "When shit goes down and sides are taken, you find out who was real and who was faking",
    "#TrumpBecause Get these damn mexicans out so we can have our jobs back. #Trump2016",
    "FBI May Release Clinton E-Mail Investigation Report Wednesday: CNN  #politics",
    "Well you do what you do and you pay for your sins, and there’s no such thing as what might’ve been, that’s a waste of time. #TimMcGraw",
    "Love has nothing to do with what you are expecting to get  – only with what you are expecting to give  – which is everything",
    "Anyone that sells you socialism as the \"fair\" thing to do is lying or is ignorant. Fair is keeping what you earn. #HadEnoughYet #PJNET",
    "#StopIslam #IslamKills Refugees are ISIS. Even a 5 year old could tell that's their plan",
    "Obama arrives in Asia, but his Pacific trade deal is almost dead  #politics",
    "#NoCyberCensorship Today is World Day Against #CyberCensorship! Celebrate those fighting to override it",
    "Trump calls Obama 'the founder of ISIS,' claims its militants 'honor' US president  #politics",
    "I set my clocks back on Saturday, now let's take our country back tomorrow!! #TRUMPTRAIN #HillaryForPrison2016  #MAGA #TrumpForPresident",
    "Everyone is entitled to their own opinion. It's just that yours is stupid",
    "Did you know their making a movie about the Grand Forks Flood? #EmojiAWeekend",
    "Lovers of Liberty: What will you do today in defense of life, liberty,",
    "Kindness in words creates confidence. Kindness in thinking creates profoundness. Kindness in giving creates love.",
    "#GOPDebate You know that  If anyone cares about American people - it's GOP #VegasGOPDebate",
    "Two New England DNC delegates replaced due to gender  #politics",
    "#MomIn5Words Bestfriend, confidant, miss her immensely.",
    "This is our time down here!  ~Mikey, The Goonies #OverHeardAtTheWishingWell",
    "Francis Crick figured out the double helix structure of DNA on acid. Technically, the double helix was one of the #ThingsInventedWhileHigh",
    "Most folks are about as happy as they make up their minds to be - Abraham Lincoln #quotes #IAMONFIRE",
    "#FergusonRemembers What happened to them? They now don’t even think, just kill. #MikeBrown",
    "Did u mention press giving too much coverage to any homosexual question? #PrayForGay #TolerantLeft",
    "Even a little moment of glory for Bush was stolen by Tump #2016Election",
    "Who d'you think gave you the right Hidden by the dead of night To take the world and turn it upside down When it should be round.-Uriah Heep",
    "The Latest: Clinton defends parents of fallen Muslim soldier  #politics",
    "Racism must be stopped #BlackLivesMatter #FergusonRemembers",
    "Kaine vs. Pence: The Vice Presidential Debate  #politics",
    "Trump won't like the kind of history he made after Republican convention",
    "I know vote is pvt, unless 1 chooses to reveal. I'm behind (not voting obviously) #HillaryForPrison2016 Your colours? #TrumpForPresident",
    "it is our duty no our responsibility to take action, one of the best quotes ever taken from the declaration.#rednationrising #PJNET #tcot",
    "#LastMinuteGifts2016 Some really nice wrapping paper from gifts my better friends already gave me.",
    "I feel that the Second Amendment is the right to keep and bear arms for our citizenry. #2A  #Prayers4California",
    "#TopNews Wal-Mart sued over denying health insurance to gay worker's wife",
    "I don't care what they say, I'm in love with you. They try to pull me away but they don't know the truth",
    "Friends are there to stay, even on the most gloomy of days. –Eeyore",
    "This coming out of Bernie Camp. The Clinton MSM can't stop us #TrumpForPresident",
    "Judge rules against release of Trump University videos  #politics",
    "Promise me you'll never forget me because if I thought you would, I'd never leave",
    "Is #HillaryClinton seriously acting like she understands the \"struggles\" of the average #american? #moreshit #Imnotwithher #ImLeaving",
    "Why does a woman work ten years to change a man’s habits and then complain that he’s not the man she married?",
    "#Brussels Let's close all mosques! #freespeech is overrated! #IslamKills",
    "Three agents were placed on leave after a night of drinking in Amsterdam and passing out drunk in a hallway. #ServiceOfNoSecrets",
    "#IslamKills Until ALL 96M unemployed #Americans have #work , #illegals",
    "I think men who have a pierced ear are better prepared for marriage. They've experienced pain and bought jewelry.",
    "If women ran the world we wouldn’t have wars, just intense negotiations every 28 days.",
    "Clinton introduces VP choice Kaine, who blasts Trump's record in Atlantic City",
    "#DrunkBands Panic! At the disco because I lost my car keys",
    "#OffendEveryoneIn4Words  no offence but yes (offence)",
    "#SidneySheldon: A blank piece of #paper is #God’s way... #quote #quotes #magicalquote",
    "See Eric Trump's speech at 2016 Republican National Convention (video): View video of Eric Trump's speech at the...  #Cleveland #politics",
    "#ThanksObama for approving bullying white christians and defending hateful muslim extremists",
    "#IdRunForPresidentIf \nlet's be honest. I failed being a class president, so don't expect much. Unless I have dragons, of course",
    "Don't worry bout a thing, cause every little thing gonna be all right.",
    "Im On Top Of My Game Like Im Standing On Xbox  – Jae Hood",
    "If I don’t got two balls and a middle finger to throw up, I’m takin off both shoes and stickin each middle toe up. Eminem",
    "If you're broken I will mend you and I'll keep you sheltered from the storm that's raging on.",
    "#DEMDebate And she is really running for president with no consequences #DemDebateMiami",
    "The Faded Black Keys - Gold Watch on the Ceiling  Lonely Boy Grew Up Into Socially Awkward Adult #RetireASongOrBand",
    "\"Trump may have said bad words, but Bill Clinton raped me and Hillary threatened me. I don't think theres any comparison\"~ Juanita \n\n#debate",
    "LOGIC: At #DemDebate, Bernie Sanders Says The Only Cure For Bad Gov’t Is More Big Gov’t! #DemDebateMiami",
    "#GOPDebate You know that  It's nice to see concerned people, discussing how to solve our urgent problems #VegasGOPDebate",
    "Some things can be rly offensive for religious ppl! Why should they tolerate them? #PrayForGay #GayWeddingCake",
    "Mass shooting occurs even in  #GunFreeZones  so people is the problem not guns #Prayers4California",
    "Christie blasts Clinton in fiery RNC 2016 speech: 'She lied over and over again'  #politics",
    "this theory that Obama is just another Muslim terrorist is getting real #TexasJihad",
    "Are you still want gun control?!Say it to Californian citizens #Prayers4California",
    "WikiLeaks emails show Democratic staffers suggested causing labor disturbances at RNC in Cleveland: A labor lead...  #Cleveland #politics",
    "#MakeMeHateYouInOnePhrase I'm throwing an alcohol free party. No, not a free alcohol party!",
    "What do you think about the nominee for labor secretary?",
    "Trump, Clinton: The most disliked U.S. presidential candidates ever?  #politics",
    "Ryan Says He Voted Early for Trump as Nominee Heads to His State  #politics",
    "When it is time to die, let us not discover that we never lived. – Henry David Thoreau",
    "#DEMNDEBATE We need to change our educational system so that such dumb people as Hillary would not be elected #DemDebate",
    "You know why there's a Second Amendment? In case the government fails to follow the first one #GardenCityShooting",
    "With willing hearts and skillful hands, the difficult we do at once",
    "Is the RNC convincing undecided voters to support Trump?  #politics",
    "It's beautiful when two strangers become best friends, it's terribly depressing when two best friends become strangers. #iHQ",
    "#TheTroubleWithAddiction is you're too tired to chase the addiction. #SitDownSomewhere",
    "#RuinADinnerInOnePhrase so, how do you personally feel about Hillary Clinton?",
    "#TopNews Trump says he will accept election result - if he wins",
    "Tom Petty and the Hip Breakers #RetireASongOrBand",
    "#IReallyLikeYouBut..but I hate the way you chew food making sounds..aaaarrggh!!",
    "Maybe the only thing worse than having to give gratitude constantly ... is having to accept it.",
    "1.  Get some Bailey's Irish Cream liqueur. 2.  Drink it. 3  Repeat.   #ToDoListBeforeChristmas",
    "#ThingsMoreTrustedThanHillary Jim  Carrey in \"Liar,liar\"",
    "Hillary Clinton says one thing to donors and other things to the voters.\n\nShe is so corrupt! Nasty woman!\n\n#debatenight #Debate #TrumpWon",
    "Will give u the benefit of the doubt. Do u understand WHY #oscarsoblack started? #OscarHasNoColor",
    "“To live is the rarest thing in the world. Most people exist, that is all.” \n― Oscar Wilde",
    "Live updates from the DNC: Seattle’s Kshama Sawant urges Bernie Sanders supporters to vote for Green Party  #local",
    "Forgive is not an easy task but pride is such a foolish mask.",
    "If a person has a slightest sign of mental illness he or she shouldn’t be allowed to own a gun! #GunViolenceOregon",
    "#JusticeForSandraBland this makes me terrified to get pulled over #staywoke #BlackLivesMatter #FergusonRemembers",
    "Why can't we stop terrorism? Lack of special services, police? #IslamKills #Brussels",
    "#HighSchoolTaughtMe you've to be friendly to everybody. Because you may find them outside in positions to help you.",
    "Never forget those who gave you a helping hand, and always remember those who didnt.",
    "#Iamonfire Sometimes you need those bad days, because it helps you truly appreciate the good ones.",
    "#TopNews Californians cut water use in May, ahead of mandatory reductions",
    "Because making gangster videos or being black should be enough to get you an Oscar, right?  #OscarHasNoColor",
    "#DemDebate education is too damn expensive, I want it to be free  #demndebate",
    "#IslamKills Speechless...Another Vicious, Cowardly Terror Attack on Innocents #PrayforBrussels #StopIslam",
    "A #SurvivalGuideToThanksgiving will cost $19.99 hurry place your order now for fast delivery",
    "#BetterAlternativeToDebates Binge watching The Jerry Springer Show",
    "There comes a point when you just love someone, not because they're good, bad, or anything really. You just love them the way they are..",
    "Komedy Bang Bang.  Komedy is a stripper. You can tell because she spells it with a \"K\".  #MakeTVSexy",
    "Police identify two suspects in deadly mass shooting in California #Guns4NY",
    "The past can hurt, but the way I see it, you can either run from it, or learn from it. –Rafiki (The Lion King)",
    "Donald Trump Calls Out ‘Mr. Tough Guy’ Joe Biden  #politics",
    "Luckily for Obama that he can't be elected for one more term cause even if he could no one would vote for him",
    "#ItsOK2BeGay Our country has enough problems to think of gay marriage right now",
    "Global warming problem solved? Peace all around the globe achieved? No, gay marriages are legalized! #itsok2begay",
    "Do you believe in love at first sight or should I walk by again ?",
    "Don't cry for those who never make you smile. Don't make those who always make you smile, cry for you.  – #iHQ",
    "Anti-immigrant party poised for huge win in German state election  #news",
    "#politics Former Seattle judge admits to misusing parking discount for years",
    "#BetterAlternativeToDebates America plays the dating game. We ask questions and don't get to see who answers.",
    "Comey clearly got the horse head treatment #HillaryForPrison2016 #TrumpForPresident",
    "President Obama: Nation Ringed by Walls Would Only Imprison Itself  #politics",
    "#ICelebrateTrumpWith wine. Did you think I'd miss a chance?",
    "ISIS Wins! Paris Orders Jews to Cancel Public Hanukkah Celebrations",
    "You think you want to die, but in reality, you just want to be saved. #iHQ",
    "He hadn’t a colledge degree and still did great work to our country #HappyBirthdayHarryTruman",
    "Let’s celebrate Hillary Clinton’s moment — then let her get back to work  #local",
    "#IfICouldTalkToGod I would ask him if he actually likes listening to our prayers on Sunday morning",
    "Toothpaste tube squeezing #BetterAlternativeToDebates",
    "Do something now that will make the person you'll be tomorrow proud to have been the person you are today.",
    "#IHatePokemonGoBecause my mom is more interested in playing pokemon go than to take care of me  #PokemonGo",
    "#ICelebrateTrumpWith complete detachedness from reality",
    "How Trump, Clinton would fix the 'crazy' U.S. health system  #health",
    "For myself I am an optimist  – it does not seem to be much use to be anything else.  – Winston S. Churchill",
    "Yesterday I did nothing and today I`m finishing off what I did yesterday",
    "#IslamKills #PrayForBrussels , everyone stay safe in this time of disaster #Brussels",
    "I could have made a fortune in cheeseburgers, but I finally chose politics.",
    "Wisdom is not a matter of study, but a matter of living. To be wise is to live in an inner harmony that overcomes all obstacles. -Sri Ram",
    "#AddAMovieRuinAMovie THREE MEN AND ROSEMARY'S BABY",
    "How does delegate voting work during the RNC? (video): Tom Sutton, professor of political science at Baldwin Wal...  #Cleveland #politics",
    "Remember licking doorknobs is illegal on other planets.   #RulesForEverydayLiving #spongebob #wordstoliveby",
    "#WearHoodieForTrayvon and raise your fists into the air",
    "Every great achievement is the story of a flaming heart! #HappyBirthdayHarryTruman and thanks for everything you did for America",
    "Are they going to play the race card every year? #OscarHasNoColor #Oscars",
    "He did love dogs more than politicians #HappyBirthdayHarryTruman \"You want a friend in Washington? Get a dog\"",
    "#SurvivalGuideToThanksgiving Lie. About everything. They only think that they want to know the truth.",
    "Just because her eyes don't tear, doesn't mean her heart doesn't cry. Just because she comes off strong, doesn't mean there's nothing wrong.",
    "Donald Trump is having a 'YUGE' impact on advertising  #politics",
    "#HonorForTheBrave Stop spreading hate towards cops! Better try to get your kids out of the gangs!",
    "#BlackLivesMatter Some of you are overdoing it. You didn't get extra cheese because the cook is stoned. Not everything is due to racism. :)",
    "two of the suspects killed in shootout with cops and one detained #prayforsanbernadino #myheartgoesout  #Prayers4California",
    "Debate Preview: Can Trump Stay on Offense Without Being Offensive?  #politics",
    "U.N. Syria envoy meets southern rebels for first time  #news",
    "\"What did we learn with DNC hack? We learned that Bernie Sanders was taken advantage of by your people.\" ~ Trump\n\n#debates #debatenight",
    "Cats, bacon, sex bots, political arguments, shitty half time shows, and hashtags #ThingsPeopleOnTwitterLike",
    "#Brussels No need to worry about Syrian \"refugees\". They've assilimated so well and so peacefully in Europe. Right? #IslamKills",
    "#TheTroubleWithAddiction you waste years you can NEVER get back on a dumb fixation",
    "To be strong, you have to look to God, because when you look to yourself, you know you're not strong enough. -",
    "#ThingsInventedWhileHigh most movies in the 60's and 70's.",
    "#RuinADinnerInOnePhrase are we going to have sex after we're done with the food?",
    "#IShouldGetAMedalFor managing to lose things within 1 second of getting them",
    "Cake or Pie?  #BetterAlternativeToDebates",
    "#WhatIWouldTellA15YearOldMe get plenty of sleep as much as you can. You'll regret when you don't once you're an adult with responsibilities",
    "#DemDebate is pointless cuz nobody listens what they are talking about, people are blind believers #DemDebate #DemDebateMiami",
    "#IslamKills like what if some of those refugees are ISIS and we just welcomed in our downfall?",
    "#ThanksObama we the people will work hard to undo the damage Obama has done",
    "#WhyImGangsta I cry my fucking eyes out every time I watch Toy Story 3",
    "Our life is frittered away by detail ... simplify, simplify. – Henry David Thoreau",
    "#TrueDetective #MartyHart: It’s hard to find something in... #quote #quotes #woodyharrelson",
    "Obama strategist David Axelrod expects a close race in Ohio: David Axelrod said he believes Republican nominee D...  #Cleveland #politics",
    "When a girl is silent, she’s either over-thinking, tired of waiting, falling apart, crying inside... or all of the above. #dailyteen",
    "The riot should be more organized but it definitely should be #BaltimoreVsRacism",
    "#SomedayIdLikeToSee Katherine Heigl quit making films and go become a paralegal and make her bosses miserable like her movies make the world",
    "I’ll emigrate when there’s no more freedom of speech. So, I'm leaving now! #SlaveryOfSpeech",
    "#TheTroubleWithAddiction is that we consider \"club nights\" to be the highlight of our week, knowing that our sober brains hate clubs.",
    "Laura Wilkerson son killed by illegal \"Trump's doing exactly what he said he would do &amp; I for one am fired up about it.\"\n#TrumpAZ",
    "#Brussels #IslamKills How do we know that isis and the Taliban aren't the real Islam? We don't.",
    "Cops have killed 68 people in 22 days since #Kaepernick started protesting. 68 in 22 days... have no words\n#KeithLamontScott",
    "Coffee and Cigarettes. And donuts, pizza, mcnuggets and chips #MakeAMovieFat",
    "You know that  Rubio knows we need to become a strong country with strict national security #VegasGOPDebate",
    "#IslamKills Why do they think people are going to just wait for the them to catch these terr #Brussels",
    "Challenges are what make life interesting and overcoming them is what makes life meaningful.",
    "Nude leggings on a chunky girl #ThingsMoreTrustedThanHillary",
    "Rich people believe \"I create my life.\" Poor people believe \"Life happens to me. ~ T. Harv Eker",
    "Trump VP pick Mike Pence to campaign in Phoenix, Tucson on Tuesday  #politics",
    "I've failed over and over and over again in my life and that is why I succeed. -Michael Jordan",
    "How Clinton Beat Trump in Their First Debate, By the Numbers  #politics",
    "Clinton, Trump Tied Ahead of GOP Convention: Poll  #politics",
    "#FergusonRemembers #FergusonRiots happened a year ago but cops are still racists and nobody cares",
    "It doesn't matter if you get knocked down 7 times, as long as you stand up 8 times. ♥",
    "#ICantBeUrFriendBecause you think Facebook is a high school do-over",
    "#TrumpBecause You say truth when you tryna help people. Not what they want to hear 😋",
    "If you're walking down the right path and you're willing to keep walking, eventually you'll make progress.  – Barack Obama",
    "I just want to see Leo win an Oscar! #OscarHasNoColor",
    "« They do certainly give very strange, and newfangled, names to diseases. » Plato",
    "So, are they searching for the shooter or not? #CharlestonShooting #HateCrime",
    "Most of \"Republicans” who have signed letters and statements against Trump were also advocates for the Iraq war. Neocons = Democrats.",
    "The results you achieve will be in direct proportion to the effort you apply.",
    "I just can't worry 'bout no haters, gotta stay on my grind.",
    "#MakeMusicReligious An Opus Dei in the Life",
    "Who could be on the stump for Hillary Clinton and Donald Trump in Ohio: Ohio Politics Roundup: Who's stumping fo...  #Cleveland #politics",
    "what is the audience demographics? US Europe are majority white. Hence majority white actors #OscarHasNoColor #Oscars",
    "Cleveland-area pastor Darrell Scott gives a sneak peak at his upcoming RNC speech (video): \"I'll be giving my th...  #Cleveland #politics",
    "#ImTooOldFor getting waisted just because my friend has money. (But I still do)",
    "#IslamKills Terrible news coming from Brussels #PrayForBrussels #Brussels",
    "#IAmThankfulFor the fact that my mom made us fend for ourselves in the cooking department. It gave me the skill of baking",
    "Stop asking shit won't change your disastrous life #UnlikelyMagic8BallAnswers",
    "#StopIslam I don’t want to pay taxes which would be spend on welfare for ISIS terrorists #IslamKills",
    "#TheTroubleWithAddiction there's more than one road to sobriety. I don't do meetings, I don't do religion, I went to my doctor and got help",
    "Be the last to arrive and the first to leave #SurvivalGuideToThanksgiving",
    "#StopIslam #IslamKills this is seriously getting out hand! I'm so scared for the future of my children! #PrayForBrussels",
    "The challenge today is to convince people of the value of truth, honesty, compassion and a concern for others.",
    "#OtherThingsToDoIn6Seconds  Stuff a cookie in my face.",
    "Life is a disease: sexually transmitted, and invariably fatal.  – Neil Gaiman",
    "Dems want to take our rights and give them to the refugees so that they vote for them #VegasGOPDebate",
    "Beauty is in the eye of the beholder,but the net has a very specific,detailed view of what the perfect woman is like.",
    "I can go days without talking to you, months without seeing you, but not a second goes by that I'm not thinking about you.",
    "#ThingsNotTaughtAtSchool how to check privilege",
    "It's not that she wants to be the only girl in your life, she just wants to be the only one that matters.",
    "#GOPDebate You know that  Trump is a real leader, I believe debates will help to see it. #VegasGOPDebate",
    "I wish it were winter, we could make it into ice blocks and skate on it! And then melt it in the spring time and drink it! (Beerfest)",
    "#ThanksObama One of the worst things Obama did was to give golf a bad name.  Now it's considered a haven for lazy, irresponsbile bastards",
    "78% of Latino voters find Trump not honest or trustworthy\nOpposed to Clinton, whom 51% of Latino voters believe is not honest or trustworthy",
    "Hillary Clinton, in acceptance speech, urges unity against Donald Trump: Hillary Clinton accepted the Democratic...  #Cleveland #politics",
    "Speaking the #truth is one of the healthiest things you can do in any relationship. #iamonFIRE",
    "Honestly i don't got a fear except the one above here comes a violent yea  – Lloyd Banks",
    "Pittsburgh man arrested with handgun at BWI Airport  #local",
    "#SecondhandGifts virgin's blood to make a wish\nWhy? Christmas is always about wishes!",
    "Hillary Clinton has history of paying price for ignoring her health  #politics",
    "My fellow deplorables: Whites Hispanics Blacks Gays Young Old VOTE #TrumpForPresident",
    "I love it when you just don't care, I love it when you dance like there's nobody there.",
    "#NoCyberCensorship Lefty 'rent a' mob's wreak Republican rallies, and so the media blame Trump ?",
    "#ILove__ButIHate__ I love cars but I hate being told that I can't smash them into the local comcast office",
    "Throw #HillaryRottenClinton behind bars #DrainTheSwamp #MAGA #TrumpForPresident",
    "Obama calls police killing of black men racism, but when a black man who \"wanted to kill white people\" killed cops in #Dallas he blames guns",
    "The right-wing of the Republican party isn't so much a political agenda as a plea for help #VegasGOPDebate",
    "#ReasonsIAintInARelationship why eat the same cereal when, u have a lot of variety of cereals.",
    "#IslamKills How could terrorists get into a subway with all that suicide west stuff? #Brussels",
    "#AltRightMeans knowing that too much diversity and globalization can destroy civilization",
    "Trump Says Almost Nobody Over-Regulated More Than Homebuilders  #politics",
    "A Journey of A Thousand miles Begins With A Single Step. Confucius",
    "Pretty sure that something will be done #GunViolenceOregon",
    "Donald Trump says law-abiding African-Americans are \"main victims'' of violent protests  #politics",
    "I guess, we must fight the terrorism without giving up liberty #PatriotAct",
    "Right-to-work fuels GOP state Senate primary race in St. Charles County  #StLouis",
    "You know what's really disgusting and deplorable? Allowing a terrorist in because politics. #IslamKills #Brussels",
    "We Greeks believe that a man who takes no part in public affairs is not merely lazy, but good for nothing  – Thucydides",
    "Sorry, but I cannot support Rand Paul for the Republican nominee. That apple didn't fall far enough away from that nutty tree. #PJNET",
    "Peter Thiel Said to Donate $1.25m in Support of Trump: NYT  #politics",
    "#SometimesTwitterMakesMe feel so pleased I've met you lovely lot. Thankyou. X",
    "if we don't have regular chek ups and get #vaccines-what's the point of doctors' work? #VaccinateUS",
    "I like nonsense, it wakes up the brain cells. Fantasy is a necessary ingredient in living.  – Dr. Seuss",
    "All the water near the American Falls and Aberdeen is non drinkable now!!!  #phosphorusdisaster",
    "People are surprised with how others could refuse Syrian refugees but don't look at how we treat people here #IslamKills #Brussels",
    "The \"healing\" does NOT begin until the Clintons and ALL of their goons are in prison.  #MAGA #TrumpForPresident",
    "#politics District attorney to add prosecutor's firing to Kathleen Kane probe",
    "This hashtag was started so we could see all the single people.... let the games begin  #ReasonsIAintInARelationship",
    "#ReasonsToLeaveEU When I visit Europe I wanted to die there is so annoying",
    "&amp;quot;It matters not what someone is born, but what they grow to be.&amp;quot; -Albus Dumbledore",
    "I wish there were no guns in the #black areas #NoGunsForCriminals",
    "You know that  Watching GOP debates is the thing that I rarely practise, but today they got vj #VegasGOPDebate",
    "A historic night for Hillary, an unusual speech for Bill, and a touching moment for Bernie: Tuesday's DNC takeaw...  #Cleveland #politics",
    "Philly readies for DNC after quiet Cleveland protests  #politics",
    "I'ma keep it cool and imma do me, it is what it is and this how it' gon' be  – Lupe Fiasco",
    "Never be afraid to try something new. Remember, amateurs built the ark. Professionals built the Titanic.",
    "2016 Democratic National Convention Day 2: Who's speaking, where to watch  #politics",
    "#thingspeopleontwitterlike they like likes. This is what I've learned, so far. Liking likes is pretty prevalent. Turns out, I like likes.",
    "Hillary Clinton to Attend Peres’s Funeral in Israel: Haaretz  #politics",
    "So sad this happened Yet again! 🙏🙏  #Prayers4California",
    "BREAKING: Podesta emails prove that Hillary was planning to spread the \"Trump is involved w/ Russia\" lies since April!",
    "#2ndAmendmentDay “I'm all in favor of keeping dangerous weapons out of the hands of fools. Let's start with typewriters",
    "The early bird catches the worm #MakeMeHateYouInOnePhrase",
    "If it ain't about the money don't be blowin me up, nigga I ain't gettin up if it ain't about the money",
    "#HappyBirthdayMalcolmX The future belongs to those who prepare for it today - MalcolmX",
    "Cops in states are literally nothing more than just a firing squad of an oligarchic authoritarian regime #MarioWoods #BlackLivesMatter",
    "#HonorForTheBrave I wish all the cop-haters saw the truth. If not for cops risking their lives they would become someone else's pray first",
    "The line for voting at my polling place was around the building at 5:50 am this morning #lockherup #TrumpForPresident",
    "It is painful, but don’t avoid it. If you avoid it you have avoided the greatest opportunity to grow. Go into it, suffer love...",
    "MORE: NYT Says It Has Obtained Some of Trump’s 1995 Tax Records  #politics",
    "Due to the significance of today's anniversary, no quotes until tomorrow. Hope God has been treating you well, Jason. #911 #NeverForget",
    "I don't know why they call it heartbreak. It feels like every other part of my body is broken too...",
    "White House was built by slaves - Mechelle Obama #UnknownScandalsOfHistory",
    "2016 Democratic National Convention Day 3: Who's speaking, where to watch  #politics",
    "The press exists to pursue truth, regardless of preconception or ideology. W/o an objective press, tyranny is inevitable #tcot #PJNET #tlot",
    "it's so upset! The put waste in spring water near American falls Oh my gosh!!!, I'm too sorry!!!! #phosphorusdisaster",
    "jemalhudso12111: HillaryforPA #Hillary4prison YOU BELONG IN JAIL #TrumpIsBlackLikeMe #TrumpForPresident",
    "Problems in a relationship are just a test to see if it's worth fighting for",
    "Those songs that express the feelings you can't say.",
    "Fanaticism consists of redoubling your effort when you have forgotten your aim.  – George Santayana",
    "\"I'll take a bullet before u, that's for damn sure. #prayforsanbernadino #Guns4NY",
    "For all those who blame police for one cop's mistake! Become cops and TRY to do better, OK?!",
    "The more one pleases generally, the less one pleases profoundly.  – Krister Stendahl",
    "Kindness, I've discovered, is everything in life.  – Isaac Bashevis Singer",
    "To succeed in life, you need two things: ignorance and confidence.  – Mark Twain",
    "Well tomorrow vote day and all we can do is pray for the best. #Trump2k16 #TrumpForPresident",
    "Obama cancels meeting with Philippines' Duterte after insult  #news",
    "#Guncontrol simply doesn't correlate with decreased violence. They only hamper our ability to defend our families #2A #Prayers4California",
    "Police spray man with over 140 bullets in Clinton, North Carolina",
    "I can't afford it, Moreki would brick me in a week #ReasonsIAintInARelationship",
    "If you bungle raising your children, nothing else much matters in life. – Jacqueline Kennedy Onassis",
    "BREAKING: Violence breaks out at the anti-Trump protest in NYC. America is sick of left wing chaos!",
    "To be able to say how much you love is to love but little.",
    "Generosity, freedom, and love will create the most beautiful relationship: an ongoing romance.",
    "#local #news McCain rips Trump over Khan remarks, still endorses GOP candidate",
    "Obama says North Korea sanctions must be implemented after missiles fired  #news",
    "#GOPDebate Brains, you know, are suspect in the Republican Party #VegasGOPDebate",
    "Can anybody explain why are the authorities helpless in front of a threat of terroristc acts? #IslamKills #Brussels",
    "Khans on Trump feud: 'We want to maintain our dignity'  #politics",
    "Too Many People Are Thinking of Security Instead of Opportunity. They Seem More Afraid of Life Than Death. James F Bymes",
    "It`s better to avoid policemen than to ask them for help! #PoliceColor #BlackOutDay",
    "#IStartCryingWhen Barack Obama is on the side of #BlackLivesMatter terrorists",
    "If you like quotes then you're going to LOVE my new free audio program Inspower Happiness Gym:",
    "We have no right to express an opinion until we know all of the answers.",
    "Life is short, time is fast, no replay, no rewind so enjoy every moment you can.",
    "#TrumpBecause he is what We the people want... the political fakers we have in office do not, can not relate to us. #Trump2016 😀😀",
    "The Illuminati gon make sure Peyton win...Beyonce' tried to trick y'all by saying that shit corny #staywoke",
    "Louisiana congressional clout will take another hit this election  #news",
    "Why are women... so much more interesting to men than men are to women?  – Virginia Woolf",
    "I'm not afraid to cry every once in a while even though going on with you gone still upsets me.",
    "#politics RNC Fact Check: Misleading Claims on Guns, Benghazi, More",
    "Michelle Obama: Protest Vote Is a Vote for Trump  #politics",
    "There is never going to ever be a better show than Lost.. #TweetsFrom10YearsAgo",
    "Ask not what your country can do for you. But ask what you can do for your country #HappyIndependenceDay",
    "Great relationships aren't built in a day  – great relationships are built daily.",
    "Do not let the shadows of your past darken the doorstep of your future. Forgive and forget.",
    "#ReasonsToGetDivorced too much dirty dishes",
    "Big hands and a wife that wants to live in the same house.  #OverHeardAtTheWishingWell",
    "Criminals doesn’t care about legal guns, and the #RooseveltFieldMall robber is a criminal #GardenCityShooting",
    "Try to be a rainbow in someone's cloud.  – Maya Angelou",
    "2016 Republican National Convention delegate seating chart released: Ohio's delegates and alternates will be sit...  #Cleveland #politics",
    "#IslamKills Each of the 1993 World Trade Center bombing Terrorists was an Asylum seeker👉How'd that work out",
    "People are just as happy as they make up their minds to be.  – Abraham Lincoln",
    "It is impossible to live without failing at something, unless you live so cautiously that you might as well not have lived at all",
    "Go to pet store, pickup dozen mice. When Political war starts secretively release the mice. #GameChanger #SurvivalGuideToThanksgiving",
    "Nothing that was said actually was wrong, these gentlemen want aa better future for America #GOPDebateSC",
    "Why have you not broken from the pack? You’re playing it safe. Safe aint gonna get you **** in this world. – Stone Cold Steve Austin",
    "Happiness is not so much in having as sharing. We make a living by what we get, but we make a life by what we give.  – Norman MacEwan",
    "#OtherThingsToDoIn6Seconds clean the lint out of my navel",
    "If you support Hillary Clinton I support you gettin kicked in the face #HillaryForPrison2016 #trumptrain #BuildTheWall #TrumpForPresident",
    "#Cybercensorship has nothing to do with #Cybersecurity #NoCyberCensorship",
    "Who's the better bomb sniffing dog. My money's on Trump #BetterAlternativeToDebates",
    "You always have a choice. It's just that some people make the wrong one",
    "The, why do we still have to do this? Its 2017 and everyone should be treated equally...march  #RenameMillionWomenMarch",
    "Be decisive. A wrong decision is generally less disastrous than indecision.  – Bernhard Langer",
    "Benghazi victim's mother to Trump: Stop the mentions  #politics",
    "You don't have to have it all figured out to move forward.",
    "Clinton, Kaine stump together after conventions  #politics",
    "#GOPDebate You know that  My vote for #Carson #GOPDebate #VegasGOPDebate",
    "Ordinary Americans mustn’t be influenced by spying #PatriotAct",
    "#RealLifeMagicSpells \"YOLO\" provokes certain people to do dumb stuff they later regret",
    "Even if you're on the right track, you'll get run over if you just sit there. -Will Rogers",
    "Don't believe the people who say love isn't real. They just want to bring you down because they don't have what we have",
    "Do you know what is common between ISIS and Hillary Clinton? \n\nBoth funded by Saudi Arabia.\n\n#Debate #debatenight",
    "It's hard to make conversation when he's taking my breathe away",
    "#BetterAlternativeToDebates If Trump and Hillary were stranded on island. What would you have? A better America. Wilderness survival game.",
    "#RejectedDebateTopics Is Goldman Sachs subject to term limits?",
    "#thetroublewithaddiction is that you depend on it and use it all the time you forget what sober feels like",
    "All I know is when I was a kid, I had had dog named Oscar, and he was white #OscarHasNoColor",
    "Life's like sailing. You're better to enjoy your journey on the ship instead of waiting to reach the destination.",
    "We will always remember the sacrifices of all the brave soldiers #InHonorOf",
    "I haven't talked to you in so long. I wonder where you are and how you're doing",
    "Obama administration announces single largest transfer of Guantanamo inmates  #world #news",
    "Report: Man Sought After Exposing Himself To 3 Juveniles At McDonald’s  #news",
    "sadness in #AmericanFalls, how silly it was to build a plant there American Falls has a disaster with phosphorus leak #phosphorusdisaster",
    "Companies with few employees are likely to follow the #IndianaLaw. Other - improbably #PrayForGay #TolerantLeft",
    "#2ndAmendmentDay A militia, when properly formed, are in fact the people themselves",
    "#My2017BiggestHope to stop wasting hours searching for an absolutely perfect emoji",
    "Clinton’s Attacking Strategy to Blunt Comey Damage Carries Risks  #politics"
]