[
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Heather Anderson",
        "title": "Welcome to IOTBW!",
        "text": "Join our free speech chat on Telegram:\n\nWhite Positivity, anti-racism\nSee pinned message T.me/alwayswhite\nhttps://t.me/alwayswhite\n\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n\n-Check out the Facebook group. Don’t post anything against Facebook terms there, and be smart. Don’t link your quora profile there. Its function is to find like-minded people. You can never have too many friends.\n\nNationalism is Beautiful | Facebook\nhttps://www.facebook.com/groups/634915425000653\nIf you are anti-White (such as being triggered by White people expressing positive emotions about their heritage (pride)), do yourself a favor and unfollow this Space. This is not a safe space, and people who get triggered apparently suffer actual harm equivalent to getting stabbed from seeing things they happen to disagree with.\nYou can unfollow this Space by clicking the elipsis at the top and then clicking “Mute It’s OK to be White”.\n\nRemember that anti-Whites have and will continue to come on here with troll accounts to write racist things and report themselves with their other accounts. They do this to get us censored.\n\nWe will not hesitate to remove anyone who violates Quora’s ToS. This means no harassing any individuals, no calling people names or slurs, and no saying some race is superior or inferior to another. This group is about White positivity and exposing the anti-White narrative that is being pushed by those in power.\n\nFor information about this group see our FAQ:\n\nFor rules:\n\nRules\n\nStay White <3",
        "code": 3,
        "wordCount": 215
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Tracy Miller",
        "title": "Do you Think Reparations are the only way to fix racial tension between Whites and Blacks?",
        "text": "Yes, I think White people should be paid back ALL the money, jobs and free education we've given to blacks, and have only gotten an increase of rape, robbery and murder to show for it.",
        "code": 3,
        "wordCount": 35
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Tony Merendino",
        "title": "Why do some white Americans think that America is a \"white\" country?",
        "text": "Not so much a White Country , as a White Culture. Remember when it was important to speak proper english? Not be aggressive? Not play your music so loud that shook other cars? Not to dance on a football field like you were having sex? If that’s what it means to be a White Country, I’m all for it.",
        "code": 3,
        "wordCount": 59
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Gregory Perkins",
        "title": "Do you believe Michelle Obama? Do white policemen shoot African-Americans every day?",
        "text": "This line of nonsense is comical. In the year before george floyd died of an overdose 13 blackmen died of gunshot wounds administered by cops. 2 were deem unjustified. In the same period of time 430 cops were killed by blackmen with guns. All were unjustified. So 430–2. So at a rate of 215–1 cops are killed by black men.",
        "code": 3,
        "wordCount": 60
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Jim Howard",
        "title": "What have white people learned from all their Black Lives Matter reading?",
        "text": "I have learned from observation, that Black Lives Matter co-founders Patrisse Cullors and Alicia Garza describe themselves and their fellow organizers as “trained Marxists”.\n\nThat Ms. Cullors is a protege of Eric Mann. A key member of the Weather Underground domestic terrorist organization which was active in the late 1960’s and 1970’s.\n\nAs a Marxist organization, by definition, its goals would include: -the breakdown of nuclear family units in the United States; -the infiltration, degradation and destruction of public education; -the infiltration and destruction of democratic government in the United States; -the destruction of the capitalist economy of the United States; - the disruption of the United States’ ability to defend itself.\n\nI have also observed that, though the organization raises millions of dollars under the auspices of providing help to the families and communities of persons who have: experienced police, brutality, wrongful persecution or have died in encounters with Law Enforcement, the organization hasn’t disbursed any of the money raised for the alleged beneficiaries. Rather, the Co-founders appear to use these funds for their own personal enrichment, buying multiple, extravagantly expensive, bourgeoise homes, other real estate and luxuries. The only instances of the organization parting with any money in support of anyone that I am aware of, is providing bail for people of color who have been arrested for the commission of crimes of violence.\n\nI have also observed that this organization has been tacitly involved in the destruction of Black-owned businesses and properties, during the riots of the summer of 2020. And the deaths of at least two Black peace officers and one Black private security officer. The organization hasn’t acknowledged these facts, nor have they offered any form of restitution, compensation, apology, or condolence.\n\nSo in summary, what I have learned about the organization so far, is that it is in the best possible evaluation, hypocritical and inefficient and in the least favorable evaluation, a scam, a fraud and a domestic terror organization.",
        "code": 3,
        "wordCount": 321
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Rebecca Hurst",
        "title": "Do people really think white privilege doesn't exist when black US families have 10% of the wealth of what white families do? Or do they think that black people are just 9 times as lazy or something, with no proof?",
        "text": "Maybe white people are privileged. If that’s what you want to believe, go ahead. Privilege is earned, however. A recent Japanese study has revealed that British people (and by this we mean the indigenous white people), have invented 55 percent of fucking everything. That’s not from hard graft, of course. We’re just privileged. One of my ancestors caught her hair in a cotton loom in Lancashire in the 19th century, and was decapitated. She was thrown in a pauper’s grave. She was seven years old. You want privilege? Then fucking work for it.",
        "code": 3,
        "wordCount": 93
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Jon Leszczynski",
        "title": "What are your thoughts on having black-only safe spaces with snacks and beverages provided on college campuses?",
        "text": "As long as they provide such spaces and amenities for each race, then I have no issue with it. I suspect, however, that like we see in other situations, they want this benefit only for them and would employ their reverse racism to demand there not be any equality.",
        "code": 3,
        "wordCount": 49
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Jeffry Brooks",
        "title": "Do people really think white privilege doesn't exist when black US families have 10% of the wealth of what white families do? Or do they think that black people are just 9 times as lazy or something, with no proof?",
        "text": "The poor black people I know in California do it to themselves. I watched them move here, where they could live anywhere they chose. They took over a nice pleasant middle class area, pushing out over time every other race. There they huddled with racist anger at all else. They refused to work and failed in school, when taking a job again refused to work hard, That was being white, working hard, and they refused to “act white”.\n\nI tutored black guys from South Central who wanted to get ahead, The ones I talked into moving away from their “Hood”, and mix in with everyone else, did well. The one’s who stayed, under the influence of the loser friends, did not.",
        "code": 3,
        "wordCount": 120
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Kody Von Destinon",
        "title": "If white people had been slaves, would WLM be a thing right now?",
        "text": "Whites were slaves. We, as a people, just don't have our heads so far up our asses they're back on our shoulders so we don't go around with a chip so large on our shoulders we can't walk a straight line, demanding reparations, affirmative action, and such. We said: 'Well that fucking sucked. Guess I'll get on with it and not let that happen again. Time to build a better life for me and mine.’\n\nOf course, even if we did do anything that blm has we'd be lined up and shot. We're the wrong color to pull that off.",
        "code": 3,
        "wordCount": 99
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Keith Berjeron",
        "title": "Do people really think white privilege doesn't exist when black US families have 10% of the wealth of what white families do? Or do they think that black people are just 9 times as lazy or something, with no proof?",
        "text": "That depends on what you call “privilege.”\n\nI know one person who spent his teen years busting his hump, learning constantly, and saving every dime he had. He's not even thirty years old yet. However, he owns a house, he's doing option trading and he's got his real estate license.\n\nSomeone else I know is an engineer for the railroad, in a union, and takes multiple vacations a year out of the country.\n\nI know someone else on social security, addicted to drugs and alcohol, and gets fired soon after getting a job because he can't show up on time or keep working in less-than-ideal conditions.\n\nThe first and last one are White.\n\nThe second one is black.\n\nIt seems privilege is something one works to achieve. Sometimes, one gets born into a wealthy family and they get spoiled. Other times, people work their rear off for what they have.",
        "code": 3,
        "wordCount": 144
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Christian Marshal",
        "title": "Is featuring a non-white actress as Snow White (a German fairytale) in the movie a \"good\" example of inclusivity you support?",
        "text": "The name wouldn’t really make sense if the actress was black. The entire reason she was named Snowhite is because she had skin as white as snow. Skin as white as snow, cheeks as red as blood and hair as black as ebony according to some of the oldest tellings.",
        "code": 3,
        "wordCount": 50
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Friday White",
        "title": "Do you think any black person in this century has any justifiable anger towards white people to lay blame on what some people did to their ancestors two centuries ago?",
        "text": "No I don’t!\n\nAnd this kind of ongoing talk actually makes me angry!\n\nFar too many people these days are simply “entitled”…\n\nMy ancestors were English Cheesemakers and Scottish Farmers. They never had slaves. They never treated anyone badly - they just worked and survived. And I am sure that they had numerous setbacks too! They migrated to New Zealand in the 1890s - arriving with little more than the clothes that they were wearing. They started a cheese business in New Zealand and they farmed - providing goods and services AND paying all their workers a fair wage.\n\nSo how does that make me - an apparently priviledged white person - responsible for anything?\n\nNow let me tell you about me - I migrated to Australia (from New Zealand) 42 years ago. I arrived in Australia with $700 in my pocket - about a good two weeks wage back then - and no tertiary education.\n\nI now have a mid 7 figure net worth - through hard work, clever investing and relatively frugal (but comfortable) living.\n\nANYONE - Black, White, Yellow or fucking Brindle - could have achieved the same thing that I have done! They ALL had exactly the same opportunities that I had and - in some cases - not even as many setbacks!\n\nAnd lastly, I don’t judge people by their ancestry or the colour of their skin - but I judge them by the way that they treat me and the people that I care about and love.\n\nI will always try and give a break to those that need a “leg up” and want to work for it.",
        "code": 3,
        "wordCount": 265
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Jordan R",
        "title": "Do you think racism and inequality will disappear if whites pay reparations to blacks?",
        "text": "No. The only thing that will end racism is to stop talking about it. If the Media, and black and white parents stop talking about it, the new generation of kids grows up knowing it’s no longer a thing but only something they read about in history books.\n\nInequality will always exist in a free and fair society. Some people will innovate and get paid, some will overcome the poor circumstances of their childhood and succeed, others will not. The greatness of the USA comes from equality. Equality of OPPORTUNITY. Equality of OUTCOME or “equity” is only achieved through tyranny. And that’s what we are inching closer to in this country.",
        "code": 3,
        "wordCount": 110
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Mary Kliewer",
        "title": "As a white person has your life become better or worse because of diversity and multiculturalism?",
        "text": "Not me, but my son. He was in the gifted and AP classes at school, had a 1480 SAT score, was 21 in a class of over 700, and got weight listed at five universities he should have easily been accepted into. He went to his “safe” school for one year. He applies as transferred into even better schools than the first year. He was accepted into all of them. Affirmative Action kept him out as so many students came in that way. After the first year many students didn’t pass, or dropped out. He graduated from Duke.",
        "code": 3,
        "wordCount": 98
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Dave Sullivan",
        "title": "How do white people feel about being white?",
        "text": "Oh I feel just fine about it\n\nI don’t have any particular “Privilege”. When I was a child I went to the same school as many black and Asian kids from my town. Some were my friends. If I recall correctly their exam results were broadly similar to their white peers. Those kids who got great results, white and other races went off to further education, those that wanted to truant, hang in the park asking people for cigarettes, of all races, didn’t\n\nMe, I joined the Army, because my Father had been a soldier. I joined an elite regiment where you had to work really hard just to pass the selection course. There were three black recruits on our course. Nobody treated them differently or called them racial slurs. You see, no matter what your skin colour , if you passed the course, you were considered a lion amongst house cats, the very best\n\nPeople’s origins were brought up in the barracks, nicknames were given. As in, I was Scouse, Paul, you come from Newcastle, you’re getting called Geordie. Turned out the black guy who made it into our platoon, his folks had originally come from Barbados, he got called Sandy, on account of there reputedly being lots of golden beaches on Barbados. He was happy with his nickname and nobody ever thought there was anything sinister or unpleasantly racist about it\n\nNobody in the platoon ever considered him anything other than a mate first and a soldier second. We were all F@cking Lions. And you don’t look down on a squaddie from another ethnic background anyway, one day your life could depend on him and his yours\n\nAfter my service I lived in an area with a mixed ethnic background. Were there some fools around who thought themselves a smart guy to direct racial taunts? Sure there were, same as in any racial mix. Same as Pakistanis taunted Indians, same as Middle Easterners taunted the Jews. Truth be told, I never had patience with such nonsense, I would have been just as happy to give the offender a fat lip as the guy they were abusing\n\nI worked damned hard for everything I got in my life and, yes, I saw those from different ethnic backgrounds who had done way better than me, had a bigger house, better salary, flashier car. I never thought I had some privilege or they had some privilege. Good luck to them in their life\n\nSo I don’t consider myself “Racist” or “Skin Privileged” or a Supremacist of anything. We’re all just folks around here\n\nSo you can understand my absolute annoyance when some University Rat, who isn’t even studying a real course with an actual career at the end of it, but some F@cking Social Twaddle tells me that “I” am oppressing black folks and that I carry some “Skin Guilt” because of something some wealthy D@ckheads did hundreds of years ago, to get even wealthier. I never ended up with any of that wealth or benefitted in the slightest. Supposedly some rich C@nts in London centuries ago hit on some scheme to buy black folks off of other black folks whose tribe they had been fighting, stick them on a ship, take them to America and make a profit selling them to other folks to work in cotton fields\n\nAnd I’m to be blamed for it? Just F@ck off and also F@ck the horse you rode in on. I am guilty of nothing, and none of my black mates think I am busy “Oppressing” them or keeping them down. We’ve all got enough problems trying to earn enough to meet the cost of living to bother with batshit crazy nonsense coming from students who need a flashlight to find their own A@se\n\nSo, yeah, I am happy being white. My mate Trell, who I’m going the pub with tonight to watch the football is happy being black. So just quit trying to stir up some racial arguments over something that happened when ships still worked with sails",
        "code": 3,
        "wordCount": 666
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Cat Phuckers",
        "title": "Why do some white Americans think that America is a \"white\" country?",
        "text": "I see you think they are mistaken, but it is you who does not understand. The small number of White Americans left who have our heads screwed on properly know this country to be a White country because America was built singlehandedly by White people who intended on it being inherited by their White descendants, but something appears to have gone terribly wrong as we are now being dispossessed by vile antiwhites and the beneficiaries of our dispossessors (ie all nonwhites living in America) ask stupid questions such as these. There was no America before us, what little left of it still eminates from us, and if we disappear entirely, America will be no more.\n\nP.S. Get into the habit of capitalizing the W in White. We are a noble people and we deserve a great amount of respect.",
        "code": 3,
        "wordCount": 138
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Jeff",
        "title": "Has a black person bullied you for being white?",
        "text": "I worked with a black guy I thought was my friend, I don’t know if this is considered bullying but it really hit me the wrong way. I ask him one day if he would come over for a cook out at my house, he said hell no, I ain’t eating with no white people. And he was as serious as a heart attack. I would have to reconsider risking my neck to save his if he’s too good to eat with me.",
        "code": 3,
        "wordCount": 83
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Alice Getz",
        "title": "Do you think there will ever be white lives matter rioting?",
        "text": "We have better things to do, like obeying the law, going to work, paying bills, raising families, and taking out the trash once a week.\n\nBLM was nothing more than a scam that tricked a lot of stupid, lazy, spoiled, easily manipulated people (both black and white) into getting angry towards the wrong people, and tricking stupid white Liberals into giving money so the 3 founding women of the movement could live in luxury far away from the people they claimed to care about.",
        "code": 3,
        "wordCount": 83
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "David Dana",
        "title": "Is featuring a non-white actress as Snow White (a German fairytale) in the movie a \"good\" example of inclusivity you support?",
        "text": "How ’bout we use a white actor to play Mohammed Ali in a movie to ‘prove’ our inclusivity.",
        "code": 3,
        "wordCount": 18
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Kevin Dunphy",
        "title": "Why do black people believe that white people enslaved their ancestors?",
        "text": "Because white people did enslave black people. It was morally wrong and should not have happened. This does not mean that ALL white people enslaved black people. It also does not mean that white people of today owe any sort of reparations to black people of today even if those black people are descendants of slaves. People are responsible for their own actions, not the actions of others and certainly not the actions of people who have been dead for over 100 years.",
        "code": 3,
        "wordCount": 83
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Jeremiah Hess",
        "title": "Does anti-white racism exist?",
        "text": "Of course it does .. mostly from people of color claiming to be oppressed.. pass some of that oppression this way..",
        "code": 3,
        "wordCount": 21
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Stew88",
        "title": "Why do black people don't blame Arabs or other black people for slavery? Do they have an issue with white people instead?",
        "text": "This is an informative chart on the slave trade of America.",
        "code": 3,
        "wordCount": 11
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Oscar Fausto Pelosi",
        "title": "Why do black people believe that white people enslaved their ancestors?",
        "text": "Because they're ignorant, they don't know History, they don't know that slaves were sold by BLACK AFRICANS that enslaved defeated enemies…\n\nDemocrats thrive wherever there's ignorance and among blacks ignorance is widely spread and not because they're stupid bit because Democrats need slaves so they did anything possible to keep blacks in a manipulable state.",
        "code": 3,
        "wordCount": 54
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Lewis Cassandra",
        "title": "Do you Think South Africa has improved since apartheid was abolished?",
        "text": "The removal of apartheid is not the reason for the disastrous decline of South Africa. It was an inhuman, predatory system and nothing justified its existence..\n\nThe decline is partly because Blacks cannot forgive the evils done to them and have become like their previous oppressors. Revenge. Unfortunately, two wrongs don’t make a right.\n\nHowever, people refuse to face the primary reason because it embarrasses their woke agenda. Africans and blacks generally cannot run a government. Every country or city in America where whites have gone away or left office is a basket case. Drugs, violence and public services in ruins. Previously peaceful towns and suburbs with lovely houses and well-mown lawns become dilapidated, overgrown hell-holes, strewn with rubbish and blighted by violence. Whole families degenerate into work-shy drug-dependence, alcoholism and nihilism. I don’t like what this this says about black people either. It offends my egalitarian feelings. But to deny it is deliberate blindness to the facts.",
        "code": 3,
        "wordCount": 156
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Tony Williams",
        "title": "Has race relationships improved since the woke culture and BLM started gaining more traction around the world?",
        "text": "The blm/antifa/media news services, most, not all, have made race a bigger problem.\n\nNow we need to worry if our color is the wrong type for the restaurant, mall, city or town.\n\nWhat a waste. But it provided the needed hate for a team to get elected, regardless of their known history.\n\nHow long, years, decades, centuries, till we can regain what was thrown away in a flash of time?",
        "code": 3,
        "wordCount": 67
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Dick Orange",
        "title": "Will the world be easier if everyone was Black or White? If we all had one colour?",
        "text": "No, because racism has little to do with race. Period. Without race, tribalism will just find another channel to express itself through.\n\nNot to mention modern “racism” barely even exists in real life. It’s mostly a propaganda slur to emasculate Westerners trough guilt and self-hate. The television really is a weapon of mass distraction.",
        "code": 3,
        "wordCount": 53
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "B W",
        "title": "Who was more responsible for ending slavery, blacks or whites?",
        "text": "Whites. Blacks might want slavery to end, but white people made it happen. And plenty of white people died in the ‘Civil War’.",
        "code": 3,
        "wordCount": 23
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Don Engelmeyer",
        "title": "In what ways do the minorities in the nation feel that being white is a privilege?",
        "text": "The answer should be given by a minority, but anyone that has a TV or car,or goes to the movies or has Internet can easily see all the wealth,fancy cars and homes that the upper class has. The minorities do not look at all the whites in poverty,they just see the wealth. The wealth that others have has been passed down from generations and decades of hard work and living a clean life. Whites bought Life Insurance policies that paid death benefits. Now some minorities that care about their families are doing the things that whites have done for ovebyears. People who are jealous of others blame the others for their failures,",
        "code": 3,
        "wordCount": 112
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Gerald Keehn",
        "title": "People like Erika Denise, who wrote a column in Washington post, about how Argentina doesn't have a black player. Why cannot she ask the same to China, India etc.? Why does she not question when France, UK is overrepresented by black people? How is this hypocrisy going to end?",
        "text": "Why can she not ask why the NFL is overrepresented by Blacks?",
        "code": 3,
        "wordCount": 12
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Dollie Oop",
        "title": "As a white person has your life become better or worse because of diversity and multiculturalism?",
        "text": "Worse",
        "code": 3,
        "wordCount": 1
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Mike Puorro",
        "title": "Is it racist to avoid purposely black people when walking alone at night?",
        "text": "Allow the pictures below to shake up your world view:\n\nWhich young man would you avoid? Perhaps skin color isn’t the issue.",
        "code": 3,
        "wordCount": 21
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "David Randall",
        "title": "Is the Darrell Brooks verdict compared to the Kyle Rittenhouse verdict proof of our two-tiered justice system heavily in favor of white people?",
        "text": "It’s proof the system works. Rittenhouse was a case of self defense and he was found not guilty. Truth is he never should have been charged. Brooks was pure murder and he was found guilty. The only bad part is the state doesn’t have the death penalty.",
        "code": 3,
        "wordCount": 47
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Sean Meaney",
        "title": "What have white people learned from all their Black Lives Matter reading?",
        "text": "I have learnt that the minimal effect they have had in the UK is more than enough, and America is welcome to them. We have enough would-be extremists of our own. I wish them the same success here as Hershey bars, lunatic religious cults and universal private medicine.",
        "code": 3,
        "wordCount": 48
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Joe Aral",
        "title": "Why are there black main characters in the show Vikings?",
        "text": "Because liberals are terrified of being called a racist by other idiots who are afraid to be called a racist! Pathetic for sure",
        "code": 3,
        "wordCount": 23
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Dennis Brown",
        "title": "Do people really think white privilege doesn't exist when black US families have 10% of the wealth of what white families do? Or do they think that black people are just 9 times as lazy or something, with no proof?",
        "text": "I'm 64 years old and I just recently got my first ever white privilege card but what came with it?? Not a damn thing I didn't already have or that the black man next door doesn't already have as well…So there is no official thing called white privilege, or black privilege although there is black privilege because a lot of universities and jobs to fulfill racial numbers for jobs and education bypassed highly qualified whites just to fulfill the numbers and back in the '70s they called that reverse discrimination…",
        "code": 3,
        "wordCount": 90
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Andy Myers",
        "title": "Do people really think white privilege doesn't exist when black US families have 10% of the wealth of what white families do? Or do they think that black people are just 9 times as lazy or something, with no proof?",
        "text": "Even if white privilege does exist in some cases, then what more do the complainers want from the rest of us?\n\nYou already have Leftist soft-on-crime leaders all over the place.\n\nYou get to loot, riot, steal, and face little or no time in jail.\n\nYou have “affirmative action” laws that oppress whites and asians.\n\nYou have radical D.A.s like George Gascon that can't stand giving jail sentences to violent people, because he says “ too many people of color are in prison “.\n\nYou have pro-abortion leaders like pres Joe Biden and Governor Newsom giving you all the free abortions you want.\n\nYou have changed voting laws making them less secure.\n\nWHAT MORE DO YOU WANT?",
        "code": 3,
        "wordCount": 110
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Alan Davis",
        "title": "Do you think illegal immigrants respect Americans once they come to the U.S.? Why or why not?",
        "text": "You answered your own question. Let me put it to you in simple terms. They are ILLEGAL ALIENS. The term ILLEGAL is what you must focus on. Therefore, if an “ILLEGAL” alien didn't have enough respect for our laws which they broke to get here, what makes you think they would have any respect for and obey any of our other laws once they are here. 🤔",
        "code": 3,
        "wordCount": 67
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Andris Lielmanis",
        "title": "What can be done to halt the decline of UK White population, recently announced as falling to 81%?",
        "text": "The native British should copulate more, not use contraception, not abort, raise and socialise their children …if not the foreign breeders will inherit the British isles.",
        "code": 3,
        "wordCount": 26
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Jon Leszczynski",
        "title": "Do you Think Reparations are the only way to fix racial tension between Whites and Blacks?",
        "text": "Possibly, but I doubt that the blacks will be willing to make good on what they would owe the Whites to pay back for all the opportunities the USA provides and to compensate for all the crime they have caused and all the welfare they have consumed.\n\nI’m not even sure they could afford to pay an appropriate amount of reparations, let alone be willing to do so.",
        "code": 3,
        "wordCount": 67
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Ramon Grech",
        "title": "Why does it feel increasingly wrong to be a white person?",
        "text": "Because other ethnicities are telling you that being white wrong and evil.\n\nDo you think you that need to be an Einstein to figure out what will happen next?\n\nGo and ask the Jews",
        "code": 3,
        "wordCount": 32
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Phil B",
        "title": "Do you believe Michelle Obama? Do white policemen shoot African-Americans every day?",
        "text": "The undeniable fact is both USA & UK Prisons are brimming with Black murderers. This type of question hints at a disguised attempt towards earning sympathy . Blacks choose & rigidly adhere to a ghetto lifestyle in every unwise nation whom allows it to manifest.",
        "code": 3,
        "wordCount": 45
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Flamingo Queen",
        "title": "Why does it feel increasingly wrong to be a white person?",
        "text": "It’s not wrong, who ever says it is , is a horrible racist bigoted ass",
        "code": 3,
        "wordCount": 15
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Germen Roding",
        "title": "Why do \"do-gooders\" in the UK think that the rights of illegal migrants should be equal or even superior to ordinary British people?",
        "text": "It has to do with the Leftist mindset. They are, as to speak, morally handicapped. Only two moral principles prevail in their mind: Fairness and Care. According to them, all people should be treated equally. So the suffering from a homeless illegal migrant is worse than the suffering from a homeless British person. And so it is fair, to give this homeless illegal migrant preferential treatment. They cannot understand three additional principles that Conservative people cherish: Authority, In-Group and Purity.\n\nMoral foundations theory - Wikipedia\nTheory in social psychology Moral foundations theory is a social psychological theory intended to explain the origins of and variation in human moral reasoning on the basis of innate, modular foundations. [1] [2] [3] It was first proposed by the psychologists Jonathan Haidt , Craig Joseph, and Jesse Graham, building on the work of cultural anthropologist Richard Shweder . [4] It has been subsequently developed by a diverse group of collaborators and popularized in Haidt's book The Righteous Mind . [5] The theory proposes six foundations: Care/Harm, Fairness/Cheating, Loyalty/Betrayal, Authority/Subversion, Sanctity/Degradation, and Liberty/Oppression. [6] [5] Its authors remain open to the addition, subtraction, or modification of the set of foundations. [2] Although the initial development of moral foundations theory focused on cultural differences, subsequent work with the theory has largely focused on political ideology. Various scholars have offered moral foundations theory as an explanation of differences among political progressives ( liberals in the American sense), conservatives , and right-libertarians ( libertarians in the American sense), [7] and have suggested that it can explain variation in opinion on politically charged issues such as same sex marriage and abortion. [8] The two main sources are The Pragmatic Validity of Moral Pluralism [2] and Mapping the Moral Domain . [9] In the first Haidt and Graham describe their work as looking, as anthropologists, at the evolution of morality and finding the common ground between each variation. In the second they describe and defend their method, known as the Moral Foundations Questionnaire. Through studies that jointly consisted of over 11,000 people, from a variety of ages and political beliefs, they found results that supported their prediction. Origins [ edit ] Moral foundations theory was first proposed in 2004 by Haidt and Joseph. [1] The theory emerged as a reaction against the developmental rationalist theory of morality associated with Lawrence Kohlberg and Jean Piaget . [10] Building on Piaget's work, Kohlberg argued that children's moral reasoning changed over time, and proposed an explanation through his six stages of moral development . Kohlberg's work emphasized justice as the key concept in moral reasoning, seen as a primarily cognitive activity, and became the dominant approach to moral psychology, heavily influencing subsequent work. [11] [5] Haidt writes that he found Kohlberg's theories unsatisfying from the time he first encountered them in graduate school because they \"seemed too cerebral\" and lacked a focus on issues of emotion . In contrast to the dominant theories of morality in psychology, the anthropologist Richard Shweder developed a set of theories emphasizing the cultural variability of moral judgments, but argued that different cultural forms of morality drew on \"three distinct but coherent clusters of moral concerns\", which he labeled as the ethics of autonomy\nhttps://en.wikipedia.org/wiki/Moral_foundations_theory#/media/File:Haidt-political_morality.png\n\nFrom a Conservative point of view, illegal migrants violate the law (so, violate Authority), and do not belong to the British people (so, not In-Group). Those considerations are invisible for “do-gooders”.",
        "code": 3,
        "wordCount": 564
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Craig Hudson",
        "title": "Do people really think white privilege doesn't exist when black US families have 10% of the wealth of what white families do? Or do they think that black people are just 9 times as lazy or something, with no proof?",
        "text": "Black population is 13% of this country. They have a 42% post primary education rate compared to white Americans at around 37%. Every single corporation as well as the US government gives bonus points for checking boxes that don’t say white as well as the ones that don’t say male. Black Americans have a 75% single mother rate. The black Americans that do well move out of those communities to predominantly white neighborhoods or affluent black neighborhoods. The exact same issues that the poor black neighborhoods have, so does the poor mixed and poor white and poor Hispanic neighborhoods.\n\nBlack American youth and young adults get fueled by this rhetoric through the media, the government, and idiots like you making excuses for bad decisions all under the umbrella of wokism. Do you know who suffers for that? All minorities and as well as whites in poorly led communities. The curriculum in these schools are woke driven. Many of the students skip school or stay and make the environment difficult for the other students who have a chance to excel. The parents do not engage in their education. There are very few good role models in the neighborhood. Entitlement is suffocating these communities. The behavior is being encouraged by the same groups mentioned above. The exact same thing I’ve mentioned about black communities can roll over into poor communities of every group. These aren’t racist issues. These are community behavioral issues and they span across every single race. And amazingly they almost all vote Democrat and have democrat policies in place. How well has that decision been working for them? That’s so called safety net is actually a fishing net. And you are helping with the construction.\n\nLow information and disinformation is a conspiracy. But it’s not a theory. It is planned and being blatantly pushed. And it isn’t just a plague on the conservatives. It’s hitting everyone. Five of the six media outlets are Democrats and the leaders of the 6th outlet isn’t a real conservative. So by my math, the plague lays heavier on the left.\n\nBut by all means, keep voting for your big government daddy. They’ll continue to treat you like a child and you will continue to behave as one. I do feel bad for the children that will continue to suffer do to people who think respect and character comes from legislation instead of hard work. Or that doesn’t understand that equity of outcome is an entitlement and equality is a right. And that participation trophies aren’t equal to winners trophies. You know, the trophies kids get for working hard and going the distance instead of just doing minimal or realizing they suck at that and find something they can excel at and find true success.\n\nSo take your participation trophies and low information echo chamber somewhere else. We’re not buying that shit here. Love ya though. Thanks for playing.",
        "code": 3,
        "wordCount": 481
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Chris Brooks",
        "title": "Do you think there will ever be white lives matter rioting?",
        "text": "probably not. Too busy working are privileged white asses off to riot.",
        "code": 3,
        "wordCount": 12
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Rachel LaBure",
        "title": "What are your thoughts on having black-only safe spaces with snacks and beverages provided on college campuses?",
        "text": "Well my thoughts are if you still need everything handed to you then why go to college? Is that free too. What are you as a college student learning",
        "code": 3,
        "wordCount": 29
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Dustin Carter",
        "title": "Do you think any black person in this century has any justifiable anger towards white people to lay blame on what some people did to their ancestors two centuries ago?",
        "text": "No. Nothing any white person that is alive today had anything to do with the past. We can be angry about how it is expected of us to catch up in education, finance, and the law when only 40 years ago, we were grossly discriminated against in all three realms. My father who is 74 today, experienced hiring discrimination, housing discrimation, and hate crimes as an early 20 man, my dad is a Vietnam COMBAT Vet that fought as a USMC Infantryman (0311) in Hue City and during the Tet Offensive. A true American even without America's love. I get harassed by police with the same attitudes as overseers from the slave days.",
        "code": 3,
        "wordCount": 113
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Susannah Bell",
        "title": "Are you afraid for your children's future?",
        "text": "YES",
        "code": 3,
        "wordCount": 1
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Beverly Seymour",
        "title": "Why does white supremacist admire Russia? While maximum Russians are anti Racist",
        "text": "Putin refused to take in refugees from nonwhite countries when Europe did. He stated, the refugees needed Russian, Russian does not need the refugees.",
        "code": 3,
        "wordCount": 24
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Phil B",
        "title": "Has a black person bullied you for being white?",
        "text": "I somehow survived a dreaded “ pack “ attack aged 13, the black mob of approximately ten “ people” were aged 17 — 20 years.\n\nI can only assume the UK Government panders to these lowest form to maintain Royal opulence & divisive State control.\n\nI have never viewed blacks as being English & never will.",
        "code": 3,
        "wordCount": 54
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Robert Furtkamp",
        "title": "Why does the Anti-Defamation League only give a small summary on it's okay to be white rather than having a full debate with an open comment section?",
        "text": "ADL is an anti-White organization, founded to defend a Jewish pedophile.\n\nIt promotes mass immigration and all sorts of ostensibly non-Jewish issues, and attacks anyone who dares criticize it as “anti-Semitic.”\n\nIt is a hate group, pure and simple - a Jewish hate group.\n\nIt’s not just the ADL either.",
        "code": 3,
        "wordCount": 47
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Chloe Donovan",
        "title": "What are your thoughts on having black-only safe spaces with snacks and beverages provided on college campuses?",
        "text": "What makes you think black-only spaces will be safe? Black males kill each other at an alarming rate—far higher than any other race. (Not a joke. I've seen the statistics over the decades, and they're always the same.)",
        "code": 3,
        "wordCount": 38
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Terry Smith",
        "title": "Why do \"do-gooders\" in the UK think that the rights of illegal migrants should be equal or even superior to ordinary British people?",
        "text": "They're trained idiots. No one's that stupid by accident.",
        "code": 3,
        "wordCount": 9
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "George Derouen",
        "title": "Do you think any black person in this century has any justifiable anger towards white people to lay blame on what some people did to their ancestors two centuries ago?",
        "text": "No. Not justifiable anyway. You can’t justify blaming everyone for what less than 5% actually did while the rest practically all struggled to survive. You certainly couldn’t justify it in the year 2022 with all that’s changed.",
        "code": 3,
        "wordCount": 37
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Travis Earl",
        "title": "In what ways do the minorities in the nation feel that being white is a privilege?",
        "text": "They feel they cannot replicate what we were able to in our once beautiful societies, which is absolutely true and is why this enemy-occupied system wants to import as many coloreds as possible.\n\nOur privilege stems from our evolution and the level of creativity that our people possess, think for example airliners which is exclusively a White man’s industry (the Chinese jets rely on our parts and engines), this makes the coloreds who are on a different evolutionary path compared to us extremely envious and vengeful.\n\nForced mass immigration in our societies, an incredibly dangerous mixture indeed. Only a matter of time until it implodes.",
        "code": 3,
        "wordCount": 103
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Andrea Little",
        "title": "Do you think there will ever be white lives matter rioting?",
        "text": "I think we are handicapped in this area by political correctness and media.\n\nThink of our European ancestors rising up again and again, to fight for our hard won rights; freedom, self-government, no undue taxation, rights of person and property. The history of Western Civilization is messy and filled with lots of mistakes. But, we have made it for millenia, off the sweat of our brow. That’s why the West is rich in necessities and extra goods.\n\nSadly, we seem to have lost our ability to continue to fight for our own survival.\n\nFreedom can be lost in only a generation. Remember this.",
        "code": 3,
        "wordCount": 100
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Stephen",
        "title": "Do you Think Reparations are the only way to fix racial tension between Whites and Blacks?",
        "text": "Sure … and if the Blacks want to pay us Whites for getting you out of the situation you were in .., which was slavery and warfare between tribes … and they didn’t have a written language .. or paper or pens and all of that …\n\nSo if the Blacks want to pay ‘reparations ‘ to the Whites … for dragging them out of the Stone Age … yeah sure why not",
        "code": 3,
        "wordCount": 72
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Cat Phuckers",
        "title": "How can I help the United States become a more diverse society with fewer white people?",
        "text": "You mean “How can I accelerate White erasure to erase the founding stock of America and plunder their wealth?.\n\nYou can pay your taxes, subscribe to a cable TV network, music/TV/film streaming service, or any popular culture magazine (aka purveyors of antiwhite propaganda), shop at pretty much any large multinational corporation, vote Democrat (Republican and Libertarian are also antiwhite parties but not as much most of the time), encourage antinatalism, homosexuality, and transsexuality in Whites, advocate for open borders, speak in support of bills that seek to expropriate White-owned property via taxation, eminent domain, or other methods to give to nonwhites. You can practice “affirmative action” and antiwhite discrimination in your workplace, schools, universities, or government contracting. You can give financial support to the antiwhite terror troops who call themselves BLM, donate to NPR, PBS, your local church, cathedral, mosque, sikh temple, new age movement, synagogue Chabad Lubavitch, B’nai Brith branch, or any other place which tactically promotes “humanism”, “egalitarianism” and “nonracialism” to Whites to get our guard down and prevent us from organizing for our interests. You can deny the existence of race in conversation, and therefore White people while permitting nonwhites to have their own racial identities. You can also stigmatize all White expressions of masculinity while celebrating nonwhite expressions of masculinity (no matter how violent and horrific things like epidemic femicide, FGM, and rape gangs are). You could help recruit young White men into the armed forces and send them off to die in shitholes and tell White men and women that they should try to become the opposite sex and/or seek nonwhite or same-sex partners. You can picket against eugenic policies like abortion (which serve as a positive pressure on our genetic pool not just as White people but as humans) because of the nonexistent intrinsic value of life.\n\nBut the question is, why the hell would you want to do such a thing to my people? Antiwhitism is an evil and depraved ideology motivated by jealousy and irrational hatred, and its adherents are some of the most vile and immoral people on the planet.\n\nAlso, for those of you who, such as myself, believe that White people have a right to exist simply because we are the only ones keeping the world from coming apart and our cultural expressions, ingenuity, and nationbuilding capabilities are uniquely admirable and beautiful, do the opposite of all this as much as you can legally and ethically.",
        "code": 3,
        "wordCount": 404
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Black Jack",
        "title": "When was the first time you realize multiculturalism was a scam?",
        "text": "When I was told by my boss that I had to find a black, preferably a black woman, to hire. I didn’t need anymore staff, but I was told to find a minority somewhere and hire it.",
        "code": 3,
        "wordCount": 37
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Griz Ley",
        "title": "Why are White people not as tribal as other groups?",
        "text": "They can be. I've head Swedes and Icelandics can be very tribal in their native lands.\n\nI think America as the only nation based more on “an idea” than an ages-old cultural identity is a unique social experiment in History. And hit with a toxic shot of postmodern neo-Marxism from the Cult Left a perverse kind of minority tribalism has emerged like a tumor seeking to destroy the hosting organism.\n\nThe greatest unity of the Nation around about the 80's was quite gloriously “color-blind\". If someone believed in and was motivated by “the idea of America\", their skin color and ethnic background was secondary.\n\nBut an injection of Marxist ‘victim mentality’ (See Nietzschean Slave Mentality) that was carried by 2nd and 3rd wave Feminism broke thinks up into “tribal groups\" once again.\n\nMarxism cannot function with tribal division: and the timing of the fall of the Soviet Union is beyond coincidence.",
        "code": 3,
        "wordCount": 147
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Brad Miller",
        "title": "Why do some white Americans think that America is a \"white\" country?",
        "text": "Founded by Europeans, on a Judeo-Christian legal and religious base. Most immigrants are also Europeans, from a Judeo-Christian cultural base. The majority of the population is still, European descended, from Judeo-Christian cultural base.",
        "code": 3,
        "wordCount": 33
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Kevin Picton",
        "title": "As a white person has your life become better or worse because of diversity and multiculturalism?",
        "text": "worse…. because it just added racism against us in our own lands, it took away our place in the world, it made clueless assumptions that we are all rich and privileged and so dont need anything in life. it is a dangerous toxic ideology that perhaps we should use ourselves against those that use it against us to see how they like it.",
        "code": 3,
        "wordCount": 63
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Rolf Jaeger",
        "title": "Are you attracted to any non-whites? Or do you only find whites attractive?",
        "text": "I’m attracted to character, not color. But, my definition of beauty is based on my own race.",
        "code": 3,
        "wordCount": 17
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Sean Casey",
        "title": "Can I join this space if I am of Spanish Descent?",
        "text": "Absolutely. We don't discriminate racially here. The topic is White culture and racism, especially directed toward Whites, but it isn't “Whites only”. Even if it was, Spaniards are White anyway. Heck, I'm part Spaniard myself.",
        "code": 3,
        "wordCount": 35
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Beverly Seymour",
        "title": "Why do black people don't blame Arabs or other black people for slavery? Do they have an issue with white people instead?",
        "text": "Well, white people seem to be the only ones who actually thought about “reparations.” Do white people get reparations for those ancestors who served in the Revolutionary War and civil War too?",
        "code": 3,
        "wordCount": 32
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Eugene Mormon",
        "title": "Why do black people don't blame Arabs or other black people for slavery? Do they have an issue with white people instead?",
        "text": "Because, simply, it is much easier to get money out of White people than Arabs or other Black people. And people are being deliberately programmed, from kindergarten on, to blame Whites and ignore personal responsibility and other parties to blame. It doesn’t matter that a very tiny percentage of Whites were slaveowners and a very tiny percentage of African slaves came to North America; they’re going to go with the path of least resistance. Arabs and other Black people will laugh at them when “reparations” are brought up.\n\nAlso, White people, however small the percentage that were slave owners, still had a substantial number of racists, to varying degrees, even if they didn’t own slaves. And that racism is far more directly experienced than let’s say Arab or African slaveowners. We can bring up White slaves, even enslaved by Blacks, and that would be shrugged off as a “very tiny percentage”, so now we’ll have a pointless argument over whose “tiny percentage” was “tiniest”!\n\nRacism is just part of the human experience that we haven’t fully grown out of, and we also have people who re-ignite the flames of racism and hatred, opportunistic politicians and others who are out to make a buck, or millions of bucks, as in the case of a recent Black supremacist organization, ironically based on Marxism (Marx was not only a White person but a White person who was openly racist against Blacks). So racism and blame and guilt and hate and many other things all have to be sorted through, and people have to learn to communicate and understand and stop blaming and demanding things that they just aren’t entitled to. People have gotten off the chain with all this spoiled, selfish demanding, and it is extremely counter-productive.\n\nIt is and always has been my strong belief that this racism against every race, including White people, demands for “reparations”, regressing to pre-sixties segregation and isolation, pseudo-intellectuals in the media and even the BS “educational” system as well as “celebrities” all are orchestrated behind the scenes by people in power who are controlling society and making a profit off all of this. Every bit of this reeks of it. None of it is natural. Humans just don’t rationally act this way. It is against the best interests of ALL races to act this way, but they are acting out of programming without any thought at all.",
        "code": 3,
        "wordCount": 398
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "JamieBear",
        "title": "If white people had been slaves, would WLM be a thing right now?",
        "text": "White people were enslaved and one thing you always seem to forget is that black people were enslaved by black people not White people and then they were sold to Countries so only people of colour have ever actually enslaved people",
        "code": 3,
        "wordCount": 41
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Todd Hansen",
        "title": "Many people think the term \"white privilege\" is just a more delicate way of saying \"F*** you\" to whites. How true is this?",
        "text": "I will stop supporting “Let’s Go Brandon”, if they stop pushing White Privilege!",
        "code": 3,
        "wordCount": 13
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Robert Furtkamp",
        "title": "Why do White Nationalists who want a White Ethnostate have very non interventionist and/or isolationist foreign policy views?",
        "text": "Let’s assume that you’re talking about ACTUAL White Nationalists, who want an ethnostate -and wondering why their views are non-interventionist?\n\nMaybe because those people are looking out for THEIR people, and their nation, and their race?\n\nYou know, like Lindbergh’s “America First” long before Trump?\n\nOh, wait….\n\nORANGE MAN BAD.\n\nThe question honestly is why does every Tom, Dick, and Harry think that we should intervene everywhere?\n\nWhy should we spend our “Blood and treasure” on foreign “adventures” anyway?",
        "code": 3,
        "wordCount": 73
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Harold Davis",
        "title": "I am a straight white male Why is it that I spent my whole life hating myself, for my character, when I was supposed to love myself, but now that I love myself I am supposed to hate myself for the color of my skin?",
        "text": "Why are you letting a pack of self-centered morons define how you think about yourself? Piss on them. What they think has nothing to do with the worth you hold for the world, especially if their criteria for judgement is about nothing more than what colors of clothing would look best on you. Why do you hate your character? Sounds to me like you’re trying to be a decent, moral person, but you’re worried about factors that have nothing to do with it.",
        "code": 3,
        "wordCount": 83
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Fred Mitchell",
        "title": "Why does white supremacist admire Russia? While maximum Russians are anti Racist",
        "text": "Who are these “white supremacists”? I mean seriously. Before, it was just a small number of extremists. Now, it’ s anyone the left does not like. You don’t even need pale skin to be a “white supremacist” anymore! Even I could be one! LOL\n\nAny country has the right to take in or not take in “refugees”. And not everyone clamoring to get in claiming to be one actually is, as was demonstrated by all the “refugees” Germany took in back in the 2015 time-frame. I only mention this because another answer to this question mentioned them.\n\nI am not aware of anyone who is truly a “white supremacist”. And quite frankly, I don’t think it’s a big deal, anyway. It’s more a political tool that the Democrats have been using to keep Blacks and other “minorities” (what does that even mean anymore?) on that Democrat Plantation.\n\nSo maybe be a bit more specific, as in specific individuals who are clearly and truly “white supremacists”, and I can give you a more meaningful answer to that question.",
        "code": 3,
        "wordCount": 174
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Mike Phillips",
        "title": "Is white supremacy really black inferiority?",
        "text": "An interesting play on words that will get you called a racist (I don’t care). In a foot race if the black guy is ahead is he fast or the white guy behind him slow? Reverse the positions does it show superiority, inferiority or just speed?\n\nLet’s just stick to the basics and do the best we can. Don’t cheat or try to hold someone else back. If you win the race, give the losers some tips on how to do better. But don’t slow down to make them look faster.",
        "code": 3,
        "wordCount": 90
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Bealey L. Hansen",
        "title": "Why do black rappers say end to racism but get mad when a white person raps?",
        "text": "Why do black rappers say end to racism but get mad when a white person raps?\n\nI'm guessing they only want to end racism towards them but not towards white people.\n\nRappers shouldn't be allowed to speak, mostly they just blabber on about money, guns, violence, naked girls and how much gold they can fit between their teeth.\n\nRap is mostly about gangs and violence, how this category of \"music\" is even allowed is a mystery.",
        "code": 3,
        "wordCount": 73
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Kapil Bohra",
        "title": "Why does it feel increasingly wrong to be a white person?",
        "text": "I am an Indian and you should be as proud of your European (white) heritage as I am of mine. Don't let half ass people tell you who you are. Get control of your countries and set things straight.",
        "code": 3,
        "wordCount": 39
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Stephen",
        "title": "Did slavery only exist in Western civilizations or did it also occur in African, pre-Columbian and Asian civilizations?",
        "text": "Lets answer this question one part at atime … and Did slavery only exist is Western civilisation so that is a definite NO\n\nAnd the second part about Did it also occur in Africa , pre Columbrian and Asian civilisation … then that is a defenite YES …. and slavery in Africa , and tribal wars and taking woman from other tribes , and using them as , for whatever , then a big YES … and that was happening in Africa , for a 1000 years before any White man even knew that Africa existed\n\nAnd the Aztecs in South America , and the Chinese and just about everywhere else …. and this modern day myth that the White man ‘invented slavery and it’s all the White mans fault … is all just that … A MYTH . . because slavery , as in trading in humans was alive and well in Africa and had been for a 1000 years before the White man even knew where Africa was ….\n\nAlso the Aztecs and Incas in what is now called South America and Mexico … they were doing it , also a 1000 years before the first White man even stepped foot in South America\n\nSo lets dispel all of these myths about it how ‘ it is all ithe White mans fault ‘ and they invented slavery and it wasn’t happening until the White man got there …. and all of that is just so much rubbish that it is not even worth discussing …. except to dispel the idea that it is all the White mans fault…because that is worth discussing ..big time!",
        "code": 3,
        "wordCount": 272
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Griz Ley",
        "title": "Do you think illegal immigrants respect Americans once they come to the U.S.? Why or why not?",
        "text": "Their entry to the country was a very great disrespect not just of Americans but of their own countrymen who respected Americans enough to immigrate legally.\n\nWhether justified in their own minds or not, they saw their own wants or needs a superseding the laws of the land. Exactly HOW does one just “turn that off”?\n\nIt’s a bit like asking if you think a burglar, fraudster or embezzler will suddenly start respecting other people when they get enough money to live on.",
        "code": 3,
        "wordCount": 81
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Sean Casey",
        "title": "What are the Nazi songs that contain antisemitic and homophobic lyrics?",
        "text": "there aren't any.",
        "code": 3,
        "wordCount": 3
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Dan Sutton",
        "title": "Do you think the racist space on Quora \"It's okay to be white\" should be banned? It promotes racism freely and is very toxic.",
        "text": "SO if there’s a similar space “It’s OK to be black”, then that, too, would be banned? How about “It’s OK to be Asian”? “It’s OK to be Latino”? “It’s OK to be Gay”?",
        "code": 3,
        "wordCount": 34
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Logan Deutschmann",
        "title": "Can I join this space if I am of Spanish Descent?",
        "text": "Yes, regardless of descent, anyone may join this space if they so choose.\n\n(If the implication is that you cannot join because, as a Spaniard, you are not white, then that too is wrong. Spain has been an invaluable country to Christendom and to Europe. It's people look, act, and have always been 'white'/ European — as much as any Frenchman.)",
        "code": 3,
        "wordCount": 60
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Mike Buckley",
        "title": "Why isn't Britain apologizing for what they have done to this world?",
        "text": "yeah look sorry. We will fix it asap.\n\nYou’ll know when we do because theyll be no more\n\nbullets for your guns. get the muskets out\n\nsteam engines so unless youre on hydro or wind no electricity which you may not need due to the lack of\n\ninternet\n\ncomputer\n\nlightbulbs (no Edison didnt invent them)\n\nand telephones\n\nmake sure you dont get an infection, no more antibiotics or hypodermic syringe so luckily no vaccines ether\n\nno jet engines so slow plane only and no cruses either\n\nno netflix and chill cause no internet, phone or TV, wed telegraph you but yeah\n\nreally sorry to the kids in the middle east but you have to stop using our desalination tech, sorry\n\nIm sure by now you have worked out im be facetious, but the point is valid. you sit there in luxury that would make the Emperor of ancient Rome or Mali jealous and demand people born thousands of years ago appologise for doing what people all across the world have always done.\n\nYou have today because they ddid what they did yesterday, but if it pleases you I as a British Citizen will appologise if you go back to the life your ancestors led before they came into contact with Britain.",
        "code": 3,
        "wordCount": 198
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Shane Powell",
        "title": "What are your thoughts on having black-only safe spaces with snacks and beverages provided on college campuses?",
        "text": "Oh look, the Democrats are trying to bring back Separate but Equal, what’s next Jim Crowe?",
        "code": 3,
        "wordCount": 16
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Factotum DLVIII",
        "title": "How do white people feel about being white?",
        "text": "How do white people feel about being white? Personally, I love it! I wouldn't have it any other way! 👍✌️",
        "code": 3,
        "wordCount": 20
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Factotum DLVIII",
        "title": "Why are there black main characters in the show Vikings?",
        "text": "Why are there black main characters in the show Vikings? Black Vikings? That is bloody ridiculous. If that's going to happen, I want to see a white, blond, blue-eyed actor playing Shaka Zulu. Bloody ridiculous, I repeat!",
        "code": 3,
        "wordCount": 37
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Reuben Hayat",
        "title": "Are you attracted to any non-whites? Or do you only find whites attractive?",
        "text": "According to my detractors, I’m a hard-core racist - and yet I find women of all colors and races attractive. My ex-wife, mother of my children, is South Indian and brown.\n\nIf I had to pick an “ideal beauty,” it would be olive skinned (like me) and of the type we often find in Saudi Arabia and the Gulf States. That’s perfection for me. But I could look into the eyes of a stunning redhead all day long too.\n\nWhen visiting Southern Ethiopia, I was surprised by the fact that some of the charcoal black women there were quite easy on the eyes. Many of them go bare-breasted too. A nice bonus!\n\nI’ve never seen an attractive Australian Aboriginal woman, but then again, I’ve seen very few; I’m sure they’re out there.",
        "code": 3,
        "wordCount": 129
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Vivian Turnage Leese",
        "title": "In what ways do the minorities in the nation feel that being white is a privilege?",
        "text": "The minorities feel that being White is a privilege because they are not White. They observe our successes and prosperity; they erroneously deduce that if they were White, success and prosperity would follow,\n\nThe minorities forget the part about the hard work, excellent education, financial acumen, our creativity and leadership abilities. These count, too. We are not just White.",
        "code": 3,
        "wordCount": 58
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Kirk Langford",
        "title": "Why do \"do-gooders\" in the UK think that the rights of illegal migrants should be equal or even superior to ordinary British people?",
        "text": "Well if they do that you are doomed they are hungry you are fat they come from a violent, mean place and they are the ones that made it that way so good luck just lock your doors hide your daughters THEY ARE COMING.",
        "code": 3,
        "wordCount": 44
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Paul Greasby",
        "title": "Why do \"do-gooders\" in the UK think that the rights of illegal migrants should be equal or even superior to ordinary British people?",
        "text": "Because they don’t have to live next door to any of them and it makes their persona on twatbook look good in the eyes of the moronic and those as deluded as they are",
        "code": 3,
        "wordCount": 34
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Stephen",
        "title": "Why do White Nationalists who want a White Ethnostate have very non interventionist and/or isolationist foreign policy views?",
        "text": "HaHa …. fuck really …. and in among all of that ‘gobbledegook ‘ , did you actually ask if a group of people , that have now been labelled as ‘ White Nationalists’ because thet don’t agree with BLM and other minorities being allowed to dictate terms to the majority …\n\nAnd these White Nationalists ….. who according to the media would be any White person that voted for someone of their own colour and that didn’t vote for a black candidate …. then they have to be White Nationalists ….\n\nFuck man , why are White/European Americans so freaked out and afraid to stand up for your heritage …. or do you just want to be ruled by minorities , like blacks and mexicans ….what is wrong with you.",
        "code": 3,
        "wordCount": 128
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Robert Furtkamp",
        "title": "What are the Nazi songs that contain antisemitic and homophobic lyrics?",
        "text": "Look at the lyrics to the wartime and pre-war songs.\n\nThey’re neither.\n\nThey promote love for the Fatherland, for the country, for the race, for the Fuhrer.\n\nYou know, basic normative values.\n\n“Homophobic” is as much a slur as “antisemitic” for what it’s worth, and was irrelevant then - gayness was not a standard nor was there any tolerance given whatsoever.\n\nIf you want to be critical, the degeneracy of Weimar, and the promotion of same by a certain religious and ethnic group that weren’t German…led directly to the rise of the dreaded Nazis.",
        "code": 3,
        "wordCount": 89
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Travis Earl",
        "title": "Why do some white Americans think that America is a \"white\" country?",
        "text": "Because it is a White country and the squealing of hatred and vengeance by our enemies grows ever stronger as they know this to be true.\n\nBecause our pioneer ancestors and the men who held the levers of power wanted this nation to be for only Whites.\n\nWhy must it be so controversial for these facts to be true? Because America is now an enemy-occupied territory that seeks to displace us and prepare us for extinction via the mass importation of hostile non-Whites and decades-long mass brainwashing that has neutralized our defenses.\n\nDo not be intimidated by those who seek to confuse you and make you feel guilty. The United States was a nation founded by tough White men and we must struggle once more to bring back natural order.",
        "code": 3,
        "wordCount": 127
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Quentin Richards",
        "title": "What are your thoughts on having black-only safe spaces with snacks and beverages provided on college campuses?",
        "text": "Are we going to have “whites only” spaces too? Where I can seek respite from people constantly telling me that I'm Racist based only on the Color of my skin?",
        "code": 3,
        "wordCount": 30
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Harry Decker",
        "title": "Do you feel that television media is trying to shove racial mixing and racial diversity down your throat?",
        "text": "Yes, definitely.\n\nI understand the BBC doing it. They are a propaganda organisation and have no customers to worry about. The wok eaters have captured it in the way many once great charities have been captured, and without customers nobody can object.\n\nbut why does Disney, Netflix, Amazon etc do it. They have shareholders to answer to. And all the advertisers are at it. All families in adverts are black or mixed race. That is not how life is. It pisses off customers. It is damned odd. And irritating. And sinister.",
        "code": 3,
        "wordCount": 89
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Sean Casey",
        "title": "Is the Darrell Brooks verdict compared to the Kyle Rittenhouse verdict proof of our two-tiered justice system heavily in favor of white people?",
        "text": "You can't compare these two cases. It's like comparing apples to a literal pile of shit.\n\nKyle shot three people, killing two of them while defending himself from a violent assault while heavily outnumbered and clearly endangered himself to give his attackers every opportunity to surrender. All of that after preventing a terrorist attack.\n\nDarrell Brooks went on repeated racist rants making threats on social media then drove his SUV into a crowd of families that were attending a parade.\n\nRace had nothing to do with the results of either case, although it clearly had everything to do with how each case was treated by the media.\n\nTo ask such a question shows you either have zero familiarity with the facts of either case, or you're incredibly disingenuous.",
        "code": 3,
        "wordCount": 124
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "David Harding",
        "title": "Do you believe Michelle Obama? Do white policemen shoot African-Americans every day?",
        "text": "If you look atr the figures for who shoots black people, at the top of the list is other black people.\n\nWhite cops are a very long way down the list.\n\nMichelle Obama is just jumping on a bandwagon.\n\nBetween 2017 and 2021, the total number of black people shot by police of all colours were wel under 365 every year. - So she is lying.\n\nOn the other hand the number of white people shot by US police in those years was over 365 in every year.",
        "code": 3,
        "wordCount": 84
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "The Friendly Fascist",
        "title": "Do you Think Reparations are the only way to fix racial tension between Whites and Blacks?",
        "text": "No, the way we fix racial tension is to stop talking about it & stop pointing fingers at each other.",
        "code": 3,
        "wordCount": 20
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Vivian Leese",
        "title": "If I believe the government intentionally oppresses people of color, does that make me a black supremacist?",
        "text": "Yeah. So?",
        "code": 3,
        "wordCount": 2
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Timothy Moran",
        "title": "Why does it feel increasingly wrong to be a white person?",
        "text": "Maybe you don’t have a strong white ethnic identity. I am 100 percent Irish American. I will always be proud of my ancestors.",
        "code": 3,
        "wordCount": 23
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Bob Troxell",
        "title": "If white men are eliminated, who’d be next to go?",
        "text": "White women.",
        "code": 3,
        "wordCount": 2
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Dick Orange",
        "title": "Why is it that when someone says \"I don't like black people,\" it's considered racist, but when someone says \"I don't like white people,\" it's not?",
        "text": "Television.",
        "code": 3,
        "wordCount": 1
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Sean Casey",
        "title": "Why do White Nationalists who want a White Ethnostate have very non interventionist and/or isolationist foreign policy views?",
        "text": "are you actually asking why a group of people that wants to be left alone wants to leave other people alone?",
        "code": 3,
        "wordCount": 21
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Brad Miller",
        "title": "A suspect have just murdered your family. Does adding descriptive features [e.g. ethnicity and gender] of the suspect via comms. increase the chance for the police to locate the suspect quickly or is it racism to use racial descriptive words?",
        "text": "“A person just killed my family.”\n\nOK, that is 100% of the human population.\n\n“A man just killed my family”.\n\nOK, we’re making progress — now it’s down to HALF the human population.\n\n“The man was X race”\n\nNow we are making some real progress. Depending on where you live, you have cut another 80% or 90% off the “possible suspects list”.\n\n“He was very short, and fat”.\n\nYes, even more physical description! We can eliminate all the average- and tall-men, all the medium- and thin- men.\n\nWe have gone from 1 person in 8 billion, to a short, fat, ethnicity X male. The police now actually have a DESCRIPTION of who to look for.",
        "code": 3,
        "wordCount": 107
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Robert Low",
        "title": "Can an American citizen born in Egypt check the box \"African American\"?",
        "text": "Elon Musk is an African American, which is why calling blacks that is extremely inaccurate. Especially blacks born in America. They weren't born in Africa. We are Americans. No hyphens. The same with labeling them people of color. We are all a color. If anything black is the absence of all color, while white is the presence of all color. They just want to drive a wedge between everyone to control them. Don't be controlled, think for yourself, and think critically.",
        "code": 3,
        "wordCount": 81
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Robert Furtkamp",
        "title": "What do you think the White European Population will be globally by 2100?",
        "text": "I’m not a censustaker, but I will note someone …hates this question. “Report reason: Doxing” was filed. Doxing? REALLY?",
        "code": 3,
        "wordCount": 19
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Nick Wee",
        "title": "Has race relationships improved since the woke culture and BLM started gaining more traction around the world?",
        "text": "Many of us knew where it would lead. It’s went exactly the same way the Transgender movement is heading towards: NOWHERE.\n\nWho knew that calling the majority of people (ie. the right and centrists) “racist” and “transphobic”if they did not buy COMPLETELY into the Leftist narrative would result in a social backlash?\n\nObviously, the Right took advantage of this by showing the insane rants of SJWs whenever someone asked a question that did not fully affirm their beliefs. It’s why the Left never gets much done - they take 3 steps forward and 2 steps back.\n\nThey literally made the word “Woman” the first ever word in history to be “personally defined by each individual”.",
        "code": 3,
        "wordCount": 112
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Michael Shore",
        "title": "Do you feel that television media is trying to shove racial mixing and racial diversity down your throat?",
        "text": "Very much so",
        "code": 3,
        "wordCount": 3
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Matt Y",
        "title": "Who is likely to be wrong, white people who state they are not all white supremacists or black people who claim that all whites are supremacists?",
        "text": "For every single white person to be a white supremacist when there are white people who literally hate themselves for the fact that they’re white, yeah, that’s crazy.",
        "code": 3,
        "wordCount": 28
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "N. Robert Pape",
        "title": "Did the Black Lives Matter protests of last year induce self-hatred in people with white skin?",
        "text": "No, but it was a bit pathetic when white police officers got on their knees in front of black gangsters. The black guys should have demanded blowjobs from those white male cops, or demanded that the white cops daughters be brought out so the rioters could have sex with them in the street. The white cops might have done it. They’d do it and weep “I'm sorry! I'm so sorry!”",
        "code": 3,
        "wordCount": 70
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "James Taylor",
        "title": "Do Germans have a distaste for their own land and people? If so, why?",
        "text": "Not at all. Germans that I have spoken to love their own people and country and, rightly so.",
        "code": 3,
        "wordCount": 18
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Andrea Little",
        "title": "Do Germans have a distaste for their own land and people? If so, why?",
        "text": "Im not German, so I can’t say with certainty. The people there should be proud of their history and contribution to European/Western history. They pretty much brought Rome down, and populated Britan. Where would the English language he without our short and spicy words from the Anglo Saxons?",
        "code": 3,
        "wordCount": 48
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Cameron Smith",
        "title": "Do you believe Michelle Obama? Do white policemen shoot African-Americans every day?",
        "text": "Who cares what she says, she's a lying racist. 🤥",
        "code": 3,
        "wordCount": 10
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Bee Leland",
        "title": "Why does it feel increasingly wrong to be a white person?",
        "text": "Mental illness is the only reason a person who is white would feel “wrong to be white.” And it seems like we have a lot of mental illness in the USA.",
        "code": 3,
        "wordCount": 31
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Travis Earl",
        "title": "Why does Quora support racism?",
        "text": "Because they are based in Silicon Valley, one of the great bastions of anti-White hatred that enables the replacement of White peoples worldwide.\n\nMark my words, it will not be too long until those of us who want our people to survive are shut down and perhaps be ratted out by the enemy and his minions.",
        "code": 3,
        "wordCount": 55
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "John Tibbott",
        "title": "Are you attracted to any non-whites? Or do you only find whites attractive?",
        "text": "This sounds overly racial but I’m attracted to all groups of women who are attractive. Why make it about race?",
        "code": 3,
        "wordCount": 20
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Wesley Hallman",
        "title": "Is a white 15-year-old school girl a racist if she refuses to date black male students?",
        "text": "No you’re aloud to have preferences as long as she’s nice about it",
        "code": 3,
        "wordCount": 13
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Bee Leland",
        "title": "Will some predominantly white countries in eastern Europe surpass the west which promotes diversity?",
        "text": "If white countries in Eastern Europe continue to import miscreants from other continents then they could easily pass the USA in rape and other violent crimes. Sweden saw an 800% increase in rape in one year due to their cherished refugees",
        "code": 3,
        "wordCount": 41
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Kima",
        "title": "Are you afraid for your children's future?",
        "text": "I'm in my late 20s and I refuse to have children and subject another poor human being to this shit show",
        "code": 3,
        "wordCount": 21
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Steven White",
        "title": "Do people really think white privilege doesn't exist when black US families have 10% of the wealth of what white families do? Or do they think that black people are just 9 times as lazy or something, with no proof?",
        "text": "You won’t like the truth…\n\nIn the 1920’s the black community had a culture. They had 70% two family homes and were so prosperous they called their communities “Black Wallstreet”.\n\nThen the democratic KKK killed them and put them in slums where they keep them to this day.\n\nThey infected them with a culture where the coolest thing is to be a gangster and women are bitches and whores.\n\nAnd so now two family homes are less than 20%.\n\nLazy? We got more black athletes making 6 figures then ever before. Lazy people don’t excel in sports.\n\nBut your culture is holding you down and killing you. Your kids on on the streets gang banging instead of in schools getting educated. You can recite the words to 50 rap songs but can’t recite the first sentence of the bill of rights.\n\nwhen was the last time you saw a video of a gang of white dudes jumping a black person? I can call up about 50 black people jumping white people in about 10 seconds.\n\nGet that mythical white suppression out of your head. It’s keeping you in chains you’ve invented in your own mind…\n\nBut I understand…. It’s always easier to blame another than to look into the mirror and say “I am fucking my life up”!",
        "code": 3,
        "wordCount": 209
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Cailean MacConnich",
        "title": "Can you imagine the world if white men were as racist TV depicts them?",
        "text": "If white men were truly as racist as the media and many ignorant people think they are, then white men would have wiped other people of the face of the planet. We have for a long time had the technological means to do so.\n\nBut they did not, and they did not because white men are not anywhere near as racist as people seem to think. We love other people and other cultures. We appreciate and celebrate our differences, it’s really that simple.",
        "code": 3,
        "wordCount": 82
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Dan Smith",
        "title": "Do people really think white privilege doesn't exist when black US families have 10% of the wealth of what white families do? Or do they think that black people are just 9 times as lazy or something, with no proof?",
        "text": "There is no such thing as White privilege. Anyone who puts in the effort can be successful in America.",
        "code": 3,
        "wordCount": 19
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Kapil Bohra",
        "title": "Is white supremacy really black inferiority?",
        "text": "There is nothing like a particular race supremacy today. What is sad however is how white people are targeted for the past, which is irrelevant.\n\nWhite supremacy is a term used by folks who want to buy that cheap meal ticket at the cost of guilt and charity. The truth is Africans are a very volatile set of people, not just in US, but even when they have a full fledged continent to themselves. I sometimes just wish, those people didn't exist on the beautiful lands of Africa.",
        "code": 3,
        "wordCount": 87
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "M DeYoung",
        "title": "Why does white supremacist admire Russia? While maximum Russians are anti Racist",
        "text": "Because Russians (minus evil Putin) have PRIDE in themselves and their European culture. And they don't let evil white liberal elites tell them any different,!",
        "code": 3,
        "wordCount": 25
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Ivan Rychecký",
        "title": "Why does white supremacist admire Russia? While maximum Russians are anti Racist",
        "text": "Propably because they know nothing about Russia except for some selectively choosen information that were fed to them by their favourite social media influencer and/or politician. Same issue with Hungary.\n\nAnyway, I wouldn't say Russians aren't racist. They are, but while in the US racism is mainly about skin color, in Europe it is more about ethnicity/nationality. For example, in the last partial mobilization, officials primarily focused on recruiting non-ethnic Russians. They also use ethnic slurs such as “khokhols” when speaking about Ukrainians.\n\nOn the other hand, Russia is home to the largest number of Muslims in Europe (approx. 14 million / 10% of the population) and Shariá law is commonly practiced in some of its parts.\n\nAnyway, Russia is pretty damn big, almost twice the size of the US, and it's naive to think that all areas are the same.",
        "code": 3,
        "wordCount": 138
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Eddie Savage",
        "title": "Why do white Americans believe they can come here and claim to have rights to stolen land and feel they can determine who and who is not Illegal, I’m a native Mexican, an Aztec descendant my family has been here for thousands of years long before Columbus arrived here we’ve have migrated here on our land for thousands of years, so tell me who are you to decide who is an immigrant and who is not?",
        "text": "You just answer your own question; you migrated here thousands of years ago. “White” Americans migrated here too. Migrating to a land gives people rights to that land if they can conquer its existing inhabitants. Just as your ancestors migrated across parts of the Americans and killed off the existing inhabitants through war and human sacrifice, “white” Americans migrated to the Americas and killed off the existing inhabitants.\n\nJust be thankful they were kind enough to let you keep some of your own lands, traditions, and governing bodies and didn’t sacrifice you all to their god.",
        "code": 3,
        "wordCount": 95
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "James Fineron",
        "title": "Did slavery only exist in Western civilizations or did it also occur in African, pre-Columbian and Asian civilizations?",
        "text": "All of the above. There are certain people who deny it. They shouldn't deny truth.",
        "code": 3,
        "wordCount": 15
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Brad Miller",
        "title": "In what ways do the minorities in the nation feel that being white is a privilege?",
        "text": "In delusional ways.",
        "code": 3,
        "wordCount": 3
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Earl Turner",
        "title": "As a white person has your life become better or worse because of diversity and multiculturalism?",
        "text": "No white person alive has benefited from state sponsored diversity and multicultural because certain groups get left out or left behind. The only ones who benefit are the “protected\" groups…….the homosexuals, the transgenders, the illegal migrants and of course the blacks. They become the groups who are untouchable, who's crap don't stink, the one who get preferential treatment at the cost of everyone else. This is a tactic the radical left uses to dismantle the country from within.",
        "code": 3,
        "wordCount": 78
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "James Taylor",
        "title": "Why does Quora support racism?",
        "text": "Utter rubbish. Quora is the fairest channel you will find on this subject.",
        "code": 3,
        "wordCount": 13
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Don Woods",
        "title": "As a white person has your life become better or worse because of diversity and multiculturalism?",
        "text": "Better I guess since the proliferation of Mexican and Asian restaurants that close as quickly as they open has provided an opportunity to taste widely different takes on the cuisines without fear of burnout.",
        "code": 3,
        "wordCount": 34
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "David Kirby",
        "title": "Did slavery only exist in Western civilizations or did it also occur in African, pre-Columbian and Asian civilizations?",
        "text": "Slavery has been seen everywhere that people have lived. It existed among people of the same race as well as people of different races. It still exists in different forms today . If you think all those low cost goods you see on store shelves are made by well paid workers, think again.",
        "code": 3,
        "wordCount": 53
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Formless One",
        "title": "Why does the Anti-Defamation League only give a small summary on it's okay to be white rather than having a full debate with an open comment section?",
        "text": "Because the majority of us really don’t care.",
        "code": 3,
        "wordCount": 8
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Christian Marshal",
        "title": "Is white supremacy really black inferiority?",
        "text": "Mostly yes and a little bit no, no, because it’s not that specific. But the belief that white people are superior to everyone else does mean they also believe black people are inferior so mostly yes, and so are brown, Asian, Hispanic basically anyone who isn’t Caucasian. Before I get blasted I would like to clarify that this is what white supremacists believe as they were the subject of the question and not what I believe. Personally ai think any person that thinks you can determine a person’s value by their ethnicity is stupid, crazy or both.",
        "code": 3,
        "wordCount": 97
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Jeff Fisher",
        "title": "Why do so many black neighborhoods have such high crime rates as compared to most white neighborhoods?",
        "text": "Thomas Sowell has a book where he attempts to clarify such topics called Black Rednecks and White Liberals.\n\nBlack Rednecks and White Liberals - Wikipedia\n2005 book by Thomas Sowell Black Rednecks and White Liberals is a collection of six essays by Thomas Sowell . The collection, published in 2005, explores various aspects of race and culture, both in the United States and abroad. The first essay, the book's namesake, traces the origins of the \"ghetto\" African-American culture to the culture of Scotch-Irish Americans in the Antebellum South . The second essay, \"Are Jews Generic?\", discusses middleman minorities . The third essay, \"The Real History of Slavery,\" discusses the timeline of abolition of slavery and serfdom . The last three essays discuss the history of Germany , African-American education , and a criticism of multiculturalism . Black Rednecks and White Liberals [ edit ] The title essay states Sowell's thesis about the origins of the \"black ghetto\" culture. Sowell argues that the black ghetto culture originates in the dysfunctional white southern redneck culture which was prominent in the antebellum South . That culture came, in turn, from the \" Cracker culture\" of Welsh, Highland Scots, Ulster Scots, and border English or \"North Britons,\" who emigrated from the more lawless border regions of Britain in the eighteenth century. [1] Are Jews Generic? [ edit ] In the collection's second essay, Sowell explores the origins of anti-Semitism among those harboring jealousy toward Jews for their financial and entrepreneurial successes. Among other historically-persecuted \" middlemen minorities \" were Lebanese and Chinese immigrant merchants. The resentment is from a perceived \"lack of added value\" that the middlemen provide, as it is not easily observable. The Real History of Slavery [ edit ] In the collection's third essay, Sowell reviews the history of slavery. Contrary to popular impression, which blames Western society and white people as the culprits, Sowell argues that slavery was a universal institution accepted and embraced by nearly all human societies. The world's trade in slaves and then slavery itself, was abolished by the British in the 19th century, against opposition in Africa and Asia, where it was considered normal. The economic effects of slavery are also misunderstood since slaves were often a luxury item whose upkeep was a drain on the rich, and the availability of cheap slave labor nowhere resulted in wealthy societies. Germans and History [ edit ] The fourth essay features Sowell's argument that Germany should not be defined solely by the 12-year regime of Adolf Hitler from 1933 to 1945. Sowell further argues that Hitler was highly inconsistent in his views toward an unified Germany since he strenuously argued for annexation of the German-dominated Sudetenland , but German-dominated portions of Italy such as Tyrol were ignored in preference for an alliance with Benito Mussolini . Black Education: Achievements, Myths, and Tragedies [ edit ] The fifth essay features Sowell's discussion of the early days of Dunbar High School in Washington, DC, and its eventual deterioration\nhttps://en.wikipedia.org/wiki/Black_Rednecks_and_White_Liberals\n\nBasically, it all boils down to slave owners were a bunch of dysfunctional people who came from the Highlands, Scots and other places where there was this pre-redneck way of life. Lots of fighting, laziness, and people of generally low status. They passed off that behavior to the slaves that they owned. But the way that the slave owners treated their slaves more or less engraved that behavior in the slaves even more than what they experienced. When they left their slavers, they kept on with the bad lessons that they were taught.\n\nIt has only been in perhaps the latest generation where southern whites have started to change.",
        "code": 3,
        "wordCount": 603
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Kyle Yadon",
        "title": "Why do so many black neighborhoods have such high crime rates as compared to most white neighborhoods?",
        "text": "Statistically speaking, based upon FBI databases, about 2/3 of all violent crime is single raced, that is the perpetrator and the victim are the same race. And with the majority of assaults, armed robberies, and burglaries being committed by black men, that would make the majority of victims of these crimes also black. Or to simplify, it’s black on black crime. As for why? Ever since the democrats started pretending to care about the black community following LBJ’s “great society” speech, the black community has been experiencing increasing poverty and crime at the same time that they’ve been seeing a decrease in stable households. At the time of the civil rights act most black households had two parents and were actually not so significantly different from white communities in terms of poverty and crime. Today, the vast majority of black households are single parent, and their crime and poverty are significantly higher than similar white communities.",
        "code": 3,
        "wordCount": 156
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Veritas Aequitas",
        "title": "Why do so many black neighborhoods have such high crime rates as compared to most white neighborhoods?",
        "text": "The absence of the nuclear family. Women who choose to breed with multiple men and marry the state for support. The state is way too generous in that regard. The figure is 72% single motherhood. That’s not people coming together in love and harmony with a genuine intent to make a family only to break up. That’s women making a deliberate decision to furnish themselves with welfare vouchers in the form of kids. Guaranteed income. Women are the worse custodians of children when it comes to discipline.",
        "code": 3,
        "wordCount": 87
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Pete Kevin",
        "title": "Is it really OK to be white?",
        "text": "It's better than okay, it's perfect.",
        "code": 3,
        "wordCount": 6
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "William Joseph Wheeler Madrid",
        "title": "Why does Quora support racism?",
        "text": "Seriously? My posts get censored left and right. Moderators will respond, and block my ability to post a reply because I'm challenging their woke narrative.",
        "code": 3,
        "wordCount": 25
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "John Tibbott",
        "title": "People like Erika Denise, who wrote a column in Washington post, about how Argentina doesn't have a black player. Why cannot she ask the same to China, India etc.? Why does she not question when France, UK is overrepresented by black people? How is this hypocrisy going to end?",
        "text": "When these virtue signaling SJWs are fired. That won’t happen anytime soon.",
        "code": 3,
        "wordCount": 12
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Patrick Appell",
        "title": "Why does it feel increasingly wrong to be a white person?",
        "text": "Perhaps because you have been listening too much to the BS anti-white narrative being pushed today?",
        "code": 3,
        "wordCount": 16
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "D Creech",
        "title": "As a white person who has faced hardships and difficulties in life, how does the term “white privilege” make you feel?",
        "text": "White privilege is a term that lazy folks use to explain why they are not as prosperous as other people. Race has ABSOLUTELY no bearing on it. Either you ate lazy or you have ambition to better yourself. End of story.",
        "code": 3,
        "wordCount": 41
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Neil Andrews",
        "title": "Do people really think white privilege doesn't exist when black US families have 10% of the wealth of what white families do? Or do they think that black people are just 9 times as lazy or something, with no proof?",
        "text": "No, it does not exist. There are more poor whites in the US than there are poor blacks. There are very rich whites and rich blacks in the US and around the world. It is true that some people have advantages over others, but it is not based on race. Growing up in a traditional 2-parent family is a big advantage over a single parent family. But that is a choice people make unrelated to skin color. There is a higher percentage of blacks with single moms than whites with single moms. But again, that is a choice, not due to racism. No one forces a woman to have sex with someone they are not married to legally. It is called rape if they do.\n\nIf anything, there is black privilege in the US at the moment, a black high school graduate from a middle-class family gets preference over a poor white student in most colleges today. The same is true in the workplace. I know the company I worked for, for 37 years gave preference to blacks and women over white males in engineering positions because there were so few women and blacks in engineering, and they wanted to avoid EEOC scrutiny. It was actually worse with women. The blacks that I worked with were very competent and did well. But there were several women that were not good at their jobs but got promotions anyway. There was also one Vietnamese engineer that got shafted by the female lead engineer in our group. He worked 24 hours straight through the night to get a design drawing done on time and was punished for doing so. Inputs from the stress group on his assignment came in late, giving him very little time to upgrade the design based on their inputs. The female lead got an award for getting the job done on schedule. He got a pay cut.",
        "code": 3,
        "wordCount": 317
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "James Webb",
        "title": "Why does Quora support racism?",
        "text": "It doesn’t , the opposite in fact . I have had posts deleted and given warning without writing anything other then documented facts. The ancient Greek philosophers headed by Socrates seldom agreed with each other . but what they had which is now being denied by the Lib / Left is Debate . The basis of Democracy.",
        "code": 3,
        "wordCount": 57
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "David Kirby",
        "title": "Will some predominantly white countries in eastern Europe surpass the west which promotes diversity?",
        "text": "Diversity does not contribute to economic growth. It may give people of different ideologies a forum in which to express themselves; but in the long run, that’s all it does. If societies are to improve , then we need skilled people. All the diversity in the world won’t change that. Those areas that concentrate on educating young people in useful things rather than worrying about whether or not the make up of society reflects some sort of diverse ideal, will leave us in the dust. If you have three people of different backgrounds defusing a bomb, it’s a good idea if they are all on the same page for the job at hand.",
        "code": 3,
        "wordCount": 113
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Oscar Fausto Pelosi",
        "title": "Has race relationships improved since the woke culture and BLM started gaining more traction around the world?",
        "text": "Woke shit and BLM bullcrap has exacerbated racial tensions thanks to some elitists that pushed, on stupid, uneducated, ignorant people shit in their heads.\n\nBLM? No, thanks, I'm not a racist and I don't care about BLACK lives only but about ALL lives.\n\nWoke and cancel? What's that shit? History is HISTORY. And history is something that is unchangeable. And let's give a deep look in the history of slave trading: oh, slave traders were black Africans who sold captured enemies to slave traders…",
        "code": 3,
        "wordCount": 82
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Bradley Wood",
        "title": "Is it really OK to be white?",
        "text": "Yes, you don’t have control over it. That would be like asking is it okay to be Black or is it okay to be Chinese? We’re all humans. Love the variety.",
        "code": 3,
        "wordCount": 31
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Aramil Galendel",
        "title": "If white people had been slaves, would WLM be a thing right now?",
        "text": "All races of humans have been at one point slaves. Hell if memory is right then when America was outlawing slavery, in other parts of the world white people where still being owned. Maybe avoid super liberal posts that tell false narratives.",
        "code": 3,
        "wordCount": 42
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Sindre Rudshaug",
        "title": "Why do White Nationalists who want a White Ethnostate have very non interventionist and/or isolationist foreign policy views?",
        "text": "No rational, ethical nationalist have any kind of hostility towards the nations of the world and their flavour of humanity, unless they are violent. The flavour can be based on almost anything.\n\nInterventionism is imperialistic, expansionistic, violent, unethical and evil.\n\nIsolationism makes no sense, as any rational human knows that trade is important for economy and nationalists as other people want a good economy. But, trade of goods and services, not humans. No human trafficking, no picking up the slack of other non-functioning nations overproduction of people.\n\nIf people flee a nation, it is because that nation does not function and to take in all the people fleeing allows for that nation to continue to overproduce. Better let the people of that nation handle it themselves. Taking in very well functioning people from that other nation that has qualities and skills needed is rational. And when helping those who flee, help them close to their home, so they can change the fate of their home.\n\nI have borrowed a longer quotation:\n\n“The assumption embedded in the question is not that logic.\n\nI am American (by choice, but that is irrelevant). I am also a nationalist.\n\nThe French have better food and arts.\n\nThe British have stronger character and better sense of humor.\n\nThe Germans are better at discipline and self-ogranization and have terrific engineers.\n\nThe Bulgarians make the best meatballs and the Swiss make the best watches.\n\nI can easily recognize those facts. I am an American nationalist because I want better American food, American arts, stronger American character, better discipline, etc.\n\nI apply the same logic to nationalists of every nation. Improve the country you live in. Let others improve theirs. That is the logic of nationalism.”\n\n---------\n\nNationalism has absolutely nothing to do with fascism. ZERO!\n\nNationalism is an idea that rests on the metaphysical fact that people with more values in common will go along easier.\n\nIt starts with the family. Two people that have similar values bond and live together. They have children and raise them in the parents values and under one roof. That family lives in this house and in the next house is another, similar family.\n\nThe first family knows that its values are better for them than the other familys values. The other family knows that its values are better for them then the first familys values. Both families respect that the other family have different values, because the two different set of values are not so far apart. As long as the families values are not too far apart, they will respect each others differences.\n\nWe do us, you do you.\n\nNow you extend this rational way for humans to live peacefully to the village, the city, the greater area, the state, the country and the continents of the world.\n\nHumans needs borders between them on all levels, and the bigger the value-differences, the bigger and more airtight the borders needs to be.\n\nGuests are welcome as long as they behave and then they go home in the evening. A countrys borders are its normal protection against the surroundings, exactly like the walls of the familys house.\n\nNationalism is a rational and moral idea on all levels.\n\nDo you seriously believe that your neighbours culture and values are better than yours? In that case, you should go to him and have him teach you how to think. Even if his culture and values ARE better than yours - that you are a bit more ignorant than him - have you ever heard of familys asking their neighbours to teach them how to live and think?\n\nNationalism claims that its values and culture are better for the ones living in that house/country than it is for other people living in other house/countries. Do you believe differently?\n\nNazis were narcissistic, psychopathic, chauvinistic racists, has NOTHING to do with nationalism. Nationalism is not about inferior people, but about inferior ideas, values, culture.\n\nAgain, do you believe that your own ideas, values and culture is inferior to your neighbours? Should you maybe live exactly like him? Copy him in every way?\n\nDo you invade your neighbours home? Nazis would do that. Nationalists respect their neighbours, like they want to be respected themselves.\n\nYes, nazis said that their race was superior. It has nothing to do with protecting your family, country, values and ethics and has everything to do with racism. See the difference?\n\nNationalism is about the positive idea of building something - a family, a home, a town, a city, a nation, a culture, ethics, what your country is good at and then protecting and cherishing it and supporting other people and cultures around the world to do the same and think the same.\n\nNationalism is simply taking care of your house, like your neighbour takes care of his. Two families - two different cultures. Always nice with a visit, but please go home in the evening.\n\nSometimes - two different cultures - a man and a woman decides to try to live under one roof. Sometimes they manage, sometimes they dont. People try and try and some people are lucky enough to actually find another person in ones life that one can live with an entire life. It is more the exception than the rule that some person you date is possible to share your entire life with.\n\nTHAT is the statistics of successfully melting two different cultures into one.\n\nNationalism is the right to decide for yourself in your own culture - be it on an individual level or a national level. It is logical on all levels to separate those cultures that can not live together under “one roof”.\n\nNationalism is multiculturalisms diametrical opposite. Multiculturalism is evil, unethical and soon dead. We tried it, it failed terribly and soon its dead and buried. It’s the equivalence of sharing the bedrooms and livingrooms and toilets and kitchen with you former neighbour – now living in a common house – everyone together with different values, culture and thinking. He never picks up his dirty underwear from the bathroom floor and you maybe will just love the whole situation? I don’t think so. You just don’t understand what nationalism is about – what is its essential. Its essential is that people alike plays better with people alike and they happily exchange all sorts of stuff with their neighbouring countries. Migration is there, but only as far as it is needed and works perfectly.\n\nOther answers to nationalism. I didnt bother to separate those opposed to it from us nationalists.\n\nWhat is the logic behind nationalism? Why should your country be better than others?\nhttps://www.quora.com/What-is-the-logic-behind-nationalism-Why-should-your-country-be-better-than-others?q=What%20is%20the%20logic%20behind%20nationalism%3F",
        "code": 3,
        "wordCount": 1073
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Mark Pace",
        "title": "Why do white Americans believe they can come here and claim to have rights to stolen land and feel they can determine who and who is not Illegal, I’m a native Mexican, an Aztec descendant my family has been here for thousands of years long before Columbus arrived here we’ve have migrated here on our land for thousands of years, so tell me who are you to decide who is an immigrant and who is not?",
        "text": "Simple. It is called the RIGHT OF CONQUEST. Your “honorable\" people didn't just “migrate” here - they took the land, BY FORCE, from Toltecs and Toltecs had wiped out the previous owners, so don't be presenting yourself and your bloodthirsty ancestors as some innocent holy lambs. You think this land is yours and want it back? Well — COME AND TAKE IT! Let's see how well that will work out for you…",
        "code": 3,
        "wordCount": 72
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Nick Cardone",
        "title": "Isn’t it funny how news organizations and politicians label everyone racists and white supremacists? This didn’t exist a decade ago.",
        "text": "That’s what sells papers as they say. It’s all about the money or better yet what grabs headlines. A decade ago people didn’t look at things the way there conditioned to now.",
        "code": 3,
        "wordCount": 32
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Jerry Gilliland",
        "title": "Do you Think Reparations are the only way to fix racial tension between Whites and Blacks?",
        "text": "No Black's alive today in the USA was ever a slave. News flash every race has had themselves as a slave in one form or another. Under this same way of thinking, My mother was assoulted by a black man. So does that mean every black person has to pay for that? No because it's beyond stupid to think your owed somthing that happened to sombody else whom you nevet knew.",
        "code": 3,
        "wordCount": 71
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Terri Cam",
        "title": "Do people really think white privilege doesn't exist when black US families have 10% of the wealth of what white families do? Or do they think that black people are just 9 times as lazy or something, with no proof?",
        "text": "No one thinks black people are lazy. Black people make up about 20 percent of the population so having less wealthy black people compared to whites which are the majority makes sense. It's not about being lazy. Black people have just as much opportunity in the world to gain wealth as anyone else.",
        "code": 3,
        "wordCount": 53
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Kyle Stauffer",
        "title": "Is the Darrell Brooks verdict compared to the Kyle Rittenhouse verdict proof of our two-tiered justice system heavily in favor of white people?",
        "text": "LoL…yeah Darrell was using his Ford Escape to defend himself from all the parade goers throwing themselves at him and trying to harm him…yeah, no difference in the cases at all…",
        "code": 3,
        "wordCount": 31
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "John Bishop",
        "title": "Is the Darrell Brooks verdict compared to the Kyle Rittenhouse verdict proof of our two-tiered justice system heavily in favor of white people?",
        "text": "No, Kyle Rittenhouse had no intention to kill people that night he had only acted in self-defense to protect himself from being killed as shown on video.\n\nKyle Rittenhouse is identified as being Hispanic.\n\nBoth incidents where Kyle Rittenhouse shot those 3 people were when they are chasing and about to violently attack him putting his life under threat, One of those who attacked Kyle Rittenhouse had a handgun in his hand when he was shot in the hand.\n\nOne of the 2 Men who Kyle Rittenhouse had fatally shot in self-defense had hit Kyle with a skateboard.\n\nAlso 1 of the 2 Men that Kyle Rittenhouse had fatally shot was a convicted sex offender.\n\nThe guy who was shot in the hand had survived his injuries the other 2 people Kyle Rittenhouse had shot died from their injuries.\n\nDarrell Brooks had clear intention to kill White people as he intentionally drove into a crowd of people during a parade, People also looked up his past with a lot of Pro-BLM posts that he made and also posts where he expressed hatred towards White People.\n\nAccused killer Waukesha parade driver posted toxic anti-white rhetoric\nAccused killer Waukesha parade driver posted toxic anti-white rhetoric | Toronto Sun\nhttps://torontosun.com/news/world/accused-killer-waukesha-parade-driver-posted-toxic-anti-white-rhetoric",
        "code": 3,
        "wordCount": 198
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "John Lane",
        "title": "Does the phrase “all lives matter” upset people?",
        "text": "I hope it does. Because all lives matter ,it dose not matter wot life it is .",
        "code": 3,
        "wordCount": 17
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Brad Miller",
        "title": "Why do Black students get admitted to Harvard at much higher rates than other students? Are Black people just better at schooling than others?",
        "text": "Actually, based on standardized testing, black students in America are the worst students, as a class.\n\nThey get into Harvard because Harvard has an openly racist quota system, that lets in half of the Asian students who qualify, twice the Hispanic, three times the black, and less than 80% of the white students.",
        "code": 3,
        "wordCount": 52
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Sam",
        "title": "Is the Darrell Brooks verdict compared to the Kyle Rittenhouse verdict proof of our two-tiered justice system heavily in favor of white people?",
        "text": "The concept of self-defense does not marry with wiping out innocent people who were not a threat. Its that simple.",
        "code": 3,
        "wordCount": 20
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Ithamar Paraguassu Ramos",
        "title": "Why do black people believe that white people enslaved their ancestors?",
        "text": "Because they literally teach this in some schools.\nI saw videos in youtube from people that discovers that slaveru existed in Africa before America even existed.\neven that is in the bible that 500 years ago there was slavery in the whole abcient world.",
        "code": 3,
        "wordCount": 42
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "This Is",
        "title": "Do you think any black person in this century has any justifiable anger towards white people to lay blame on what some people did to their ancestors two centuries ago?",
        "text": "No. However, whites have plenty of justifiable anger against blacks for the behavior of modern-day blacks.",
        "code": 3,
        "wordCount": 16
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Sindre Rudshaug",
        "title": "Are white people a threat to the new world order?",
        "text": "The New World Order/One World Government/The Great Reset is a mostly white, aristocratic idea, established by evil people like the nazi lovechild Klaus Schwab and his maffia organization The World Economic Forum.\n\nThe huge number of people and businesses(1000+) who partners up with the anti-human ideas of the WEF are the richest and most powerful in the world, mostly white people, but its not about race or ethnicity for them.\n\nPoliticians and crony-capitalists in the worlds biggest and most successful businesses have been feeding off of the producers like parasites for decades. Their ethics is the ethics of parasitism.\n\nWe humans are a problem for these parasites, because we want some degree of autonomy. Our autonomy is interfering with their schemes.\n\nThe human goal is to live in peace, be happy and content.\n\nThe goal of the parasites is to have 100% control of all producers/humans, deciding absolutely everything and anything in our lives.\n\nIf we shall be allowed to live, where to live, what to work with, if we are allowed to procriate, etc. Klaus Schwabs nazi past tells us what kind of control they want over us. The facist/nazi total control.\n\nThere exists no better concept to describe their Utopian vision than “aristocracy”.\n\nIn aristocrat times, working humans were as valuable to their aristocrat masters as the chickens to the farmer. The farmer will kill of if he has too many, and produce more if he wants more. He will feed them with whatever is cheapest, like insects.\n\nThe chickens will live their lives at the mercy of the farmer and solely after his interests.\n\nIn the WEF longterm vision, all humans will live like these chickens.\n\nThe only way to make happy people submit to and live under such levels of evil is to make them all hate each other, lose all human values and culture and fight to the death. Desimate them to they beg to be put in chains and be cared for.\n\nThe chaos we see around us today is instigated by these evil forces. Their solution will be to move power from the possible nationalist nations to international, non-elected authorities that humans will not be able to go against and unelect.\n\nSkynet could produce most stuff themselves, so they immediately sought the destruction of humanity.\n\nThe New Aristocracy, if we can call it that, wants to use humans as the great producers they are, just like in their good old days. They just need to control us.\n\nNow, color.\n\nThe people promoting this idea today are white people, but as mentioned, they care only about money, power, fame and sex, not color/race/ethnicity. The world outside of the west is not on the suicidal path like the west. The promotion of hate and racism against white people on the top are just playing into the hands of the marxists, who will be chained up right next to us.\n\nWe can clearly see that the white west is pro One World Government/Unipolarity and the rest of the world is pro Multipolarity, true diversity, nationalist states, etc.\n\nBecause of great ignorance, the majority of humans in the west are pro WEF. Just like sheep and humans, also politicians follow the stream like dead fish - those who are not in cahoots with WEF.\n\nOnly some eastern european countries and of course Russia is not on the white suicide train. Which is of course not about white suicide for the aristocracy, but about great chaos and infighting between former allies.\n\nI am sorry for all those people who believe everything in this world is about good white people and evil non-whites.\n\nIn this matter, the evil ideas comes from white people, but of course not from “white” ethics or culture. We left the aristocracy behind a long time ago, but the rich and powerful western elite wants it back.",
        "code": 3,
        "wordCount": 621
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "D. G.",
        "title": "Do you Think Reparations are the only way to fix racial tension between Whites and Blacks?",
        "text": "First fact, slavery in any form is wrong. 2nd fact slavery has been around since man started walking. Even God tolerated it, not condoned, and required those worshiping him to treat slaves in a moral manner. Slavery is as alive today as it was 1000 years ago. Even in the United States slavery still exist. One eastern state just passed a law to abolish it where another decided to keep slavery legal, in The U.S. All most all states allow inmates to be used as slave labor, legally. Now you have a single group that wants to make the entire issues about themselves, for something that happen to someone they didn't know by someone they didn't know. How is that going to erase 5000 years of a sad practice and make all things good sgain? O yes it was your long distant relative. Well OK, there are 3.5 million Americans who have lost close, as well as long distant relatives to mandatory draft to fight wars there didn't want to go to, with out any choice. How much should we get for and act to someone we didn't know by som we didn't know. You can't compensate for the past and make it fair. Unless that compensation go directly to the victim. I know people want revenge for an act that no one alive today or for the past 150 years had anything to do with. It won't work, then they will become even more angry and want more and more. They are trying to build happiness on a pass history that can never be erased, it will alway be there. In fact it will become a rallying point for more hate from extreme people who want to set things back 150 year. And that is all we need is more of extremist fuel on the fire.",
        "code": 3,
        "wordCount": 307
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Rose Denehy",
        "title": "Is white supremacy really black inferiority?",
        "text": "I can only answer from what I’ve learned of the term “white supremacy” over my 60+ years of life. The problem is that definitions have been changing, especially recently and especially when it involves race.\n\nMy understanding is that it means that the white race (however that is defined) is better than any other race, so I don’t think it could be called “black inferiority.”\n\nI suppose it really depends on a person’s actual beliefs. Images I’ve seen show the white race as blond blue eyed people - that’s a specific northern European race or ethnic group, as far as I know. That would exclude me. Others might define the white race as dark haired, dark eyed people with white skin. That might be a southern European race or ethnic group. Then there are probably some that don’t separate white people by physical characteristics except for skin color.\n\nA quick google search will show the definition sometimes adds that the white supremacist believes that their version of the white race should have control over any other races. I think that is a more modern addition but I’m not a linguist and couldn’t say for sure.\n\nSo to answer the question: it depends on an individual’s beliefs. Some people might agree with your proposition. I don’t know anyone that is a white supremacist to even ask them the question. I don’t believe that any one race or ethnic group is better than any other, however from observation it seems that black men can run better than white men since they win in competition more often. I’m sure there are other examples like this but a single factor wouldn’t make any race any better.",
        "code": 3,
        "wordCount": 278
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Teri Sundell",
        "title": "What do you think of the fact that White Americans voted overwhelmingly for Republicans in the midterms, while all groups of non-White Americans voted overwhelmingly for Dems? Are Republicans officially the White Party and Dems the non-White Party?",
        "text": "No. Democrats have plenty of white idiots in charge and all the college professors teaching their communism to impressionable young minds. They are all angry victims of some sort- and they blame the Republicans for all their troubles. The Republicans have plenty of minorities supporting the party. They are silenced and even called traitors to their race, which is weird because race isn’t a political party- although the Democrats want to make it out to be.",
        "code": 3,
        "wordCount": 76
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Travis Earl",
        "title": "Do you feel that television media is trying to shove racial mixing and racial diversity down your throat?",
        "text": "Through subtle messaging in movies you find in film providers like Netflix and Apple TV, governments showing mixed families in its advertisements(amplified since the Biden regime came to power) and in general TV advertisers almost completely banishing White males and showing (mostly) only White females with a yellow mestizo or black, it is absolute fact that the industry is among many that is part of the enemy anti-White system systematically disappearing any positive healthy Whiteness. Our children (like those of the past) will be raised to believe race mixing is the absolute trend (now going full throttle) that must be done in order to gain artificial validation, there is no need to force it with the sword when propaganda works just as well.\n\nMost of our people, sadly hypnotized since birth, will likely deny this reality so do not be discouraged if they try to make you feel guilty for noticing.",
        "code": 3,
        "wordCount": 150
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Brad Miller",
        "title": "Who is likely to be wrong, white people who state they are not all white supremacists or black people who claim that all whites are supremacists?",
        "text": "Well, since the white person knows if they are a supremacist or not, and the black person cannot know if every white person is a supremacist — the BLACK is completely wrong.",
        "code": 3,
        "wordCount": 32
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Bart Vance",
        "title": "Why do white Americans believe they can come here and claim to have rights to stolen land and feel they can determine who and who is not Illegal, I’m a native Mexican, an Aztec descendant my family has been here for thousands of years long before Columbus arrived here we’ve have migrated here on our land for thousands of years, so tell me who are you to decide who is an immigrant and who is not?",
        "text": "History 101\n\nIndians others peoples of the Americas are immigrants too, who traveled across a land bridge from Asia.\n\nMost spent the thousands of years following this migration killing each other. Various Indian oral histories told us of hundreds of tribes that were wiped out, long before a pale-face ever arrived.\n\nThe Aztecs were probably the most barbaric, militaristic empire in recorded history.\n\nSome peaceful white settlers arrived on the eastern shores of America in 1020 AD, and the Indians slaughtered them all.\n\nThe next next set of immigrants who arrived were smarter and allied with oppressed and subjugated peoples of the Americas. These new immigrant allies helped defeat many current barbaric, tyrannical overlords.\n\nThis new immigrants from Europe, through better technology, diplomacy, trade skills, resistance to diseases, watching long-time immigrants make war on each other and advanced warfare skills, became the dominant immigrants in North America.\n\nSpecifically, your ancestors lost any right to any land now residing the the USA after losing multiple wars of aggression against Texas and The United States.\n\nYou have zero ground to stand on and make such outlandish and erroneous claims.",
        "code": 3,
        "wordCount": 179
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Barry Weir",
        "title": "Why are there black main characters in the show Vikings?",
        "text": "Original question: Why are there black main characters in the show Vikings?\n\nFor the same reason it would be prudent to cast Mel Gibson as Shaka and to have the Zulu nation populated by Koreans. Hell, who wouldn’t love that one?\n\nI’m sure that folks would love Dan Aykroyd as Martin Luther King, eh?\n\nHow about Antonio Banderas as George Washington?\n\nHere’s a good Spanish lesson: being opposed to that we call: hipocresía. Cognates are a great way to learn a language. You may be aware of a similar word in English.\n\nWhen some very, very clever person starts a production company to do just that kind of production, the loonies might just come to their senses; doubtful, but possible.",
        "code": 3,
        "wordCount": 115
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "John Tibbott",
        "title": "Why does white supremacist admire Russia? While maximum Russians are anti Racist",
        "text": "?😐",
        "code": 3,
        "wordCount": 1
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Tom Williams",
        "title": "In what ways do the minorities in the nation feel that being white is a privilege?",
        "text": "It’s just a “cop-out”, a way to assuage the guilt of not having succeeded as well as someone else. It’s human nature. If someone does better than us, we first look for excuses so as not to put the blame where it belongs; the person in the mirror.\n\nAnd now, we have a government pushing this bogus narrative in a bid to garner political support. We have an entire mob of mostly old, white people in government who themselves are the products of wealth and privilege, telling all the “other” white people in the country that they “owe” something because of the businesses they built, the wealth they’ve created for themselves and their families and the society that exists solely because of their efforts.\n\n“Social Justice” and “Social Equity” are euphemistic phrases for racism directed against white people for political benefit.",
        "code": 3,
        "wordCount": 139
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "This Is",
        "title": "Have whites become less racist?",
        "text": "Let’s see. We ended Jim Crow. We’ve allowed mestizos to immigrate en masse and replace us. We allow blacks to call the shots despite the fact they only make up a tiny minority. It appears we’re the least racist ethnic group ever.",
        "code": 3,
        "wordCount": 42
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Robert Uda, Ph.D.",
        "title": "Do people from Latin America call themselves Americans? How about people from Canada and Mexico?",
        "text": "The designation “American” has migrated primarily to the citizens of the United States of America (USA). People who live in Canada are known as Canadians. People who live in Mexico are known as Mexicans, Latinos, or Hispanics. “American” is a choice made by U.S. citizens. People from Canada and Mexico certainly have the right to call themselves Americans because Canadians live in North America and Mexicans live in Central America. The same goes for the peoples of South American (or Latin America). They too can call themselves Americans. However, some choose to call themselves Latin Americans, Hispanics, Latinos, or the designation of their own country, e.g., Brazilians, Peruvians, Nicaraguans, etc. It is all fine and okay as to what they want to call themselves.",
        "code": 3,
        "wordCount": 124
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "RaCOON",
        "title": "If white men are eliminated, who’d be next to go?",
        "text": "Once they eliminate Whites, they have already won. We will not let them destroy us and our people, so we will not have to think about that. Our people have never surrendered in the past and we sure as hell won’t surrender now. We see this decay of our morals. The destruction of the White race. Yet, here we stand tall.",
        "code": 3,
        "wordCount": 61
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Sam",
        "title": "I am a straight white male Why is it that I spent my whole life hating myself, for my character, when I was supposed to love myself, but now that I love myself I am supposed to hate myself for the color of my skin?",
        "text": "Because you act on “SUPPOSED” which means YOU believe that YOU must behave in a certain way according to others. There is no way whatsoever that you should behave in any way according to what others say or believe.\n\nYOU are creating the problem for yourself.\n\nI do not give a damn what others say or do. I live with the intention of treating people with respect and paying my way as a law-abiding person. Outside this, it is not the business of other people.\n\nI am NOT “SUPPOSED” to o anything. Neither do I “SUPPOSE” or impose my beliefs or chosen behavior upon others.",
        "code": 3,
        "wordCount": 102
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Jimmy",
        "title": "Do you believe Michelle Obama? Do white policemen shoot African-Americans every day?",
        "text": "Yes. They also shoot Caucasians, Asians, Hispanics, and all other races and ethnic groups. The reason I don’t constantly focus on my own race is because I’m not a racist.",
        "code": 3,
        "wordCount": 30
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Griz Ley",
        "title": "How are things like racism and sexism so common yet so stigmatised?",
        "text": "They are common because ingroup-outgroup dynamic they are generated from are an endemic evolutionary adaptation. That means if evolution accepted and enforced it, there must be good reason.\n\nThis “isms” add hate to the equation which again, is endemic to humans even if it is ugly.\n\nAnd I don’t know if “stigmatized” is the correct term. They’ve become downright “politically weaponized”! And the toxic Left has done this because tribal emotional terrorism is an accepted tactic of not just original Marxism, but postmodern neo-Marxism AND the more toxic aspects of femininity.",
        "code": 3,
        "wordCount": 89
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Jaisce Liier",
        "title": "Are you attracted to any non-whites? Or do you only find whites attractive?",
        "text": "Yes. In fact, i dont find many white people attractive at all.\n\nThe exception being Red heads. My first Girlfriend was black. My vmVcard was handed over to a black woman. I also dated hispanics, asians, and Native women. I have had a few whote girlfriends, but they arent the majority.\n\nMy first son, is apache. Then again, by all of these people i have been rold that i was “not just white\". So chances are, I am mixed myself. I never met my father, and I cant seem to get a straight answer about who he was, or what he did. In fact, the ONLY info i have on him, is that he was last seen watching my mother as she was in delivery, and mysteriously vanishing forever after that.\n\nHell, we dont even know what his NAME is.\n\nI am almost entirely convinced I was never born at all, but grown. Given my eyes, extra ribs, larger than most lungs, apathetic tendencies, insane sense of smell, and what uses to be near superhuman hearing.\n\nBut i digress.\n\nYes, i am attracted to other skin tones.",
        "code": 3,
        "wordCount": 181
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Abel Abayneh",
        "title": "Why do White Nationalists who want a White Ethnostate have very non interventionist and/or isolationist foreign policy views?",
        "text": "Every far right party is anti internationalism or globalization because of opposition to to movement of people, idea and good which they see as subversive to the ethnocentric ideology. So it is outcome of the Nationalist ideology that made them isolationist.",
        "code": 3,
        "wordCount": 41
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Jessy Marie",
        "title": "Why do Democrats, leftists, and liberals etc. insist there is no such thing as affirmative action, when the U.S. government (the world's largest employer) practices affirmative action? --> https://www.dol.gov/general/topic/hiring/affirmativeact",
        "text": "OUR government now? Seriously? Affirmative Action? Do you even know the definition of Affirmative action? You tell me how in the fk this administraTrtion is practicing Affirmative Action… I'll wait… Try Reverse Discrimination",
        "code": 3,
        "wordCount": 33
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Griz Ley",
        "title": "As a White person, what is your opinion about the concept of \"White Fragility\"?",
        "text": "It’s a pure gaslight coming out of the toxic feminine. I’ll expand on that so you don’t think it’s just an exercise in juvenile psychology.\n\nWe’ll start with what most moderately-informed people would identify as the toxic masculine. Most should know what this is because it’s another gaslight that Feminism has used to shame and hit men and even schoolboys over the head with for the past 40 years. It happens when something “malfunctions” in the masculine and the great physical strength that is suppose to be used to protect the family structure and society structure starts preying upon it instead.\n\nFemininity doesn’t manifest physical strength to match that of the masculine (statistically speaking), but in psychological strength that has evolved to nurture and stabilize the family unit and draw the absolute best out of loved ones. It happens when something “malfunctions” in the feminine and the psychological strength morphs into gaslighting, character and relationship sabotage, and a weaponizing of the emotions to prey upon the mate and family structure it is suppose to be nurturing. We then also see an “escape” of this toxic feminine dynamic out of the family arena into the social, medical and even political arenas.\n\nThe idea of “white fragility” has come out of a branch of postmodern neo-Marxism ideology that is very populated by women seeking a form of psychological dominance to rival the physical dominance that they loathe in men but at the same time, are envious of.\n\nThe idea of gaslighting is the weaponizing of what author James Redfield (The Celestine Prophecy) coined as the “Poor Me” Control Drama to imagine the worst or weakest a person (usually a loved one) could be and then progressively finding and manufacturing ways to psychologically poke and hit them over the head with it. They’ll accuse a mate for example of just wanting to hit them every time there is a fight they cannot resolve. Most men will just say “whatever” and go their way. But months and years of this add up and start to have a psychological effect and as frustration builds they actually start considering giving their mate the slap or punch they keep being accused of wanting to deliver. (“If that’s what she thinks of me despite my holding it back, I’ll give her a real demonstration”) And then when they finally do commit physical assault to some degree or other, it’s latched onto as “the proof” that the man was really an “evil oppressor” all along and the woman just “a saintly victim” — even though SHE’s the one who conjured this anomalous behavior up out of dark psychological manipulation. This is then used to exclude the man from the family through the judicial system . . . at which point any remaining toxicity will be directed at or channeled through the children.\n\n(I would also insert the caveat that while toxic feminine gaslighting can and does spark what are normally uncharacteristic outbursts of toxic masculinity from a targeted mate for the intent of removing them from the family equation, there are far too many men out there who are just toxic masculine of their own accord — who DO need to be justly removed from the family arena. There is a HUGE difference still between men accepting the harsh reality of toxic masculinity, and women accepting the harsh reality of toxic femininity.)\n\nWhite Fragility is the same gaslighting process — though it is bizarrely twisted through postmodern neo-Marxism to be MOSTLY accused on whites . . . by white highly-educated liberal women! That’s an observation that is so apparent most of you can find your own evidence of it in SJW activism.\n\nBut the twisting through the neo-Marxist ideology is a more esoteric discussion. It has to do with the feminine experience of caring for “helpless babies” not being NEARLY the exercise Evolution primed women to do, particularly since the advent of medical science, plunging infant mortality rates, the industrial revolution, safer more civil societies and finally, the sexual revolution triggered to large degree by large dosing of women with artificial estrogen via the Birth Control Pill.\n\nAgain, it’s a far more esoteric discussion but would be pleased to get into it with anyone interested.\n\nAnd I would predict we could see some toxic feminine attacks on this answer, seeking to get it censored, banned or blocked by Quora management instead of discussing points of it they disagree with or just using their personal block feature. I would suggest that doing so would actually be a form of corroboration of this toxic feminine process of “sabotaging” surreptitiously.",
        "code": 3,
        "wordCount": 759
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "James Fineron",
        "title": "Can an American citizen born in Egypt check the box \"African American\"?",
        "text": "Egyptians are not African-American. They are Arabs, and you know it.",
        "code": 3,
        "wordCount": 11
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "CrystalLake",
        "title": "As a white person has your life become better or worse because of diversity and multiculturalism?",
        "text": "I'm biracial and grew up in a very multicultural area. 50 years ago, multiculturalism was great. People came here, learnt english, got jobs and assimilated. They didn't ask for special rights, they accepted responsibility for their actions and most worked hard instead of living on welfare.\n\nWe enjoyed their hospitality and got to know many different cultures. It was great.\n\nFast forward to today and some cultures and beliefs are destroying this country. Some people are blushers who want a government housing, a pension and all the benefits we enjoy in Australia.\n\nThese days, a lot of people who come to Australia and demand special rights and when they don't get their own way, they scream racism. It's not all of them but the ones who do leave a very sour taste in my mouth.",
        "code": 3,
        "wordCount": 132
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Shaun Ryan",
        "title": "How do white men feel when they see beautiful blonde white women with black men?",
        "text": "The same thing I feel when I see white men with black women, nothing. I mind my own business, just like everyone else should.",
        "code": 3,
        "wordCount": 24
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Ithamar Paraguassu Ramos",
        "title": "Do people really think white privilege doesn't exist when black US families have 10% of the wealth of what white families do? Or do they think that black people are just 9 times as lazy or something, with no proof?",
        "text": "In 1954 a documentary it was made to teach the importance of Black people and how they are prosperous and commercialy important.\n\nThat are the informations in 1954 when America was considerated much more racist than today.\n\nSorry but the ones responsible for the actual situation it was the so called Hood mentality. that wasnt so bad today as when Fat Albert adressed the problem in the 70s.\n\nThis shows the problem of the hood mentality, not white privilege,",
        "code": 3,
        "wordCount": 76
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Buddy Eidobon",
        "title": "Why are white countries more willing to accept poor African immigrants instead of helping African countries develop by trading with them like how China is doing?",
        "text": "Neanderthals are anthropologically evidenced to have a higher degree of empathy than Sapiens. Guess which haplogroup has the highest concentration of Neanderthal genes.\n\nUnfortunately, Neaderthals are a little less clever, as they are also less greedy. Thus, all of the ruling Europeans responsible for the most haneous crimes in history, are likely void of Neanderthal DNA.\n\nOh, and China is not the gentle giant they pretend to be. They are notorious supremesists and are trying to enslave Africa through infrastructure debt. They will soon be flooding Africa and invading the gene pool after all the bullet trains are built.",
        "code": 3,
        "wordCount": 97
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Chris Futureman",
        "title": "Will some predominantly white countries in eastern Europe surpass the west which promotes diversity?",
        "text": "Western Europe is wealthier, more developed, and offers free healthcare, education, and housing, many migrants will choose it instead of Eastern Europe. For example Afghans in Albania are fleeing towards France and Africans arriving in Greece are fleeing towards UK.",
        "code": 3,
        "wordCount": 40
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "John Bishop",
        "title": "Are Arabs/Saracens to be considered \"white\"? The name Iran is derived from the word \"Aryan\" according to Wikipedia.",
        "text": "No, Arabs are brown people. While Iranians aren’t Arabs.\n\nGo look at Arabs in the Arabian Peninsula. The Emir of Qatar would blend in very easily in India.\n\nModern-day Saudi Arabians.",
        "code": 3,
        "wordCount": 29
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Stuart Beesley",
        "title": "Has race relationships improved since the woke culture and BLM started gaining more traction around the world?",
        "text": "You are taking the piss …. right?",
        "code": 3,
        "wordCount": 7
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Louis Smith",
        "title": "If white people had been slaves, would WLM be a thing right now?",
        "text": "White people were slaves, from the dawn of time to the 1800’s, but rather than being sold by our neighbours, were kidnapped by African raiding parties, and earlier by Romans, Arabs, Vikings, and many other tribes.\n\nWLM is not a thing, because we choose not to dwell on the past to justify our own shortcomings.",
        "code": 3,
        "wordCount": 54
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Samantha Robertson",
        "title": "As a white person has your life become better or worse because of diversity and multiculturalism?",
        "text": "Worse.",
        "code": 3,
        "wordCount": 1
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Amy",
        "title": "Why are there black main characters in the show Vikings?",
        "text": "Seeing a black woman as earl of kattagat in vikings: Valhalla made me sick. I read something a few years ago that said any shows after 2020 without blacks cast as positive main characters wouldn't be eligible to win awards. I wouldn't be surprised if that's the case. Of course to liberals it's OK for Europeans to be misrepresented and our kids to think there were black lords and ladies all over old Europe. But God forbid even a LIGHT black person play someone that was non white in history or a book. We need to start reminding our children that we ( whites ) are only 8% of the world population. Stop letting liberals shame your children.",
        "code": 3,
        "wordCount": 118
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Cailean MacConnich",
        "title": "What is the most racist Western European country?",
        "text": "Interestingly I answered a similar question, regarding which is/are the most racist cities in the UK.\n\nThe answers were London, Birmingham, Leeds, Leicester, Manchester. All cities with very high bame/poc whatever populations, that are extremely racist to the local white folk.\n\nI think the answer to this question is similar.\n\nAny country that has a high and ever increasing population of non whites is the one with the most racism. Just that the racism in question is directed at the indigenous populations by the millions of immigrants. Something most people tend to brush under the carpet.",
        "code": 3,
        "wordCount": 93
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Frank Roberts",
        "title": "Why is Lebron James so revered when his comments and tweets are full of racism, rants against whites, etc.? Yet he’s happy to take their money. Should we stop buying products he endorses? (Shoes, AT&T, etc.).",
        "text": "Would be great to boycott these phonies product endorsements - and I’ve often wondered why there wasn’t an investigation when “someone”graffitied the Nword on his fence.\n\nI’m sure the guy lives in a gated community where access to these homes are not easily accessible\n\nmaybe Jessie Smollet jr",
        "code": 3,
        "wordCount": 46
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Cailean MacConnich",
        "title": "Is it true that before European colonialism, Europe was an extremely dirty, backward, uncultured and poor continent and the only thing that made Europe rich and developed was the exploitation of resources from other continents?",
        "text": "Absolutely yes.\n\nUntil we dragged our primitive uncultured backsides to Africa/India, we were still living in mud huts and eating termites off sticks. Fortunately the wonderful Africans taught us how to build magnificent Building such as this:\n\nand create art like this:\n\nor this:\n\nThey taught us philosophy, science, architecture, art, music etc… and we uncultured backward Europeans will be forever grateful.",
        "code": 3,
        "wordCount": 58
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "John Tibbott",
        "title": "Who is likely to be wrong, white people who state they are not all white supremacists or black people who claim that all whites are supremacists?",
        "text": "Most likely are people who ask all these stupid questions with the words” racist” and “ supremacist s “ in them.",
        "code": 3,
        "wordCount": 21
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "The Friendly Fascist",
        "title": "As the USA becomes gradually more diverse, will the USA eventually breakdown into several countries based on race as racial nationalism and racial sentiments are extremely popular online?",
        "text": "No. People were certainly asking similar questions when the first waves of immigration kicked off. They were suspicious of Germans & Irishmen. However they gradually assimilated, & intermarried with other Americans, that's why the majority of Americans have a mixed European ancestry. When you ask an American about their heritage they'll say Irish, German, English, Scottish, & Welsh, usually in that very order. As time progresses I predict that history shall repeat itself once again & the newly arrived foreigners will gradually assimilate. What the Germans were 100 years ago are what the Mestizos are now.\n\nThis is the best case scenario but I'm not sure that's what will happen since German & Irish immigrants weren't nearly as passionate about their race & weren't encouraged to be different unlike today. I don't see a breakdown of the union happening due to racial tensions happening ever. But all I can do is predict.",
        "code": 3,
        "wordCount": 151
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Jules Ashley",
        "title": "Do black people get offended at the token black person in every TV advertisement?",
        "text": "This question is designed to offend people who watch t.v adverts!\n\nI dare you to watch t.v for 8 hours and do miss any t.v advertisements.\n\nHere are a few that feature all-black, or black males with white partners.\n\nAA Auto Recovery.\n\nCotswold (furniture)\n\nAsda\n\nNational Highways (They have blacked up and humanised insects)\n\nCoke\n\nVirgin Media\n\nCrown Paints\n\nCapital One\n\nBMW\n\nClear score.\n\nAfter that, I gave up counting. But I would estimate that these adverts made up 90% of the trial.",
        "code": 3,
        "wordCount": 70
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Ralph Seifert",
        "title": "How many of you have minority friends?",
        "text": "Whites make up about 8% of the population worldwide. So almost all my friends are minorities. I also have majority friends (Chinese and Indian).",
        "code": 3,
        "wordCount": 24
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Chris Baxter",
        "title": "How many of you have minority friends?",
        "text": "I HAVE SEVERAL BOTH BLACK AND HISPANIC",
        "code": 3,
        "wordCount": 7
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Barb411",
        "title": "Do you think that people who oppose the teaching of CRT are afraid that schools will teach white children that they will feel guilty and responsible for wrongs committed against black people?",
        "text": "T.H.E.O.R.Y.\n\nLook up the definition. Then study your history.\n\nStart with the slaves in the U.S.A. and in just about every other country did not free themselves. Ergo someone else did. Who? The ones the “theory” wants to blame for slavery in the first place.\n\nGo to this fact (not theory). Slavery is an ancient and ubiquitous institution. So where did it start and who started it against whom? How far back does systemic victim status go?\n\nAs to being responsible for “wrongs committed against black people”. Historically, blacks enslaved blacks and sold them to people all over the world—including other blacks. Listen to Thomas Sowell sometime.\n\nCurrently, the most numerous, heinous, destructive acts perpetrated against blacks are committed by—-blacks.\n\nYou’re not special when it comes to being enslaved or badly treated. Again with history, look at the treatment of the Irish, the Italians, the Jews—-all white, BTW, and treated so throughout the world.\n\nYour theory has no basis. Add schools are in existence for education, not indoctrination. CRT is indoctrination any way you want to look at it. It is also completely inaccurate.",
        "code": 3,
        "wordCount": 177
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "This Is",
        "title": "Can you imagine the world if white men were as racist TV depicts them?",
        "text": "Jim Crow would still exist. Native Americans wouldn’t be permitted to leave the reservation. And we never would have allowed millions of mestizo immigrants to come replace us.",
        "code": 3,
        "wordCount": 28
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "John Leite",
        "title": "Do you think illegal immigrants respect Americans once they come to the U.S.? Why or why not?",
        "text": "This would tell me that no, they don’t respect America or Americans. they just want the free stuff that democrats promisse them.",
        "code": 3,
        "wordCount": 22
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Kerry Jackson",
        "title": "Why do black people believe that white people enslaved their ancestors?",
        "text": "Because we did! And now it’s old news, and well past time for everyone to move on from it.",
        "code": 3,
        "wordCount": 19
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Chloe Donovan",
        "title": "Do you feel that television media is trying to shove racial mixing and racial diversity down your throat?",
        "text": "I don't feel it, I know it.\n\nUsing actual business letter paper (not just your regular printer paper but it's better than nothing) and matching envelopes, when you see yet another commercial that's racist, go to Wikipedia and get the name and address of the CEO.\n\nWrite him or her a cogent, brief letter explaining that you're not going to buy their products anymore due to their racist or offensive ads.\n\nYou'd be wrong to think that writing a letter means nothing. In fact, letter-writing campaigns were regular things not so long ago; laws and policies have absolutely been changed because of them—they work!\n\nMaybe I'll create a list of names and addresses for a whole bunch of companies that are engaged in propaganda and post it on my page.",
        "code": 3,
        "wordCount": 126
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Sindre Rudshaug",
        "title": "Has race relationships improved since the woke culture and BLM started gaining more traction around the world?",
        "text": "Woke is one marxist way of destroying culture and values, making hate grow between groups. Its not about improving anything at all. If anything, “race” relations are far worse than before.\n\nWoke is version 2.0 of the marxist plan to destroy the culture and values of the west. We were warned about version 1.0 by Yuri Bezmenov, who told us that the socialists/communists/marxists had concocted a plan on how to destroy the west from within: https://www.youtube.com/watch?v=QfvXwuZ-bok\n\nWoke is an open-ended, totalitarian view. Open-ended means it can be used to destroy any part of the culture or values it targets. It can be used against any group and to make groups hate each other. The method is ideological subversion of what is functioning, what is gluing society together, which is always, in addition to ethnicity, language and nation – culture and values.\n\nMost liberals/lefties/wokes are just useful idiots, who do not check thoroughly the content of the woke view or are too afraid to get cancelled, to resist. As we see, cancellation and ending freedom of speech is an important part of wokeism, as totalitarianism does not work well with opposition and where the free exchange of ideas are allowed.\n\nWoke is a total subversion of reason and ethics, two important parts of rational philosophy. Wokeness have a strong predisposition against the existence of objective reality, the scientific method, and personal autonomy. All subversive tactics against rational thinking on ideas like CRT, trans, racism, mass-immigration, whiteness, violent speech, etc does not work in a world where ideas can be tested against reality. All woke ideas fall dead when compared to statistics and observation of objective reality.\n\nOne could believe that the destruction of the value of protecting kids from being groomed and confused on their own sex and exposed to prostitute- and stripper clothed men pretending to be women - is a given for any parent, any politician, any teacher, any good person – that they will immediately recognize the evil in each woke attempt of destroying kids, as part of destroying rational, human values and ethics. One would be wrong, the marxist plan was brilliant, we were warned and did nothing about it. So woke got a foothold.\n\nThe first paragraphs of woke are: Victory at all cost – lie, cheat, rob and murder. Give nothing to the (capitalist) enemy. Destroy all their values – stuff evil down their throats, so they can not know right from wrong. Push hard, destroy your own who questions the ideology, never back down, always double down, as weakness can be seen as faulty. Totalitarianism is never wrong.",
        "code": 3,
        "wordCount": 428
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Stephen",
        "title": "What is the most racist Western European country?",
        "text": "There are no ‘racist’ European countries ….\n\nThere are only European countries that are trying to preserve their own country and culture … from an invasion of unwanted illegal immigrants … that somehow seem to think they have a ‘right ‘ to come here.\n\nWhich they dont , and it’s like peope seem to think got that they have á right ‘to come here and its time they got it through their heads …. that you don’t have ‘ a right to come here … especially as illegal immigrants and whoever convinced you that that bullshit is the truth … and as an illegal immigrant you can just go whereever you want ….. the are just telling you bullshit , most of you will end up in camps and detention cenrtres for yeras until we find what to do with them\n\nPlease just get that through your heads and ignore everything the people smugglers are telling you … because they will tell you anything just to get you money … but they are criminals that are just tellng you bullshit\n\nPlease start believing all of this .. because Europe is not the paradise they tell you that it is …. especially if you can’t speak the language .. and don’t have any skills …..\n\nSo whatever the people smugglers tell you that is anything different … they are talking shit … and they are only interested in taking your money,\n\nThats the way it is , so save the money you were going to pay them … and open a shop or business were you are from …. that’s probably a much better investment",
        "code": 3,
        "wordCount": 268
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Steven Stone",
        "title": "Is it racist to dislike twerking?",
        "text": "Only if you think twerking is exclusive to black people, or it is only wrong when black people do it which it objectively isn’t.\n\nSome times it is objectively awful when white people do it.\n\nSome times its objectively awful when green people do it.\n\nAnd as others have pointed out, it is an extremely sexualized action and probably shouldn’t be done in nearly as much childrens entertainment as it is.",
        "code": 3,
        "wordCount": 68
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "This Is",
        "title": "Do you think there will ever be white lives matter rioting?",
        "text": "We certainly have plenty of reason to. But will there will be WLM rioting? Probably not. Even Ted Cruz referred to White Lives Matter as a garbage group. BLM gets away with rioting because they have a lot of politicians on their side.",
        "code": 3,
        "wordCount": 43
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Eugene Mormon",
        "title": "When Angela Davis said \"In a racist society, it's not enough not to be racist. You have to be anti-racist.\" Did it include racism against whites?",
        "text": "She had no problem with it. She tolerated Whites as long as they were part of her imaginary communist utopian society she wanted, but Whites were “cannon fodder” and disposable and expendable persons to use and discard for her cause. I recall a former friend who was part of the old Weathermen who was acquainted with her, telling me that despite outward appearances, she was the same as any other racist Black person who hated Whites, especially if they did not conform to her concepts of what is correct.\n\nRemember, Angie Davis was an activist in the ‘60’s and ‘70’s, and helped to lay the foundation of today’s communists in government and media, whose long-term goals included complete transformation of the United States into a third-world cesspool under communist rule, who preached equality and justice but in essence identical to the evils of capitalism they supposedly fought against. She intended to be over the workers she supposedly fought for, like any other hypocritical communist would be living well while the common people picked through garbagecans and waited in long bread lines for food. We have examples today of politicians and celebrities who preach communism (under socialism, “social reform”, “democratic socialism”, and other ways to re-name communism and do the exact same things they harp against the “evil imperialist capitalist pigs” do).\n\nThe racism against Whites as all being “racists” and “oppressors” and “inferior” and worthy of extermination was downplayed in her day because they had not gained the momentum and numbers yet. Now that they do, it’s all out in the open. There is no need to hide or pretend they’re “American”. They can come right out and state openly that they’re communists and want to take over the country and replace freedom and prosperity with oppression and poverty. As long as they are in positions of power and are excluded.",
        "code": 3,
        "wordCount": 309
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Ism Schism",
        "title": "Do you think that people who oppose the teaching of CRT are afraid that schools will teach white children that they will feel guilty and responsible for wrongs committed against black people?",
        "text": "You might find it hard to believe that there were more white slaves in Africa that there were black slaves in america. Seems like reparations are coming out of the African pocket.",
        "code": 3,
        "wordCount": 32
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Craig Kopcho",
        "title": "Can an American citizen born in Egypt check the box \"African American\"?",
        "text": "I would. You are more African than Elizabeth Warren is Indian.",
        "code": 3,
        "wordCount": 11
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Saberattler",
        "title": "Why do Democrats, leftists, and liberals etc. insist there is no such thing as affirmative action, when the U.S. government (the world's largest employer) practices affirmative action? --> https://www.dol.gov/general/topic/hiring/affirmativeact",
        "text": "That is a very good question. It isn’t the Federal Government that hirs the handicapped (joe biden), but states, like Pennsylvania who just hired another mentally handicapper to make law over them.",
        "code": 3,
        "wordCount": 32
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Christopher Sellers",
        "title": "Do you believe Michelle Obama? Do white policemen shoot African-Americans every day?",
        "text": "I don’t know much about Michelle Obama. I thought that Barak Obama came across as a decent man. Unfortunately it seems that the police have a bit of catching up to do - if the statistics are true, they seem to be shooting more whites than blacks. Come on chaps play the game",
        "code": 3,
        "wordCount": 53
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Rhiannon Kojima (小島)",
        "title": "A suspect have just murdered your family. Does adding descriptive features [e.g. ethnicity and gender] of the suspect via comms. increase the chance for the police to locate the suspect quickly or is it racism to use racial descriptive words?",
        "text": "It's only racism when he's black, according to the narrative. When he's White or Asian, you can broadcast it everywhere, then it’s fine. But don't you dare say he was black, even if he was. It will get buried in the media as well, why would the media ever tell the truth.",
        "code": 3,
        "wordCount": 52
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Doug Bingham",
        "title": "Why do so many black neighborhoods have such high crime rates as compared to most white neighborhoods?",
        "text": "Culture.",
        "code": 3,
        "wordCount": 1
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Bee Leland",
        "title": "When Angela Davis said \"In a racist society, it's not enough not to be racist. You have to be anti-racist.\" Did it include racism against whites?",
        "text": "Angela Davis is a bigot as is Kendi … the most recent messenger of hate. They both favor discrimination against white people for their “imagined” grievances.\n\nThis is some of the “dribble” that passes as intelligence among the bigoted Anti-Racist crowd:\n\nThe only remedy to racist discrimination is antiracist discrimination. - Page 19\n\nAdmirers of Malcolm X still refuse to face: Black people can be racist toward White people. The only thing wrong with White people is when they embrace racist ideas and policies and then deny their ideas and policies are racist. Page 128\n\nTo be antiracist is to never mistake the antiracist hate of White racism for the racist hate of White people. - Page 129\n\nIn 2017, most White people identified anti - White discrimination as a serious problem. P129\n\nRacist Americans a century later framed supporters of affirmative action as “ hard - core racists of reverse discrimination, ” to quote former U.S. solicitor general Robert Bork in The Wall Street Journal in 1978. P130\n\nWhite racists define policies not rigged for White people as racist. Ideas not centering White lives are racist. P130\n\nBeleaguered White racists who can’t imagine their lives not being the focus of any movement respond to “Black Lives Matter” with “All Lives Matter.” - Page 130\n\nREFERENCE: Kendi, I.X. (2019). How to Be an Antiracist. New York: Random House Publishing Group. Kindle Edition.",
        "code": 3,
        "wordCount": 223
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "RaCOON",
        "title": "Why are White people not as tribal as other groups?",
        "text": "Because of all the propaganda which tells us not to.\n\nAll the White-guilt and White-shaming says that Whites aren’t allowed to be proud of their history, culture, and tribe. We have been taught ever since our earliest years in school that being “racist” is a bad thing and that any sort of Nationalism is bad. Nearly everyone, even the Fascists, have been brainwashed with this anti-tribalistic thinking. I’m usually a big -emphasis on big- supporter of Fascists too, but even they tend to be very blue-pilled and brainwashed at times. They just can’t seem to recognize the NECESSARY component of tribe in a healthy nation. When racial homogeneity is higher, a society tends to be more in unision and crime is exponentially less! The more “diversity” there is, the more death and destruction there tends to be, but everyone will turn a blind eye to it. We did not “evolve” to hate tribalism. Tribalism is completely Natural and has been the Natural order of things ever since the dawn of time. The only reason people hate tribalism is because they have been brainwashed into hating themselves and their people. The most tribalistic people (you know who) tend to be the ones pushing hatred towards tribalism. They know that the more tribalistic a people get, the more unified and happier they are. Once that people becomes tribalistic, they know it spells the death for their tribe. They fear the rise of White Tribalism, which is why they push racial-mixing and White guilt.",
        "code": 3,
        "wordCount": 250
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Thomas Franz Bernhard",
        "title": "Why do white Americans believe they can come here and claim to have rights to stolen land and feel they can determine who and who is not Illegal, I’m a native Mexican, an Aztec descendant my family has been here for thousands of years long before Columbus arrived here we’ve have migrated here on our land for thousands of years, so tell me who are you to decide who is an immigrant and who is not?",
        "text": "Haha so the tables have turned. Sucks, right? A bunch of strangers flooding your country and so on.",
        "code": 3,
        "wordCount": 18
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Ricky Tack",
        "title": "Can an American citizen born in Egypt check the box \"African American\"?",
        "text": "There are no “African Americans”: there are Africans, and there are Americans.",
        "code": 3,
        "wordCount": 12
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Eric Horrobin",
        "title": "Do you think there will ever be white lives matter rioting?",
        "text": "Yes most likely, but in the future when the self-loathing whites have surrendered all power to show their virtue and they have elevated every other race BIPOC and thus diminished the white race to a people racing govt hand outs just to survive and we become bitter and angry because we have no rights at all. You notice hom so called minorities are given rights entrenched in law. Whites font have that, it's assumed that we don't need it. However as self flagulate in the name of social justice to again show our virtue. Then we shall no doubt begin to try to regain what we willingly gave away.",
        "code": 3,
        "wordCount": 109
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Formless One",
        "title": "Did slavery only exist in Western civilizations or did it also occur in African, pre-Columbian and Asian civilizations?",
        "text": "Slavery has existed everywhere",
        "code": 3,
        "wordCount": 4
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Chloe Donovan",
        "title": "Why are White people not as tribal as other groups?",
        "text": "Since when? If you'll recall, WWI largely was one white nation fighting another white nation. Ever hear of the Hatfields and the McCoys?",
        "code": 3,
        "wordCount": 23
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Will Richards",
        "title": "Is white supremacy really black inferiority?",
        "text": "I believe 'white supremacy’ is no more than another invention of the hateful and intolerant modern left, determined to create division in any form, in to he hitherto stable West. There will undoubtedly be an element of resentment by groups whose own achievements are negligible or non existent, but I believe this is manipulated by the political left, to ensure racial and social division, so eagerly acted upon by the ignorant and hateful of groups like BLM and the masked leftist fascists of .antifa.",
        "code": 3,
        "wordCount": 84
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Sean Casey",
        "title": "What is the most racist Western European country?",
        "text": "I'd have to go with France, possibly Germany. They both have large populations of non White Muslims that are very racist.",
        "code": 3,
        "wordCount": 21
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "This Is",
        "title": "Do you think that people who oppose the teaching of CRT are afraid that schools will teach white children that they will feel guilty and responsible for wrongs committed against black people?",
        "text": "Yeah, that’s exactly why. We don’t need whites who were born well after Jim Crow to be blamed for stuff they had no part in.\n\nAs for slavery, no one alive today was around during slavery.\n\nEven for the living whites who were born before Jim Crow were abolished, their generation was the one to end Jim Crow (Or they were too young to hold any power during Jim Crow. Example: A white person born in 1959). So they don’t deserve blame either.\n\nWe also don’t like how CRT will brainwash minorities into hating whites (and acting on the hatred)",
        "code": 3,
        "wordCount": 97
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Aleitha Gray",
        "title": "Isn’t it funny how news organizations and politicians label everyone racists and white supremacists? This didn’t exist a decade ago.",
        "text": "It's worse now than when segregation of schools began in the 70’s….. So much more hate spread now. I truly think Obama lit the flame.",
        "code": 3,
        "wordCount": 25
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Dan Ford",
        "title": "I love Europe and European culture, but I hear (mainly from communists and Marxists) Europe is only rich and developed 'cause stole resources from other continents and who defend the opposite are Eurocentric and have not studied history.Is it true?",
        "text": "Netherlands here. And i would say it is parially true. The reason is that European countries managed to go arround the world and make colonies, and steal resources as you put it was only possible because they already were rich and developed. If you look at history you will quickly see that Europe was a hotbed off wars since the start. This meant that there often were races to make better ships, better weapons, even better medicine and so on compared to a Nation that didn’t have any or many dangerous neighbours. And if you have wars, you need income. So many tried to be good traders too.\n\nSure it is true that many (probably all) of the nations that traveled the globe often dealt with others and most often this was to the benefit of the traders. (otherwise no trade) But you should also realise that this trade, and the colonisation of countries also “exported” the riches and developement that was in Europe to the area’s they traded with or colonized.\n\nSo actually it went both ways. And it was mainly done by trade. You can steal someones resources maybe a few times. But that will cost you in manpower ,weapons and so on. Meanwhile if you traded, both parties were happy. And this meant you could keep trading and earning.\n\nFor communists and Marxist. The nations they live in also did the same before they became communist or Marxist. And still do this.",
        "code": 3,
        "wordCount": 242
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Vince Ballou",
        "title": "Why does it feel increasingly wrong to be a white person?",
        "text": "You're not wrong to be white. But if you feel that way, you have a consciousness about what's been happening, and that is a good thing.",
        "code": 3,
        "wordCount": 26
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Stephen",
        "title": "Do you think there will ever be white lives matter rioting?",
        "text": "No … but if we did it would be smarter than the ‘blacks ‘ when they riot …. as whenever the ‘blacks’ go rioting … it seems the first thing they do … is burn down their own neighbourhood of shops and houses\n\nAnd then spend years complaining about the lack of shops and housing …\n\nI could never figure that one out",
        "code": 3,
        "wordCount": 61
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Matt MacDonald",
        "title": "Will some predominantly white countries in eastern Europe surpass the west which promotes diversity?",
        "text": "Sad thing is all they have to do is stay right where they are and they’ll surpass us while we in the West drift backwards",
        "code": 3,
        "wordCount": 25
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Michael B. VanTol",
        "title": "I understand that this group is to affirm that it is OK to be white, but why do most of the members seem to think it is not okay to be any other colour? Nobody chooses their ethnicity.",
        "text": "I have answered or responded to many questions and comments in this space, yet I have never noticed that to be the case. Outside of a couple stupid questions or trolling comments, do you have any sources to support your claim?\n\nPeople are upset that in contemporary media and academia, white men are consistently demonized for all of society’s ills. Getting up early is the fault of the patriarchy, not being good at math is the fault of the patriarchy, slipping on the sidewalk…you guessed it, the fault of the patriarchy too. Young white men are being blamed for everything from slavery to the wage gap, not to mention that our toxic masculinity is responsible for all the rapes and sexual assaults that take place. While I understand that small percentage of white men benefited from slavery, it was also white men than fought a bloody war to end it. Please try not to forget, the vast majority of us only need to go back a few generations to find an ancestor who wasn’t even born in America, therefore, had absolutely nothing to do with slavery, segregation, or colonization.\n\nI see less racism coming from a gun toting white man wearing a MAGA hat than I do from some democratic politician, pushing rhetoric like, “Voter ID laws are racist because Black people don’t know how to get or can’t afford identification”. Every white conservative man I know, judges others, not by the way they look, but by the way they handle themselves and their affairs. Even though many leftists claim to care about minorities, they love to put everyone in a little box and pretend like, without their help black and brown people aren’t capable of success. The left’s soft bigotry of low expectations will do more damage to minorities if they keep believing that voting Republican is wrong.",
        "code": 3,
        "wordCount": 307
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "DerShu",
        "title": "Is the Darrell Brooks verdict compared to the Kyle Rittenhouse verdict proof of our two-tiered justice system heavily in favor of white people?",
        "text": "I watched both cases from start to finish and from that experience it appears that the justice system is biased more in blacks favor. Darrel Brooks made a total ass of himself in court, but the prosecution bent over backwards to accommodate his ridiculous behavior. The judge also was very lenient on him. In the end he got a stack of life sentences instead of the capitol punishment he deserved. In the Rittenhouse case the prosecution had a totally incompetent case and performed poorly and had to be reprimanded by the judge. The evidence clearly showed that Rittenhouse was not guilty, and the jury agreed. Both Rittenhouse and Brooks got a fair trial, but Brooks had no defence and was found guilty on all counts.",
        "code": 3,
        "wordCount": 125
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Tom Williams",
        "title": "What is the most racist Western European country?",
        "text": "Look for the most prosperous and peaceful and you’ll find the most “racist”. “Diversity” breeds crime, drugs, poverty, and gangs. Ethnic and racial homogeneity breeds harmony, wealth, and a law-abiding society.",
        "code": 3,
        "wordCount": 31
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Edward Maumbauer",
        "title": "What have white people learned from all their Black Lives Matter reading?",
        "text": "Hopefully such people have learned to not read such garbage",
        "code": 3,
        "wordCount": 10
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Joe Aral",
        "title": "Why do some white Americans think that America is a \"white\" country?",
        "text": "America was founded by white people, period.",
        "code": 3,
        "wordCount": 7
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Matt MacDonald",
        "title": "Why are White people not as tribal as other groups?",
        "text": "It’s because our tribal nature has been shamed and brainwashed out of this way of thinking - and now we’re bringing in the mixed multitude of people who are still very tribal in nature while we pretend ‘because we’re past this, they will be too’… meanwhile we’re bringing in cannibals from the Congo",
        "code": 3,
        "wordCount": 53
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Helixir",
        "title": "I understand that this group is to affirm that it is OK to be white, but why do most of the members seem to think it is not okay to be any other colour? Nobody chooses their ethnicity.",
        "text": "I’m sure you are misinterpreting, deliberately or not, maybe falsely, that part of It’s OK means to defend against assaults on white people by PoC in person, and increasingly Woke policies that harm us in particular, such as Affirmative Action keeping high-achieving white and Asian people from their goals, and weak anti-crime policies that endanger the public safety of law-abiders.\n\nThere are many such, and this is a forum to air such grievances, even if doing so involves criticism of others, criticism of the politically protected, that you can’t stomach.",
        "code": 3,
        "wordCount": 89
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Sean Casey",
        "title": "Can you imagine the world if white men were as racist TV depicts them?",
        "text": "It'd be a White world.",
        "code": 3,
        "wordCount": 5
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Stephen Guppy",
        "title": "Why do \"do-gooders\" in the UK think that the rights of illegal migrants should be equal or even superior to ordinary British people?",
        "text": "It seems the do-gooders put these illegal immigrants above many groups: disabled and homeless ex-service people, the homeless in general, the elderly,etc.",
        "code": 3,
        "wordCount": 22
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Dallas D",
        "title": "Do you think there will ever be white lives matter rioting?",
        "text": "No not for that reason, as for other issues a few of us are more than equipped to take back “our” country, by force if need be 😎",
        "code": 3,
        "wordCount": 28
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Dr. Jack Daniel, BSBA, MBA, Ph.D., CPA",
        "title": "Is the Darrell Brooks verdict compared to the Kyle Rittenhouse verdict proof of our two-tiered justice system heavily in favor of white people?",
        "text": "It’s an example of a high school student and a violent career criminal. One committed premeditated a mass murderer the other showed stellar behavior. The only thing race had to with the trials was Kyle’s persecution by the media and the mass murders proclaimed hatred for white people.\n\nYour question is about black people and white peoples disparate treatments. In America the only racist remarks ever spoken towards blacks is by other blacks. This statement is best illustrated with the duel standards surrounding the N-word, I am white and therefore cannot utter it no matter the context. On the other hand you cannot watch cable news without hearing something like they don’t look like me or a bunch old white men and to your point an all white jury.\n\nWe have a Vice President and a Supreme Court justice who were chosen because of their race, perhaps other reasons but race and gender were the stated requirements beforehand.\n\nRacism in America only exists on television and college classrooms where blacks are forever victims and whites somehow take advantage of them, i.e, it’s leftist nonsense.\n\nAmerica is the most diverse country in the history of the world and whites are blamed for its mythical problems.\n\nI find your question offensive b/c it infers that I am subject to better treatment as a white man. Perhaps leave your leftist racism out of your future questions. Or simply post your racist leftist views.",
        "code": 3,
        "wordCount": 235
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Ricky Tack",
        "title": "I am Brazilian of Italian descent and I am interested in taking Italian citizenship and maybe living in Europe. If I were to live in Giorgia Meloni's Italy, would that hurt me?",
        "text": "Your first thing to do is ensure that you even qualify for Italian citizenship. The rules are very strict, and if your grannie was Italian is hardly going to work!",
        "code": 3,
        "wordCount": 30
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Cailean MacConnich",
        "title": "Why are White people not as tribal as other groups?",
        "text": "Erm…. Go to any town or City in the UK on a Saturday afternoon when the footy is on and you’ll see tribal in it’s most basic form. Pretty much the same across much of Europe, South America etc.\n\nYou wear the red shirt and I wear the blue, and we are mortal enemies until Sunday morning when we’ve all sobered up a bit.\n\nOther than in sport, most white people have evolved socially far beyond tribal differences. It’s called being civilised.",
        "code": 3,
        "wordCount": 80
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "John Carter",
        "title": "Is it really OK to be white?",
        "text": "You would think so. Not anymore, apparently. Thank the government.",
        "code": 3,
        "wordCount": 10
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Eugene Mormon",
        "title": "I am a straight white male Why is it that I spent my whole life hating myself, for my character, when I was supposed to love myself, but now that I love myself I am supposed to hate myself for the color of my skin?",
        "text": "For your own sanity and survival, you need to stop letting others think for you and think for yourself and DECIDE YOUR OWN EMOTIONS. Who exactly put them (whoever they are) in charge of how you feel about yourself? Are you one of those people who sit in front of the TV awaiting instructions?\n\nThe TV (and any other form of media) is a horrible means of receiving instructions on what to think and feel. It is possible the WORST place to allow yourself programming. And that’s what they call it. Television programming. I had classes in it. That’s what they called it all through the textbooks. PROGRAMMING. They fully intend to control masses of people (like you and me) and tell them what to think, feel, do, value, reject, love, hate, buy, and ignore. They are very good at it. I learned more about hypnosis and subliminals from television than the books that supposedly teach it.\n\nNow that you love yourself, you should PROTECT yourself. Right? Who doesn’t protect who they love?\n\nYou have to protect yourself from self-serving pieces of garbage who want to run your life. There is not one single thing wrong with the color of your skin. It’s not like you choose it. It is what it is. The rest of the world has to deal with it. You are you, and you can only be the best “YOU” possible, not the best robot programmed by greedy executives at a TV network or politicians who are the very epitome of a parasite in nearly every possible way. I’m serious; someone very wise once defined “politics” as “poly” meaning “many” and “tics” meaning “bloodsucking creatures”.\n\nJust food for thought. Unplug from the Matrix, I’d say.",
        "code": 3,
        "wordCount": 285
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Harry Decker",
        "title": "Did slavery only exist in Western civilizations or did it also occur in African, pre-Columbian and Asian civilizations?",
        "text": "Slavery existed in every culture since the dawn of time. Only one culture stopped it - the British Empire. Fortunately Britain had a navy powerful enough to impose its will worldwide.",
        "code": 3,
        "wordCount": 31
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Steven Clark",
        "title": "Do people really think white privilege doesn't exist when black US families have 10% of the wealth of what white families do? Or do they think that black people are just 9 times as lazy or something, with no proof?",
        "text": "Black culture largely doesn’t value the attributes that make successful people. If they did their culture would label them “sellouts” and “Uncle Toms.”",
        "code": 3,
        "wordCount": 23
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Adam Harp",
        "title": "Why do equity, diversity, and inclusion exclude Asians as part of people of color?",
        "text": "Because “typical” Asians in the US completely destroy the narrative that whites make it difficult / impossible for non-whites to succeed in the US. It's hard to maintain a lie when you call attention to evidence that directly refutes that lie. Since Asians objectively have no more difficulty obtaining top grades, entrance into top universities, high paying jobs, etc. than whites, if the anti-white bigots drew attention to Asians, some of the less zealous people who buy into the BS rhetoric might start asking awkward questions. Such as, “If whites systemically oppress ALL non-whites, why are so many Asians successful? Why can't non-Asian non-whites succeed the same way??\n\nSo Asians are excluded from those things because the people pushing them are liars.",
        "code": 3,
        "wordCount": 121
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Wes Bennett",
        "title": "Are white people a threat to the new world order?",
        "text": "Ummm…not if you aren't a billionaire. NWO is a defunct Conspiracy Theory that poses up in differing forms.\n\nBasic concept “Group B” wants to control “Group A”\n\nThe variants may base this on economics, productivity, gun rights, “de-whiting” of the world, white supremacy, etc\n\nTruth time. The closest thing to NWO is billionaires. And it is about securing wealth. There have been some hints that they may have meetings with nefarious purposes, but, since you can't fake your way into the club, this is mostly speculative.\n\nThe other truth, many of them hide behind enormous philanthropic donations.\n\nThe people in this group could give away 90% of their wealth, AND still be in the top 10%. Essentially, even if they gave away 99% of their wealth, they would still be near billionaires. (It is so much more complex than this, it's ridiculous. Most of them don't have hard cash filling vaults, it is much more fluid in investments etc. So they don't actually have the free will to do what we just mentioned above because they control the wealth, but are also accountable for it. But, if all their wealth was all solid assets, like most of us live the above could be possible.)\n\nI'm not advocating for or against hyperwealth. Do not feel sorry for them, they still get plenty of perks to more than make up for their loss of free will in their wealth.\n\nIt's just that we get this mental image of Scrooge McDuck diving in his money pool, and that isn't tangibly feasible.\n\nSo, are they “evil”? Ehhhh…let's say exceptionally greedy. Some are evil, true.\n\nAnd the irony. It is their philanthropy that gives us this weird impression, combined with their “self made” stories, that they aren't bad for the economy. Instead, we blame millionaires, and the poorest poor people. They have turned the middle class to upper lower class against the next level, and the level below.\n\nDo they have a nefarious purpose? Whatcha going to do about it? I heard this about the Freemasons in the late 1990's. With Y2K looming, it was on purpose because the Freemasons wanted to limit childbirth rates and control the economy to turn the entire world into feudal misery. It was going to be a Mad Max, Postman style world for the dissenters. This had been agreed upon back in 1000AD, and it was “proven” through web articles, with pictures. They infiltrated all governments, and were moving forward at midnight 1/1/2000.\n\nThe proponent of this theory had invested in gold. But not the smart documented way. He would buy old gold from pawn shops. He told me I needed to do this before it was too late. Problem, in the post apocalyptic no running water, or electricity world we were heading for, what good would gold do? He replied, to buy things. Nope, not on your freaking life. I wouldn't take two pounds of gold for a pound of corn. You sir, are insane. I can't eat it, build anything with it of value. If I have excess, sure we can talk, I still remember enough science to recognize its utility in limited applications. If you had a pound of hardened steel, now we will talk about me dipping into my stores of corn.\n\nSecond problem, and this may have seemed minute, but “Which midnight?” He didn't understand. Well, there is 24 of them that day, so, the first one, or the last? I swear his response was, “How the hell am I supposed to know, they are keeping that secret?” Mentally I was thinking, “THAT, THAT was the secret that couldn't get out?”\n\nAnd finally, the reduced childbirth rates. I have never understood why this keeps coming up. If eugenics ever happened on a global scale, unless they were stupid as well, they would base it off of IQ levels. The best way to do this? Free education all the way up to the top to find the best minds. But we don't see that, with any actual goal like that in mind.\n\nAnd lower population means less control. Once the working class(especially manual labor, farms, even those using heavy equipment operators). What good is power if you are king of the mountain with no food, water, utilities, ability to import, a populace to control? You can accomplish that crap way more efficiently with a couple of million on a self sufficient farm house.\n\nInstead what we see is the economic equivalent of Hoarders. They work hard to keep as much as possible, and distract. Ifbthey save 3 million in taxes by giving away 2.5 million, they are better off. And it is no where near that ratio.\n\nBill Gates could, with 1-2 hours worth of his time(if his wealth was divided up to $/hr) change 10 families lives financially. (Assuming the 2.2 child per nuclear family) You could send them to Ivy League schools. Buy larger homes than you most likely have. Set up a steady growth fund that pays your bills in perpetuity. Buy a car per person. And still have plenty of money to eff around with for reasonable vacations etc.\n\nThat is how ridiculously wealthy him and his ilk are. They tend to be more moderate in dress, philanthropic, and down to earth. It is a ruse, but, doesn't mean they are “bad” people. But they got where they were through greed and ambition.\n\nNWO was used many times in speeches, and has been a sticking point. It generally was stated by politicians in reference to democratic systems spreading. (Little “d”, the form of government, not Democracy aligned with a political party)\n\nBut the sound of it is nefarious. I'll admit. But it also upsets me, because it is a distraction.\n\nThe most evil thing happening, is while people are pissed about gun control, NWO, lizard people, illegal immigration, anti white sentiment, and other countries taking our jobs, the truth is way more simple and sad.\n\nWe, as U.S. society have become apathetic to the poor and suffering. While many of my family are batching about “estate taxes”(a problem they will never have to worry about), the poor are called lazy. Yeah, that 5yo that died from hunger in the last hour was just too lazy to work for food. While they are screaming about illegal immigration, 50 more Americans will die because insurance is out of reach, and they didn't have the resources to get Medicade/Medicare. Even while I am typing this, and answering questions about the “Leftist NWO”, 30 women and children were beaten, raped or murdered by their significant other/parents. And I am laying out conservative estimates. In that time, most of the billionaires (each individually)have gained enough wealth to buy your land, house, car, or all three.\n\nIt would be like going back in time, and hearing the Serfs cheating in chorus about the landlord that is keeping them barely fed and poor. The difference? In this case, some serfs have a little more, and some a little less.\n\nThe New World Order does not exist as a single coherent evil organization. (FIFA, AND NFL TEAM OWNERS ARE CLOSE). Equality for all was a codified right in our constitution, and of you think that's NWO, then I hope you are scared. There is no “white replacement” plan from a powerful organization. Might the other races decide they have had enough of Anglo Superiority, and unite against us? Possibly, but we asked for it. We have been shoving our agenda around every since Constantine refounded the Holy Roman Empire. Our way, or die!!! Or, just die.\n\nI don't know of any organizations pushing for this, or I would be the first bootlicking bitch in line to try and curry favor. What they are asking for is to quit being ignored, overlooked, and treated as different.\n\nIf you think you would even stand a chance against a full organized movement against “white people”, go for it. At best you'll look like a moron, at worste you will see it as a self fulfilled prophecy when your bigotry gets you killed.",
        "code": 3,
        "wordCount": 1325
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Richard",
        "title": "Why don't the NGO rescue ships in the Mediterranean take the migrants to North African ports in Algeria or Morocco instead of Italy? Why is it always to Europe?",
        "text": "I am guessing this is a rhetorical question.",
        "code": 3,
        "wordCount": 8
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Dan Sutton",
        "title": "Do you Think South Africa has improved since apartheid was abolished?",
        "text": "(more)",
        "code": 3,
        "wordCount": 1
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "John Tibbott",
        "title": "Will some predominantly white countries in eastern Europe surpass the west which promotes diversity?",
        "text": "If the tendencies continue as they are those countries will surpass Western Europe in 10 to 20 yrs.",
        "code": 3,
        "wordCount": 18
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "The Friendly Fascist",
        "title": "Why are White people not as tribal as other groups?",
        "text": "Because our society has evolved beyond it. White tribes still exist in Arctic Scandinavia & small slavic tribes existed until as recently as the 18th century. But European society has become more civilized over the centuries. Africa was civilized for the most part but their societies didn't, the Europeans essentially gave tribes literacy, the bible, & guns without working to reform their society. The American Indians became civilized rather quickly because they had an advanced civilization near them & they wanted to be more like them. American Tribes still exists but they're tribes in name only, otherwise they function the same as any municipal government.",
        "code": 3,
        "wordCount": 105
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Abe Goldman",
        "title": "Why is racism against whites seen as socially acceptable?",
        "text": "Because a lot of us don't like each other and agree with the racist statements, just because we're not usually violent and don't usually jack people doesn't mean we can't be very unfriendly, very conservative, very boring, very full of fear, not the least bit personal or inviting to random people, don't get me wrong those are all the lesser of evils than being victims of crimes, but they all suck!",
        "code": 3,
        "wordCount": 71
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "William Barlow",
        "title": "Why are there black main characters in the show Vikings?",
        "text": "Simple answer. “Diversity” over historical",
        "code": 3,
        "wordCount": 5
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Truth And Common Sense Warrior",
        "title": "Do you think there will ever be white lives matter rioting?",
        "text": "Not from me. Too busy working to keep my family fed. Even if I had the time I wouldn't. I would go fishing or hiking.",
        "code": 3,
        "wordCount": 25
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Pericles",
        "title": "Do people really think white privilege doesn't exist when black US families have 10% of the wealth of what white families do? Or do they think that black people are just 9 times as lazy or something, with no proof?",
        "text": "Here for the grammar.",
        "code": 3,
        "wordCount": 4
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Anthony Cloud",
        "title": "Why is Lebron James so revered when his comments and tweets are full of racism, rants against whites, etc.? Yet he’s happy to take their money. Should we stop buying products he endorses? (Shoes, AT&T, etc.).",
        "text": "Who the hell is Lebron James?",
        "code": 3,
        "wordCount": 6
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Reuben Hayat",
        "title": "Can an American citizen born in Egypt check the box \"African American\"?",
        "text": "Being “black” in America comes with a lot of privilege. So much so that an Egyptian man, some years back, sued to be considered “African American.” By law, Egyptians cannot be “African American.” https://www.washingtonpost.com/a...",
        "code": 3,
        "wordCount": 34
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Formless One",
        "title": "Do you think there will ever be white lives matter rioting?",
        "text": "No, we simply don’t care as much",
        "code": 3,
        "wordCount": 7
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Scott Dismukes",
        "title": "Why do so many black neighborhoods have such high crime rates as compared to most white neighborhoods?",
        "text": "It isn’t necessarily a racial issue. Here are the factors as I understand them:\n\n74% or people who fail at life had a single parent household. It’s not predictive, but it IS a damned significant number. What’s more interesting is it is true regardless of race, income, national origin, religion and all that. Kids from rich single parent families get in trouble and fail at life at the same rate as poor kids. There are just not nearly as many single-parent rich families as there are poor ones, so the count of failures is lower.\nPoverty makes #1 a lot worse.\nPeer pressure makes #1 and #2 worse. When a kid in the ‘hood is beaten up because he got good grades, he simply won’t get good grades. His options for getting out of the ‘hood just dropped to zero. It has nothing to do with good/bad teachers or how much money the school gets. Why? He wasn’t acting “black enough”, an “oreo”, as if you have to be a failure to be adequately black. Adding one more person the the population who can't get a job is going the wrong direction. That is simply disgusting, but too true.\n\nThe multi-parent household rate in black and poor communities in the 1960’s was 94%. Today, after LBJ’s Great Society laws, the number of 2-parent+ households in poor areas (black, white, or Hispanic) is around 24%. The prevalence of the church has diminished.\n\nSingle parents just don’t have the time to raise the kids AND work for a living. It’s a 2-person job. Something has to give, and earning enough to eat pretty much trumps the raising of the kids.\n\nAs a result, the teaching of moral values to single parent kids, especially in areas where the church has also been reduced, has dropped. Social pressures to “have things”, the latest $1,000 “kicks”, a hot “whip”, all that, in the meantime is sky high. No jobs, pressure to have rich-people stuff - pretty good breeding ground for drug deals and other crime.\n\nDoing the math, 76% of homes are single parent, and 74% will fail at life, do crime and such - that comes out to around 56% of kids in poor neighborhoods turning to drugs, and crime. If I’m not mistaken, that’s just about exactly what the crime rate is.\n\n.\n\n.\n\n.",
        "code": 3,
        "wordCount": 382
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Griz Ley",
        "title": "Do you think there will ever be white lives matter rioting?",
        "text": "Perhaps in South Africa where racists surround, terrorize and murder white families on remote ranches.\n\nBut I would be surprised even with this kind of atrocity. They would most likely demand the government do something about it and protest if they don’t. It just doesn’t make sense to “tear down” the civil structure you are expecting to deal with a problem.\n\nBLM has been moved out of rationality with a neo-Marxist Utopianist agenda.",
        "code": 3,
        "wordCount": 71
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Eugene Mormon",
        "title": "Why don't the NGO rescue ships in the Mediterranean take the migrants to North African ports in Algeria or Morocco instead of Italy? Why is it always to Europe?",
        "text": "Because that’s where the money is, the resources, and the kind-hearted people are. Not all African places have the same money, resources, and people with the ability or inclination to help refugees or “migrants”. That’s usually where migrants are FROM, not where they want to go. No sense in going from the frying pan into the fire.",
        "code": 3,
        "wordCount": 57
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Travis Earl",
        "title": "Why are White people not as tribal as other groups?",
        "text": "As intelligent as our people are, our very high sense of altruism, exploited by our enemies, has indeed shown in the 20th and 21st centuries to be one of our great weaknesses as a race. We believe in great visions for humanity, we feel good when we help the downtrodden which used to be directed towards the well being of our lower class citizens in our White lands. With the mass ownership of radio, television and mobile devices, our enemies have become mostly successful in capturing our altruism and spend it towards helping and subsidizing the 3rd world, making ourselves feel good but year by year is empowering the hostile non-Whites. This energy, with the help of our enemies renaming racial consciousness as “racism” as a sin, is being used to divide our people with great success.\n\nOur altruism has been so inverted that the majority of our people, hypnotized beyond reasoning, now use our energy once used in the love of our people towards helping the ‘other’. An example of this includes the tragic policy of affirmative action, believed by the hypnotized to ‘help’ the other for reasons that are completely based in falsehoods yet are believed by the majority of our people, including intelligent captured minds by the enemy.\n\nOur wanting to be with our people still shows, just observe and talk to the double-speaking yuppies in the 90% White neighborhoods that claim to love the ‘other’ yet will use their security and police forces to keep that other out of their lands. They will still lecture you about ‘racism’ and the false sins of our people despite the massive hypocrisy. Every White, deep down inside, knows this diversity propaganda is all a hoax yet are hopelessly confused and choose to march along with what the enemy regime tells them is virtuous and full of “love”.\n\nOur tribal feelings have been weaponized, the enemy knows how big a heart we have, and I and many racially aware Whites worry this big loving heart of ours spells our doom. Many intelligent species of the past, such as the Dodo bird, went extinct due to their friendliness and naïveté.",
        "code": 3,
        "wordCount": 356
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Alys Richards",
        "title": "Do people really think white privilege doesn't exist when black US families have 10% of the wealth of what white families do? Or do they think that black people are just 9 times as lazy or something, with no proof?",
        "text": "Going from an unsubstantiated statistic to a full blown conclusion naming its cause, is quite a leap. You’ve left out a lot of factors between the 2 points. Talk about flawed thinking. This is not reasoning or logic. It’s allowing one’s emotions to rule them. A bad habit and very naïve of you.\n\nLiberals are more emotion-driven than conservatives\nResearchers have studied the interaction between emotion and political ideology, showing that the motivating power of emotions is not the same for those on different ends of the ideological spectrum.\nhttps://www.sciencedaily.com/releases/2014/11/141107091559.htm",
        "code": 3,
        "wordCount": 87
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Matt MacDonald",
        "title": "When Angela Davis said \"In a racist society, it's not enough not to be racist. You have to be anti-racist.\" Did it include racism against whites?",
        "text": "No because in the minds of a dindu, White people themselves are the epitome of racism.",
        "code": 3,
        "wordCount": 16
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Barry Weir",
        "title": "Do people from Latin America call themselves Americans? How about people from Canada and Mexico?",
        "text": "Original question: Do people from Latin America call themselves Americans? How about people from Canada and Mexico?\n\nIn my experience, people from Iberoamerica (I hate the term: Latin America) call themselves by what they are. I am proud to be Peruvian; our neighbours to the south are proud to be Chilean. …and so it goes.\n\nTo a Spaniard, our language and customs are likely “American”. Here in Peru, when we say “América” we likely mean the places that speak Spanish in the New World. Being “American” is more a sense of being than an identity. Our republics have spent considerable energy at creating equality; we are mostly mestizos (mix of European and indigenous) here in Peru. Some people are more one side than the other. But: we want, and indeed need, equality of opportunity.",
        "code": 3,
        "wordCount": 132
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Nikola Smolenski",
        "title": "Is it true that white women, as depicted in Hollywood, are uninterested in white men?",
        "text": "No, it is the exact opposite: white women are interested in white men the most. Source: https://web.archive.org/web/20190212060118/https://theblog.okcupid.com/race-and-attraction-2009-2014-107dcbb4f060",
        "code": 3,
        "wordCount": 17
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Ricky Tack",
        "title": "Why don't the NGO rescue ships in the Mediterranean take the migrants to North African ports in Algeria or Morocco instead of Italy? Why is it always to Europe?",
        "text": "Boats operated by NGOs in the Mediterranean Sea are not responsible for migrant relocation as they do not represent a national government,",
        "code": 3,
        "wordCount": 22
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Ricky Tack",
        "title": "Hasn't all land on Earth been taken away from their Natives? Why is the U.S. so special?",
        "text": "Us British Natives still own a vast proportion of our lands. The same is probably true of the Natives of Germany and France. As for the USA, the European settlers gained territory by the millennia old method of conquest. The Red Indians did not put up enough of a fight, which has been the way throughout the world, throughout all of recorded history, for all countries.",
        "code": 3,
        "wordCount": 66
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "EG",
        "title": "Do people really think white privilege doesn't exist when black US families have 10% of the wealth of what white families do? Or do they think that black people are just 9 times as lazy or something, with no proof?",
        "text": "IF this is a serious question, then you need some facts. So 13% of the population has 10% of the wealth? And less than 1/2 of the 13% are gainfully employed, yet that have 10% of the wealth. More black children grow up in single parent or no parent homes yet they have 10% of the wealth? Percentage wise 5 times as many black males are in prison than white males, yet blacks hold 10% of the wealth. So looks like the actual privilege is with blacks who decide to be productive and not criminals.",
        "code": 3,
        "wordCount": 95
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Griz Ley",
        "title": "Is the Darrell Brooks verdict compared to the Kyle Rittenhouse verdict proof of our two-tiered justice system heavily in favor of white people?",
        "text": "An attempted comparison between these two cases is laughable indication someone is plugged more into narratives than reality.\n\nRittenhouse defended himself justly against a mob in general who were running at him shouting to “get him” — and specifically against 3 people with criminal records who were specifically trying to shoot/ hit him/ physically grab his gun. It’s been ruled that in the case of Joseph Rosenbaum they had “joint custody” of the firearm (ie, Rosenbaum had grabbed it). Rittenhouse was an idealistic kid with damn good gun training who perhaps foolishly decided to insert himself into a volatile situation for the sake of cleaning graffiti, helping the injured, and protecting properties from criminal rioter (because the police had abdicated this duty on the insistence of corrupt city and state officials.\n\nBy comparison, Darrell Brooks had a social media presence that touted the nobility of using vehicles as weapons; had already run his GF over in a dispute; and who was reported by police as slowly approaching a parade barricade, knocking it over, then briskly accelerating into a crowd of mostly women and children celebrating in a Christmas Parade.\n\nI would observe that the asker of this question is either a mal-information peddler, or their ignorant pawn.\n\nThe ideological narrative-spinners have had their kick at the can over the past 6 or so years. Now it’s time for some “light-of-day” best knowable Truth to kick those malicious yet flimsy narratives to the curb.",
        "code": 3,
        "wordCount": 239
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Kevin Caudill",
        "title": "Has race relationships improved since the woke culture and BLM started gaining more traction around the world?",
        "text": "On the contrary,those very racist groups spread fear and hate, how in hell is that going to make anything better? Hate groups should be abolished. The BLM is much more dangerous and has killed more people than the KKK",
        "code": 3,
        "wordCount": 39
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Socrates Plato Inveritas",
        "title": "Who is likely to be wrong, white people who state they are not all white supremacists or black people who claim that all whites are supremacists?",
        "text": "The election and then re-election of Obama pretty clearly proved which statement is accurate and which is bogus racist garbage.",
        "code": 3,
        "wordCount": 20
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Chloe Donovan",
        "title": "How do white men feel when they see beautiful blonde white women with black men?",
        "text": "I'll be gentle and use the words “very uncomfortable.” White women feel the same way. We used to have a name for women like that, and it wasn't even an improper or rude remark, because everyone was thinking it anyway.",
        "code": 3,
        "wordCount": 40
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Gary Vincent",
        "title": "When Angela Davis said \"In a racist society, it's not enough not to be racist. You have to be anti-racist.\" Did it include racism against whites?",
        "text": "Two things prevent from this 1 just being I am supposedly racist by nature which is stereotyping of the highest order. 2. Being anti-racist in her mind doesn’t include being against racism towards white people",
        "code": 3,
        "wordCount": 35
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Stephen",
        "title": "Hasn't all land on Earth been taken away from their Natives? Why is the U.S. so special?",
        "text": "Why is the US so special ???\n\nWell firstly ‘all land on Earth hasn’t been taken away from their Natives’ …. they have usually just been conquered by people that had better technology meaning they were a bit smarter …. that’s how it has worked for about a million years and is one of the reasons for human advancement over the years when one race that had better technology so they became predominant …. that’s how it has always worked.\n\nSo why is the US so different …. is because it is the Whites that invented most of this social media technology …I can’t remember to many ‘black’ faces during the early invention of computers and social media ……. but now they seem to have taken it over , them and all of these ‘woke’ idiots … and invented ‘political correctness’ and BLM …. and all the rest of it …. and are using it to take over the world and they are being allowed to get away with it .\n\nAnd most of it evolves in the USA …. and that’s the only thing special about them.",
        "code": 3,
        "wordCount": 185
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Damshame66",
        "title": "Why is it funny when a black person is racist to a white person, but not the other way around?",
        "text": "I've never seen any humor in it. I do notice that they get away with it when it's in the context of humor for instance on some of these inane sitcoms. Of course that doesn't make it right or funny but I suppose it's because there is a culture in Hollywood now that panders to special interests and minority complaints. And looks the other way when it gets uncomfortable",
        "code": 3,
        "wordCount": 69
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Ricky Tack",
        "title": "Do Germans have a distaste for their own land and people? If so, why?",
        "text": "Certainly not: Both my mother and late wife were from Berlin, and I was based there during the Cold War, and they are justly proud of their country, and their great history.",
        "code": 3,
        "wordCount": 32
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Joe Travieso",
        "title": "Why is Lebron James so revered when his comments and tweets are full of racism, rants against whites, etc.? Yet he’s happy to take their money. Should we stop buying products he endorses? (Shoes, AT&T, etc.).",
        "text": "dont buy anything from the woke",
        "code": 3,
        "wordCount": 6
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Dr. Jack Daniel, BSBA, MBA, Ph.D., CPA",
        "title": "What is the most racist Western European country?",
        "text": "I would say Great Britten, France, Germany and Sweden in that order. They each have large Muslim population who have a proclivity to stab white people in England and to rape white women in the other countries. I only mention the victims race b/c of the question and b/c they target citizens of their host countries.",
        "code": 3,
        "wordCount": 56
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Joachim Martillo (יונתן פֿאליק , عطا الله عفلق)",
        "title": "What do you think of the fact that White Americans voted overwhelmingly for Republicans in the midterms, while all groups of non-White Americans voted overwhelmingly for Dems? Are Republicans officially the White Party and Dems the non-White Party?",
        "text": "I thought white men voted Republican but white women voted Democrat.",
        "code": 3,
        "wordCount": 11
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Dan Vanderburg",
        "title": "Have whites become less racist?",
        "text": "This isn't a question, it's a accusation. Liberals have no proof of racism so they come up with these stupid insinuations. The answer to your stupid question is no. If hating liberals makes me a racist then I'm becoming more racist every day.",
        "code": 3,
        "wordCount": 43
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Richard Daniels",
        "title": "What do you think of the fact that White Americans voted overwhelmingly for Republicans in the midterms, while all groups of non-White Americans voted overwhelmingly for Dems? Are Republicans officially the White Party and Dems the non-White Party?",
        "text": "I think that is what democrats would have us believe. Any group that believes they are disenfranchised, downtrodden or victimized will vote for the party that promises to right that wrong, that is the democratic party. But all they do is promise. Their efforts rarely deliver.",
        "code": 3,
        "wordCount": 46
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "The Friendly Fascist",
        "title": "Is it racist if I don’t want to date a black guy?",
        "text": "Racism is defined as “prejudice, discrimination, or antagonism directed against a person or people on the basis of their membership in a particular racial or ethnic group.” It's not antagonistic or discriminatory to have preferences so no it's not racist. It would be racist if you wouldn't date a black person because you think ill of them, but if it's purely on a basis of preference then it is not racist.",
        "code": 3,
        "wordCount": 71
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "John Tibbott",
        "title": "Is the Darrell Brooks verdict compared to the Kyle Rittenhouse verdict proof of our two-tiered justice system heavily in favor of white people?",
        "text": "Kyle Rittenhouse was protecting himself. Daryl Brooks was a murderer. You think Daryl should have gotten off because he was black?",
        "code": 3,
        "wordCount": 21
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Roy Dickel",
        "title": "As a white person has your life become better or worse because of diversity and multiculturalism?",
        "text": "Better I feel I enjoy foods I'd never heard of and would never have had the chance to try. I listen to music influenced by rythyms and rhymes from all over (how can you listen to SoCa and not smile)\n\nI work with people from all over the world and have been able to travel and work in a variety of countries (adding a little to thier diversity and multiculturalism)\n\nSo I feel definately better",
        "code": 3,
        "wordCount": 73
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Amanda Johnson",
        "title": "Why does the Anti-Defamation League only give a small summary on it's okay to be white rather than having a full debate with an open comment section?",
        "text": "They don't have a way to debate except to repeat non proven ideals to say that's its racist because it supports whites. They'd have to repeat themselves over and over that it's racist to support white people and look like a fool.",
        "code": 3,
        "wordCount": 42
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Scotty Gee",
        "title": "How do white people feel about being white?",
        "text": "I like it, If any thing goes wrong I don't have any one to blame but myself. It makes you be responsible for your own life. We also have a great history and culture. Ranging from kings and queens to vikings to most of the great cuisines in the world. White people also live successfully on every continent of the world. Sure white people have don't some messed up stuff but what race hasn't.",
        "code": 3,
        "wordCount": 74
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Daniel Wolfe",
        "title": "Is a white 15-year-old school girl a racist if she refuses to date black male students?",
        "text": "Is a 15 year old black girl racist if she refuses to date a white boy? If ever in doubt if something is racist for white people to do, just reverse is and ask if it's OK for blacks to say/do it.",
        "code": 3,
        "wordCount": 42
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Graham Walters",
        "title": "Why are there black main characters in the show Vikings?",
        "text": "Because there are people out there trying to re-write history.\n\nThe BBC lost a lot of credibility and viewers when it screened a play with Anne Boleyn played by a coloured woman.\n\nThis is a picture of Anne Boleyn\n\nWhat part of that picture tells any one she is coloured?",
        "code": 3,
        "wordCount": 47
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Debra Bolling",
        "title": "Do people really think white privilege doesn't exist when black US families have 10% of the wealth of what white families do? Or do they think that black people are just 9 times as lazy or something, with no proof?",
        "text": "White privilege is not the cause of the problems in the black community. Black culture is.\n\nThe leftist pretense of concern for the well-being of black people confers upon them an aura of moral superiority and, as such, gives more credibility to their calls for increasing government control over our lives.\n\nOrdinary black people have been sold on the importance of electing blacks to high public office. After centuries of black people having been barred from high elected office, no decent American can have anything against their wider participation in our political system.\n\nFor several decades, blacks have held significant political power, in the form of being mayors and dominant forces on city councils in major cities such as Philadelphia, Detroit, Washington, Memphis, Tenn., Atlanta, Baltimore, New Orleans, Oakland, Calif., Newark, N.J., and Cincinnati.\n\nIn these cities, blacks have held administrative offices such as school superintendent, school principal, and chief of police. Plus, there’s the precedent-setting fact of there being 44 black members of Congress and a black president.\n\nWhat has this political power meant for the significant socio-economic problems faced by a large segment of the black community?\n\nClearly, it has done little or nothing for academic achievement; the number of black students scoring proficient is far below the national average.\n\nIt is a disgrace — and ought to be a source of shame — to know that the average white seventh- or eighth-grader can run circles around the average black 12th-grader in most academic subjects.\n\nThe political and education establishment tells us that the solution lies in higher budgets, but the fact of business is that some of the worst public school districts have the highest spending per student. Washington, D.C., for example, spends more than $29,000 per student and scores at nearly the bottom in academic achievement.\n\nEach year, roughly 7,000 — and as high as 9,000 — blacks are murdered. Ninety-four percent of the time, the murderer is another black person. According to the Bureau of Justice Statistics, between 1976 and 2011, there were 279,384 black murder victims.\n\nContrast this with the fact that black fatalities during the Korean War (3,075), Vietnam War (7,243), and wars since 1980 (about 8,200) total about 18,500. Young black males have a greater chance of reaching maturity on the battlefields than on the streets of Philadelphia, Chicago, Detroit, Oakland, Newark, and other cities.\n\nBlack political power and massive city budgets have done absolutely nothing to ameliorate this problem of black insecurity.\n\nMost of the problems faced by the black community have their roots in a black culture that differs significantly from the black culture of yesteryear.\n\nToday only 35 percent of black children are raised in two-parent households, but as far back as 1880, in Philadelphia, 75 percent of black children were raised in two-parent households — and it was as high as 85 percent in other places. Even during slavery, in which marriage was forbidden, most black children were raised with two biological parents.\n\nThe black family managed to survive several centuries of slavery and generations of the harshest racism and Jim Crow, to ultimately become destroyed by the welfare state.\n\nThe black family has fallen victim to the vision fostered by some intellectuals that, in the words of a sociology professor in the 1960s, “it has yet to be shown that the absence of a father was directly responsible for any of the supposed deficiencies of broken homes.” The real issue to these intellectuals “is not the lack of male presence but the lack of male income.”\n\nThat suggests that fathers can be replaced by a welfare check. The weakened black family gives rise to problems such as high crime, predation, and other forms of anti-social behavior.\n\nThe cultural problems that affect many black people are challenging and not pleasant to talk about, but incorrectly attributing those problems to racism and racial discrimination, a need for more political power, and a need for greater public spending condemn millions of blacks to the degradation and despair of the welfare state.",
        "code": 3,
        "wordCount": 654
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Kapil Bohra",
        "title": "Do you feel that television media is trying to shove racial mixing and racial diversity down your throat?",
        "text": "It is force fed and is very irritating. Specially netflix.",
        "code": 3,
        "wordCount": 10
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "BARBARA MEALER",
        "title": "Is featuring a non-white actress as Snow White (a German fairytale) in the movie a \"good\" example of inclusivity you support?",
        "text": "No. Snow White—-what does that bring to mind? It is a GERMAN fairytale where the main character is pale, like snow and supposedly as clean and innocent as newly fallen snow. That is NOT inclusivity. That is changing the story to suit your point of view.\n\nIf you want to do a film on inclusivity, then do one on the American Cowboy were many of them where black, or the black units in the various wars we fought. Or give the true history of slavery where blacks were enslaving blacks. According to history, the first slave owner in the USA was—your ready for this—-black. Fact—most of the slaves were not mistreated. When you pay good money for something, you take care of it. What about the number of slaves that were bought and set free? Oh, you didn’t hear about that? I was taught all that in high school in civics and social studies long before Martin Luther King and the civil rights act.\n\nInclusivity is when the person would have normally been included in that setting or situation in that point of history. You don’t insert them into where they would not have been because they “should have been there.” There were no blacks in Germany when Snow White was written. Or in England in the 1500s to 1700s and those that showed up later were in lower class roles like servants.\n\nYou need to keep history as it really was and stop trying to change it. Anne Boleyn was white. Get over it. Snow White was white, move along and leave it be. The Genie in Aladdin was black. No problem. Huckleberry Finn had blacks in it in the roles they played at that time—get over it. It is historically correct. If you have a problem with history, you might want to look elsewhere for your inclusivity like today or future space odysseys or your dystopian novels or your present day novels. You include only those who would have been in that particular situation at that time in history. If they wouldn’t have normally been there, then don’t include them. That is common sense and accurate.",
        "code": 3,
        "wordCount": 355
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Helen De Stefano",
        "title": "When people say \"white people have no culture\", is that racist?",
        "text": "Yes it is racist!",
        "code": 3,
        "wordCount": 4
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Patrick Appell",
        "title": "Why are there black main characters in the show Vikings?",
        "text": "Woke stupidity, plain and simple. Black Vikings makes about as much sense as white Zulu's.",
        "code": 3,
        "wordCount": 15
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "DerShu",
        "title": "Is featuring a non-white actress as Snow White (a German fairytale) in the movie a \"good\" example of inclusivity you support?",
        "text": "No of course not! If you changed her name to “Brown Sugar\" then you can call it a sequel.",
        "code": 3,
        "wordCount": 19
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Dan Sutton",
        "title": "Is featuring a non-white actress as Snow White (a German fairytale) in the movie a \"good\" example of inclusivity you support?",
        "text": "(This one is actually real!)",
        "code": 3,
        "wordCount": 5
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Bradly Fackrell",
        "title": "A suspect have just murdered your family. Does adding descriptive features [e.g. ethnicity and gender] of the suspect via comms. increase the chance for the police to locate the suspect quickly or is it racism to use racial descriptive words?",
        "text": "This takes me back to my days in Baltimore and I have to laugh…\n\nObviously, it does help to provide as much detail as possible.\n\nBack to my 15 years living on the outskirts of Baltimore. This was about 20 years ago. I began to notice that so many people started to feel like they needed to wear blinders when it came to the race of a person. Especially if the person was black.\n\nIt seemed like nearly every morning when I turned on the local (Baltimore) news there was another shooting/stabbing/violant crime and the journalists were telling us to “be on the lookout for…”. When I first moved there, a full description was the norm. By the time I moved away, the race of the person was only mentioned if they were white. It was the “elephant in the room”. I’m pretty sure that most of the viewers eventually learned to assume that it was a black person that we needed to look for if no race was mentioned….which is really pretty comical and sad at the same time.\n\nGotta love Bawlmer! Pretty cool place but the people are a little off. It wasn’t so obvious back when I was young and naive.",
        "code": 3,
        "wordCount": 200
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Karl Ehrler",
        "title": "Are you afraid for your children's future?",
        "text": "You bet I am, whites are becoming too passive to assert their culture in fear of being called racist.",
        "code": 3,
        "wordCount": 19
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Jeffrey Cox",
        "title": "Why do black people believe that white people enslaved their ancestors?",
        "text": "They have been brainwashed by then democratic party,by the way it was the democrats that supported slavery and they republicans that fought and lost there lives to free slaves.",
        "code": 3,
        "wordCount": 29
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Bealey L. Hansen",
        "title": "Why are there black main characters in the show Vikings?",
        "text": "Why are there black main characters in the show Vikings?\n\nBecause many series/shows/movies are made to please the woke crowd.\n\nThey don't care about historical facts at all.\n\nIt seems that black people don't have a history to be proud of, they accomplished absolutely nothing, so they are trying to take over white history and claim it as their own.\n\nBy doing this they create nothing but lies and historical untruths.\n\nBlack people has no reason to be in a story about vikings at all!!\n\nVikings were all brave badass white people who were dangerous to mess around with!\n\nIf a black person should be in a series about vikings, it can only be as a random slave.\n\nSomeone should make a series/movie/show/whatever about black people telling their historical background and accomplishments.......if possible.",
        "code": 3,
        "wordCount": 125
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Matt Mezzetta",
        "title": "Why do black rappers say end to racism but get mad when a white person raps?",
        "text": "Because they are ignorant and can’t play an instrument,that’s why the always grab their crotch",
        "code": 3,
        "wordCount": 15
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Noah Peng",
        "title": "Why is there no multi-racial push for diversity in places like China or Japan like there are in White countries?",
        "text": "Because China and Japan are not \"empires\". In the current world, Europe and the United States are \"empires\" like Rome. As an \"empire\", while controlling other ethnic groups, it must also make a gesture of tolerance in exchange for the recognition of the other party. Japan and China are not empires, they only care about their own country's affairs. China certainly promotes racial equality, but only includes China's official 56 ethnic groups. The interests and obligations are consistent, and to maintain the greatest influence in the world, we must maintain inclusiveness. Japan and China are not \"universal empires\"",
        "code": 3,
        "wordCount": 98
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Jeff Crouch",
        "title": "What do you think of the fact that White Americans voted overwhelmingly for Republicans in the midterms, while all groups of non-White Americans voted overwhelmingly for Dems? Are Republicans officially the White Party and Dems the non-White Party?",
        "text": "What makes you think you know what non white people voted for. I am part Cherokee meaning I have a Native American heritage. It might be the Indian part of me that doesn’t trust democrats and no part of me would ever vote for one now.",
        "code": 3,
        "wordCount": 46
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Felix Emanon",
        "title": "How many of your teachers lied to you about White history?",
        "text": "None, but I have seen many examples of how kids these days are getting a really warped idea of what went on. What the hell are they telling these kids anyway?",
        "code": 3,
        "wordCount": 31
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Robert Hutson",
        "title": "Why do white Americans believe they can come here and claim to have rights to stolen land and feel they can determine who and who is not Illegal, I’m a native Mexican, an Aztec descendant my family has been here for thousands of years long before Columbus arrived here we’ve have migrated here on our land for thousands of years, so tell me who are you to decide who is an immigrant and who is not?",
        "text": "A very simple answer is that you lost the war thus you lost the land. To the winner go the spoils. It is that simple, This is my opinion of all indigenous peoples. They all lost the wars; integrate into society and quit trying to be a nation within a nation.",
        "code": 3,
        "wordCount": 51
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "The Wild Wild West",
        "title": "Hasn't all land on Earth been taken away from their Natives? Why is the U.S. so special?",
        "text": "Its not taken away or stolen. It is conquered. Native Americans are fortunate, were it the Japanese Empire, Russia or China, which would have eventually happened and the Spainards who took over South America would have been impotent to stop any of them - the primative Native Americans would be slaves now if not completly eliminated.",
        "code": 3,
        "wordCount": 56
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Austin McKenna",
        "title": "Is the Darrell Brooks verdict compared to the Kyle Rittenhouse verdict proof of our two-tiered justice system heavily in favor of white people?",
        "text": "Well actually Kyle Rittenhouse was protecting himself as admitted by the one guy that wasn’t killed. All three were threatening Kyle and the one was even armed with a gun. Afterwards he turned himself into the cops and surrendered his weapon. Meanwhile Darrell Brooks on the run from the police mowed down innocent people trying to celebrate Christmas in a parade. There’s also video of both showing the lead up to the action in question. The video was proven to not be doctored and in Kyle’s case even corroborated by the prosecution’s witness which put the nail in the coffin for the chance of a guilty verdict. Main difference is Kyle’s actions were justified. Darrell Brooks’s were not. It’s got nothing to do with race. It’s all about crime and punishment. It’s like saying “my black friend shot a robber who broke into his house while John Wayne Gacy who was white was sentenced to death for murdering 33 (or more) young men. Isn’t this proof that the justice system favors black people?” A bit extreme but you can’t conflate them. There are numerous cases similar to Kyle’s where the defendant is black or Hispanic but still acquitted on self defense even one defendant who shot at the police. There’s also a wealth of examples where white men have claimed self defense and been found guilty. Remember Ahmaud Arbery? It happened around the same time.\n\nTL: DR It’s not a race issue since the crimes are so different and there are a number of examples of similar cases to Kyle’s with defendants who aren’t white and have been found not guilty. This radical thought can be disproved by a simple google search.",
        "code": 3,
        "wordCount": 281
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Kevin Caudill",
        "title": "How many of your teachers lied to you about White history?",
        "text": "my history teacher said we stole this land from the indians fair and square so you cant get more honest than that",
        "code": 3,
        "wordCount": 22
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Cailean MacConnich",
        "title": "How many of you are currently dating (or married to) a white partner?",
        "text": "My chicklet is a more tanned version of my own pale bluey/pinkness.\n\nBut only because she buggered off on hols with her sister a few weeks back, and left me behind.\n\nIs she “white” yea, I suppose that’s how people want to describe other folk now. But in essence the biggest difference is that I’m Scots and she is a member of the mortal enemy of my race, yes… I’m sleeping with the enemy (that’s the English, to those who don’t know). But you know what it only really comes up when the Rugby internationals are on.\n\nAnd anyway seeing an English girl wearing my old Scotland Rugby shirt in the morning is a sight for sore eyes.\n\nNow what was the question again????",
        "code": 3,
        "wordCount": 120
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "JJ Meng",
        "title": "What can I do to fight white supremacy? Am I part of the problem just because I’m white?",
        "text": "This mythical “white supremacy” is the new scapegoat for the Left and a convenient vehicle to get others to hate white people.",
        "code": 3,
        "wordCount": 22
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Alex Jackson",
        "title": "Why do so many black neighborhoods have such high crime rates as compared to most white neighborhoods?",
        "text": "Because of police brutality.\n\nSeriously.\n\nThe state exists to have a monopoly on the use of force. This is essentially the civilizing process. When you are a victim of a crime, you go to the police for justice, you don’t go and take care of it on your own. As black neighborhoods don’t trust the police, they have to take justice in their own hands and in the process create more crime. There are all kinds of other factors, but this is a very significant one.\n\nThough this is also why police presence is so concentrated in black neighborhoods and they become racist- because black neighborhoods have higher crime rates compared to white neighborhoods. So it becomes a feedback loop.",
        "code": 3,
        "wordCount": 117
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Cailean MacConnich",
        "title": "I am a Caucasian white male and my last name is Ward. Is there any info on what heritage the Ward name comes from?",
        "text": "I went to Google and typed in “history of the family name Ward”. I think you’ll find everything you need there.",
        "code": 3,
        "wordCount": 21
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Levi Toms",
        "title": "Why is Lebron James so revered when his comments and tweets are full of racism, rants against whites, etc.? Yet he’s happy to take their money. Should we stop buying products he endorses? (Shoes, AT&T, etc.).",
        "text": "YES YES YES",
        "code": 3,
        "wordCount": 3
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Rick Brandenburg",
        "title": "As a white person has your life become better or worse because of diversity and multiculturalism?",
        "text": "Here in the USA we are already a melting pot of cultures and diversity. But it appears these melting pots/diversity groups feel it’s perfectly fine not to have White people included because we make up the majority 70% of the country. But it’s fine for white people to pay more than their share.",
        "code": 3,
        "wordCount": 53
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Vinnie Paz",
        "title": "Why does Montana have the highest rate of gun ownership, but had no mass shootings recently and low gun crime?",
        "text": "It’s because their policies fight against gangs, do not encourage violence, and defending yourself against criminals by using a firearm is a protected right.",
        "code": 3,
        "wordCount": 24
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Oscar Fausto Pelosi",
        "title": "Why are White people not as tribal as other groups?",
        "text": "In Western Europe we stopped being tribals with the Greek Civilization, then we finally evolved into modern society with the Roman Empire. If other Civilizations didn't evolve it's because maybe their way of living is enough for them.",
        "code": 3,
        "wordCount": 38
    },
    {
        "source": "itsoktobewhite.quora.com",
        "author": "Lewis Cassandra",
        "title": "Why do African and Middle Eastern Refugees like to come into the European Union anyways I mean you wanted decolonization and we gave it to you but now you want to come into our Native Country and have a “better life”. What was the Point of decolonization then if you wanted to be a part of our Country?",
        "text": "So they could have the freedom to ruin their own countries without interference. Then they can invade our countries and fuck THEM up.\n\nThey are incapable of governing themselves. Open your eyes. Look at any country and US city where the whites have moved out. Chaos, murder, drugs, nice peaceful neighbourhoods with neat houses and gardens turned into unkempt, rubbish strewn hell-holes, Why do they shit in their own nests? Even dogs cats and wild animals don’t do that.\n\nImport the Third World, become the Third World",
        "code": 3,
        "wordCount": 85
    }
]