[{"source":"socialist.quora.com","author":"Alexander Hale","title":"What even is controlling means of production? Does not making the workplace more democratic also make it less productive as time is allocated from producing to deciding what and how to produce? Why, also, should workers control means of production?","text":"Imagine an explorer discovers an iron mine. Society wants to promote exploration so it wants to reward the explorer. There are two main ways to do this:\n\nCapitalism. The explorer KEEPS the iron mine. He hires workers who sell the iron to society and he keeps the profit. Or,\n\nSocialism. Society keeps the mine and pays the explorer a finders fee. Someone who specializes in running iron mines runs the mine and also collects a salary. The manager hires workers who sell the iron to society.\n\nEfficiency seems to prefer socialism as the explorer is back exploring and the manager is managing.","code":3,"wordCount":99},{"source":"socialist.quora.com","author":"Tyler Johns","title":"Is capitalism just business?","text":"Is capitalism just business?\n\nNo, it is not. Business predated capitalism by a fair amount, and would even exist in most models of socialism, albeit in the form of cooperative or publicly-owned enterprises.\n\nCapitalism, rather than being a synonym for “business”, is more accurately described as a relationship between productive property, capitalists (ie: those who own capital), and workers. Productive property is disproportionately owned by capitalists seeking profit, who then hire workers to perform labor pertaining to that property in exchange for a wage. The various forms of socialism look to take the capitalist out of this equation and socialize the economy, but the exact implications of this vary wildly depending on which socialist you ask.","code":3,"wordCount":114},{"source":"socialist.quora.com","author":"BlueWolf","title":"What are the names or terminology that describe those people who don't believe in democracy?","text":"Anti-democratic autocrats authoritarians monarchs totalitarian","code":3,"wordCount":5},{"source":"socialist.quora.com","author":"Sean Ahluwalia","title":"What are the names or terminology that describe those people who don't believe in democracy?","text":"That depends on the form of government they advocate.\n\nSome of the options include:\n\nAutocracy - rule by a single person who wields absolute power.\nTechnocracy - rule by technical experts and engineers in their respective areas of expertise.\nOligarchy - rule by an elite, whether that be determined by wealth, social status or some other metric.\nPlutocracy - rule by the most wealthy.\nMeritocracy - rule by those who have accumulated most merit (usually by demonstrating competence at governance).\nKleptocracy - a government where officials enrich themselves through patronage and abusing their positions of power. No one directly admits they are a kelptocrat and publicly endorses this as a system of government.\n\nMost people actually favor a mixture of different systems of government, and most real-world governments blend elements together.\n\nFor example, the United States government is a representative democracy with plutocratic and oligarchic undertones. The interests of the business community and by extension, the interests of capital, form a wealthy elite that effectively guides policy and frames the terms of political discourse in the country. This is true of all countries with capitalistic economies to some extent, regardless if they are democracies or not.\n\nThe Chinese government blends technocracy (at the upper levels of government) with democracy (at the lowest levels of government). It’s not a multi-party democracy, but uses big data to gauge the desires of its population and adjusts policy accordingly. It is “democratic” in terms of responding to people’s demands. The technocratic bent accounts for China’s spectacular economic growth over the past four decades.\n\nRussia’s government is a kleptocratic oligarchy with formal liberal democratic institutions (civil liberties, competitive elections with multiple parties) that are largely for show and legitimacy. The kleptocratic nature of the state apparatus and filters throughout Russian society, and contributes to its inefficiency and stagnation.\n\nYou will notice I left out biased and imprecise terms (i.e. authoritarian, totalitarian) used to attack certain country’s governments when they go against Western hegemonic interests. Technically speaking, any of the above-listed forms of government can have “authoritarian” bents.","code":3,"wordCount":330},{"source":"socialist.quora.com","author":"Miles Wilkerson","title":"Why would anyone work under socialism?","text":"Simple: boredom.\n\nThis is anecdotal, but follow me— in my experience, I've met retirees who have worked since their teenage years. They often love the newfound freedom of having their whole week to dow whatever they like. Spending times with friends and family. Watching TV or browsing the net. The list goes on and on.\n\nThing of it is, after a year or two, the monotony of having all of that free time often (not always) makes them restless. They get bored. Idle hands are the devil's plaything.\n\nSo they often volunteer for Habitat for Humanity, at a church or local sou kitchen, or mentoring young people in athletics as a coach… you get the idea.\n\nThey might even get a part-time job or start a small business based on their hobby.\n\nWhen you've been conditioned to work eight hours a day for forty or more years. The idea of having a day full of leisure time sounds great. But once they ease into it, the inertia and isolation makes them antsy. They want to do something.\n\nAnd even people who work full-or part time often volunteer at nonprofits and faith-based organizations. Mark argued it was human nature. People do creative and productive things (woodworking, crafts, writing, painting, etc.) with little or no monetary incentive even in our current society. We produce much more than we need as a species. But the resources aren't distributed in an equitable way.\n\nOf course not everyone is like this. Some people really are comfortable lousing around doing next to nothing.\n\nBut in a socialist society (especially a post-scarcity society or country with a universal basic income or negative income tax), who cares? If everyone's needs are met and most things are automated, there's no need for citizens need to bust their hump for low wages. Why do we need a Protestant work ethic if everyone is, for all intents and purposes, fine? You can spend time working on your car, having a cookout, hunting, fishing, or even working a job that you actually enjoy part-time without worrying about how you're going to pay your bills.\n\nAlso, some people don't get wealthy, but they can be famous or at least well-regarded in their community. Plenty of people do things more for social media clout and attention on the internet now and don't really make much off of it. But they still get the social capital of being well-known. Mayor Daley wasn't loaded, neccesarily. But he could go into any steakhouse in Chicago and probably get a five-course meal for free. No money down. This is a more cynical reason, but you get the idea.\n\nAs a counterpoint, what incentive do some people have to work in a capitalist society? If someone inherits their daddy's widget firm and all they do is boss around working people like you and me and go to benefit events, I'm not sure I'd call that productive. That's a matter of opinion, though.","code":3,"wordCount":483},{"source":"socialist.quora.com","author":"Alexander Hale","title":"Why would anyone work under socialism?","text":"For money. Things arent free under socialism. Things are free under COMMUNISM. And if your question is, why would you work under communism? You wouldn’t. That’s WHY shit is free under communism, because there are no jobs. Communism requires a post scarcity economy. That’s a fancy way of saying robots fo all the work. There’s no honor system in socialism or capitalism.\n\nHeres a tip: if you hear a side of a controversy that is nonsensical (such as ppl living under the honor system), its likely you’re misinformed about the opposing arguments.","code":3,"wordCount":91},{"source":"socialist.quora.com","author":"Endre Enyedy","title":"Why would anyone work under socialism?","text":"If they have your mental acuity: they better stay home watching TV.","code":3,"wordCount":12},{"source":"socialist.quora.com","author":"Ryan Osterman","title":"Why would anyone work under socialism?","text":"What do you think socialism is? We don’t have to do mutual aid programs like housing and food. I will argue for both but we don’t have to.","code":3,"wordCount":28},{"source":"socialist.quora.com","author":"Jan Meyer","title":"Why would anyone work under socialism?","text":"Because you still need to eat.","code":3,"wordCount":6},{"source":"socialist.quora.com","author":"Shayn M.","title":"Why would anyone work under socialism?","text":"Because they would not be able to live otherwise.\n\nI’m not quite sure where this odd idea comes from that socialism is, all about freeloading but it really isn’t.\n\nSocialism is based on the idea that everybody works and everybody gets the benefit of that work because everybody owns a share in the wealth produced by that work.\n\nPeople work under capitalism because they will be poor if they don’t. People work under socialism for the same reason- only instead of under capitalism, where wages are traded off against profit by the owners of the enterprise, under socialism, the owners include the work force, who are not just hired labour, and investment and remuneration decisions are more inclusive.\n\nAn old socialist principle is “he who will not work, neither shall he eat”. Everyone is expected to contribute what they can in order to received what they need from society. The only exceptions would be the severely disabled and those who legitimately cannot contribute much.","code":3,"wordCount":160},{"source":"socialist.quora.com","author":"Chris Walsh","title":"How would you describe the current Republican Party?","text":"The death of democracy","code":3,"wordCount":4},{"source":"socialist.quora.com","author":"Craig Bullard","title":"How would you describe the current Republican Party?","text":"As a European the far right of the party are Christian fascists, something we’ve sworn will never happen again here. I don’t know how ‘normal’ democratic Republicans are distancing themselves from the extreme right. I’d appreciate some American’s educating me.","code":3,"wordCount":40},{"source":"socialist.quora.com","author":"Chris Miller","title":"Aside from the socialist argument, wealth is built on exploitation because wage slavery or some other buzz word. Well what if your just brought bitcoin was it was 8 cents and never employed anyone?","text":"Well, what about it? It seems you present this particular hypothetical situation in the belief it somehow disproves that the exploitation of labor is not an inherent feature of the system.\n\nThis is hardly representative of the entire system though, is it? All this really means is that this hypothetical person is a member of the rentier class. (Look it up)\n\nSo, let’s say our hypothetical friend here withdraws his/her investment gains at the right time and is sitting on a pile of cash. Will he/she eat that cash to survive? Will he/she build a house out of that cash to live in? Will he make clothing of it? Probably not. He will buy food, housing, and clothing and other commodities produced by wage slaves (or some other buzz word; whatever you wish). Nobody can live an isolated life outside the system. And the system is the relevant issue, not what any hypothetical person might hypothetically do.\n\nThen, as his assets diminish, he faces a choice. Do I use my remaining wealth to generate capital through establishing an enterprise that does exploit labor? Or, do I not, and become instead another member of the working class? Maybe I’ll invest more money in other vehicles that degradate the environment and/or depend upon wage labor? You see, not only does one member of the rentier class not define a system, neither does an instant in time. Like all things, capitalism is about time and movement and the conflict of thesis and antithesis (look it up).","code":3,"wordCount":250},{"source":"socialist.quora.com","author":"Robert Allan","title":"I did the political compass test and I am in the left, but I don’t know what ideology it says I support (communism, democratic socialism, social democracy, etc.). Can someone answer it?","text":"Not based on the information you provided. If you really want to know, read some books on the various political ideologies and determine which are in line with what you believe. I think you'll find you may agree with parts of more than one of them. Most people don't fit neatly into one definition","code":3,"wordCount":54},{"source":"socialist.quora.com","author":"Michael C. Anderson","title":"Is capitalism just business?","text":"Technically yes. Capitalism is about the production of capital through business activities. If a business can produce revenue in excess of its cost of doing business, capital (profit) will be produced. Capitalism is not linked to a particular political system because it is an economic phenomenon.\n\nMany people think capitalism and democracy are linked but they are not, although democracies may support capitalism better than other political systems because the rights of the people help drive the creation of new businesses. In a democracy, government is less involved in the control of business.\n\nAny political system, even dictatorships, relay on capitalism to grow their economies because it is the most efficient way of producing capital.","code":3,"wordCount":113},{"source":"socialist.quora.com","author":"Chris Miller","title":"Is capitalism just business?","text":"Just as the Mafia is “just business”. But less to the point, it’s an economic system, true. But the ramifications of that extend to all areas of life, not just the production, distribution, and selling of commodities. Hopefully, someone who is a better writer can expand on my answer, but in short, the system of production in a country is the foundation that directs family relationships, worker/management relations, the justice system, politics, etc., etc. It determines most everything about your life.","code":3,"wordCount":81},{"source":"socialist.quora.com","author":"Samuel Ranney","title":"I did the political compass test and I am in the left, but I don’t know what ideology it says I support (communism, democratic socialism, social democracy, etc.). Can someone answer it?","text":"That’s for you to figure out. But, even then, we can’t answer this question without seeing a picture of your results.","code":3,"wordCount":21},{"source":"socialist.quora.com","author":"Michael C. Anderson","title":"I did the political compass test and I am in the left, but I don’t know what ideology it says I support (communism, democratic socialism, social democracy, etc.). Can someone answer it?","text":"Left ideology includes everything to the left of center. Closest to the center is American liberalism (big government), then as we move left there would be democratic socialists (Progressives), and then pure socialists at the extreme left. Pure socialists and communists are essentially the same thing, a government where the economic means of production are controlled by government. In this model there is no democracy (people have no say in government) and no capitalism (no free market determining prices).\n\nDemocratic Socialism (advocated by Bernie Sanders) is a socialist society where the people can vote and choose their leaders. He is always claiming that the Nordic countries are examples of Democratic Socialism, but they aren’t. Social Democracy is a step along the path to pure socialism where the people continue to elect their leaders. A slow transition from Democracy to Social Democracy is followed by the final step to pure Socialism. This is the same concept as Marx’s migration from democracy to communism.\n\nThe chart below shows the relationship between politics and ideology.","code":3,"wordCount":170},{"source":"socialist.quora.com","author":"Brandon","title":"Have democrats been tricked into identity politics rather than the Occupy Wall Street and other real reforms?","text":"If this gets accepted, I would like to say this topic is very very opinionated.\n\nYes.\n\nTo be honest. This is my personal opinion. Identity politics is incredibly stupid, and a huge waste of time. And it bothers me that the left are so keen on it..\n\nI personally believe weath disparity to be the biggest divider of I suppose .. justice ?\n\nBecause when we look at what identity politics aims to do, is it makes groups of people care more about whatever historical precedent has affected them, rather than recognizing the system in which puts that position.\n\nI'm not saying you can't be gay and fight for gay rights, I myself am Omnisexual Cis gendered Korean man. But notice how god damn isolating that is. Omnisexual Cis Gendered Korean Man. I'd prefer you tell me what social class you're in. A black person with a billion dollars, has TEN FOLD more privilege than a single white mom living in a trailer park.\n\nAs a member of gen z, I'd say my generation is the most interested in identity politics. Over whatever social economic blah blah. And that's the issue, it's sort of what massive corporations want. Less focus and attention to the ruin that our current capitalistic system is in.\n\nI'm gonna be frank. You can ask any teenager or 20 something about what pronouns are, what sexuality that are, what gender they are. Etc. But it would he difficult for them to thoroughly explain socialism, capitalism etc.","code":3,"wordCount":243},{"source":"socialist.quora.com","author":"Destroyerbirb","title":"For those of you who consider yourselves Socialists but not Communists, what is it that makes you choose not to identify as Communist?","text":"I consider myself both, because I would completely support a global Communist system, but in reality I understand that a system like that is near impossible after the Cold War and the Red Scare. That’s the big difference between Socialists and Communists. Communists would strive towards a true Marxist world as much as possible. Socialists, however, would try to form an economic and political ideology around the main qualities of Marx’s manifesto, and would encourage a change towards Marxist, but would not strive for it the same way a Communist would.\n\nFor example, if I were to write my own manifesto, I would base it on Socialist ideals that would be able to easily transfer into a Communist world. It would encourage Marxism, but would set up a society and government that would function in the split world between Capitalism and Socialism that we have. A lot of Socialist leaders, such as Tito, Mao, Castro, and Lenin, thought or think in a similar fashion. One thing to not is that one cannot be a Communist without being a Socialist, but one can be a Socialist without being a Communist. Hope my answer is some help to you.","code":3,"wordCount":196},{"source":"socialist.quora.com","author":"Ryan Osterman","title":"For those of you who consider yourselves Socialists but not Communists, what is it that makes you choose not to identify as Communist?","text":"Historically it has been associated with Stalin and Mao. Both whom are murderers and paranoid to the point where they nearly destroyed their countries own survival. Also because Im not too sure about a dictatorship of the proletariat idea.","code":3,"wordCount":39},{"source":"socialist.quora.com","author":"Chris Miller","title":"For those of you who consider yourselves Socialists but not Communists, what is it that makes you choose not to identify as Communist?","text":"The terminology is a little confusing to begin with, and it is made even more confusing when people and media outlets use the words Socialism/Communism/Democratic Socialism/Social Democracy incorrectly and repeatedly.\n\nSocialism is the pathway to a utopian state called Communism. There is no real fixed and permanent state that can be called socialism without communism as its goal. Democratic Socialists/Social Democrats are distinguished by efforts to work within the framework of a western style democracy towards that goal. You know, getting elected, writing laws, etc. This is in contrast to revolutionary socialists, whose goal is to overthrow the capitalist state and install a socialist state. Working “outside the system” vs. working “within the system”.\n\nPopularly, it is common for people without a real knowledge of either to believe socialism is ‘communism lite’, i.e., a state of affairs something like Bolivia, as opposed to something like what they believe is going on in Cuba or what they believe happened in the old Soviet Union.\n\nBut different countries take different paths on the journey to the utopian ideal that the word communism represents. And they find themselves at different stages of that journey. Communism is the goal; socialism is the vehicle. Nothing is really fixed. Everything is always in motion and in transition. Tadpole/frog, caterpillar/butterfly - same animal in different stages, always in transition.","code":3,"wordCount":219},{"source":"socialist.quora.com","author":"Erich Walrath","title":"For those of you who consider yourselves Socialists but not Communists, what is it that makes you choose not to identify as Communist?","text":"Socialism/Social Democracy is an economic system, but it’s also a template for civilization. A nation that accepts Socialism tends to be more humanitarian, better educated, healthier, focused on the larger community, and equitable in the treatment of all its citizens. It is democratic.\n\nBut it is not utopian. Socialism is not millenarian. As an economic system, it does not posit the ultimate arrival of the new Communist man. It does not pretend that the State will eventually wither away. It does not provide the ultimate meaning of life. It has no opinion on the existence of God. It does not seek to undermine tradition, except where that tradition is detriment to the community as a whole. There are. for example, parliamentary monarchies in several social-democratic nations.\n\nCommunism, OTOH, is utopian. It holds to a revolutionary doctrine that necessitates the ultimate eradication of the old order in order to build a Communist society. An extreme example of this is the Khmer Rouge’s attempt to reshape Cambodia through slaughter. Most of the countries that adopted the Soviet or Chinese versions of Communism held political prisoners. Many of them were executed as counter-revolutionaries. Communism functions like a militant theocracy, albeit without God.","code":3,"wordCount":197},{"source":"socialist.quora.com","author":"Louise Turner","title":"For those of you who consider yourselves Socialists but not Communists, what is it that makes you choose not to identify as Communist?","text":"The economic contraints of the past no longer exist , all we need to do is control the distribution of wealth according to the needs of the individuals of the working classes . Satisfy the wants without damaging the environment by using industrial Hemp products for starters ! Capitalisme is only about extracting wealth to satisfy an accounting fiction . Communism is only about fighting Capitalism ,Socialism is about keeping the poor from being too poor to better protect the rich from street violence . So what does this world need ? >> Better teachers !","code":3,"wordCount":96},{"source":"socialist.quora.com","author":"Kyle Custodio","title":"For those of you who consider yourselves Socialists but not Communists, what is it that makes you choose not to identify as Communist?","text":"Simply put There are two things people mean when they say communism. Either the Government system of the USSR in which I think is politically and ethically bad or the classic definition of a stateless, classless moneyless system which I’m not sure of the feasibility of.","code":3,"wordCount":46},{"source":"socialist.quora.com","author":"William Richmond","title":"I recently read that John Locke's labor theory of property rights can be interpreted in a way that supports socialism rather than the free market capitalism with which it is more commonly associated. What is that socialist interpretation? https://en.m.wikipedia.org/wiki/Labor_theory_of_property","text":"From what I understand the labour theory of property (property in this case means land) is that one assumes ownership of property through applying labour to it. Rosseau uses the example of discovering a new continent, you do not claim the entirety of the continent but you have to exert labour into making something of it in order to own it. It is a prime example of liberal meritocratic ideals and provides the basis for why Adam Smith hated landlords so much but loved capitalists, as capitalists presumably put their labour into developing property into capital whilst landlords didn’t.\n\nMore market inclined socialists might see the labour theory of property as a good basis for a non-commodity system of ownership. As a communist I think this is a little unrealistic even if it could exist as a hypothetical.","code":3,"wordCount":137},{"source":"socialist.quora.com","author":"Ian Rae","title":"For those of you who consider yourselves Socialists but not Communists, what is it that makes you choose not to identify as Communist?","text":"When I first became interested in changing society the only political movement that wanted a global moneyless, stateless, wageless, classless society where production’s for use and there’s free access to all that’s produced was the Socialist Party of Great Britain and its companion parties and contacts across the world. They had no leaders, they are people who want to organise for a socialist society, if the had been called the communist party of great britain and adhered to the same principles it wouldn’t have made a difference to me, but that’s what was and still is, here we are from 1904\n\nOur Object and Declaration of Principles\nThe world is a “global village”. Each region may have its own particular and distinct customs, but they are part of a greater system of society that is world-wide. This system of society is capitalism and every region and nation operates within this system of society in one way or another. Socialism is not a cooperative island in the middle of capitalism, but a global system of society that will replace capitalism. This includes the forests, mines, and oceans from which natural wealth is extracted, the factories in which this natural wealth is processed, and the distribution of that wealth via transportation networks (such as roads and truck lines) and distribution centres (such as grocery and department stores). It does not include your personal belongings such as your toothbrush or clothing, or the family heirloom. Common ownership means that society as a whole owns the means and instruments for distributing wealth. It also implies the democratic control of the means and instruments for producing and distributing wealth, for if everyone owns, then everyone must have equal right to control the means and instruments for producing and distributing wealth. Common ownership is not state ownership. State ownership is merely the ownership by the capitalist class as a whole, instead of by individual capitalists, and the government then runs the state enterprises to serve the capitalist class. In the self-proclaimed “communist” states the state enterprises serve those who control the party/state apparatus. The working class does not own or control. It produces for a privileged minority. Working class emancipation necessarily excludes the role of political leadership. The Socialist Party has an absolute need of supporters with understanding and self-reliance. Even if we could conceive of a leader-ridden working class displacing the capitalist class from power such an immature class would be helpless to undertake the responsibilities of democratic socialist society. That society as at present constituted is based upon the ownership of the means of living (i.e., land, factories, railways, etc.) by the capitalist or master class, and the consequent enslavement of the working class, by whose labour alone wealth is produced. How are decisions about the operation of society made? What principles govern what goods will be produced in what quantity and quality, or what social programs and laws will exist? If decisions were made based upon the needs of humanity then the food that is regularly destroyed by the truckload would instead feed the starving. Decisions are made based upon the expectation of making a profit. The ecology of the world is being devastated, even though this devastation may wipe out the human race, because of profit. Poor quality goods are produced, not because people want to have junk, but because it is profitable to produce junk. The rich can get the best, the rest of us often have little choice. Anyone can think of dozens of examples of how\nhttps://www.worldsocialism.org/spgb/our-object-and-declaration-principles/","code":3,"wordCount":585},{"source":"socialist.quora.com","author":"Sean Ahluwalia","title":"For those of you who consider yourselves Socialists but not Communists, what is it that makes you choose not to identify as Communist?","text":"In the modern political lexicon, “Communist” almost always refers to an adherent of Leninist Vanguard party theory, single-party states, the Leninist theory of imperialism, and offshoots of Leninist and Marxist-Leninist ideology.\n\nMany socialists and Marxists disagree with many if not all of these practices and theories. Some if not all of Leninism is arguably contra to orthodox and classical Marxist theory.\n\nSome socialists care little for the political movements and ideologies and are strictly focused on the economic merits of socialism itself (meaning a socialist economy). For example, one can see the potential utility in social / public ownership of firms and a social dividend scheme in lieu of increasing trends toward widespread automation, or believe in the potential for real-time economic planning given the “internet of things” and modern information technology while not giving a hoot about “proletarian revolution”, imperialism, political sectarianism, or the idea of a single party state.","code":3,"wordCount":149},{"source":"socialist.quora.com","author":"Jim Farmelant","title":"Why do right-wing groups love to \"steal\" terms from the left? Cases such as National Socialism/fascism, Right Libertarian, and Anarcho-Capitalism.","text":"They do that because they realize many left-wing ideas are genuinely popular. Thus in Germany when the National Socialists were founded after the First World War, the Social Democrats (SPD) were the largest political party in Germany. And the Communist (KPD) while much smaller than the SPD, were the largest Communist party in the West. Hitler alluded to that in Mein Kampf where he explained why his party had adopted the color red, the traditional color of the left. He wanted to distinguish his party from the traditional right-wing parties. And he wanted to draw into his party people who might otherwise had vaguely left-wing leanings but were also drawn to the party’s nationalism and antisemitism.\n\nAnd the same logic applies to right libertarian and anarcho-capitalist. In both cases, right-wingers realized that they could benefit from using left-sounding rhetoric because that rhetoric was associated with left ideas that were either genuinely popular, or at least potentially popular.\n\nBehind this is a larger issue IMO. And that is since the emergence of mass political participation since the French Revolution right-wingers have come to realize that to remain politically viable they must be able to craft appeals to the masses, even if such appeals involve using somewhat deceptive rhetoric in which right-wing ideas are made more appealing by being expressed in left-sounding terms.","code":3,"wordCount":219},{"source":"socialist.quora.com","author":"Scott Cohen","title":"Should low-wage workers prefer unionization or take steps as individuals to improve their bargaining power?","text":"Unions exist primarily to control the public response to unjust living standards. Unions are elite organizations which funnel the harsh working conditions into one or two outlets that become productive for the capitalist class.\n\nSo when workers go from job to job what becomes of the value of the unions? Unions have already failed,thats why people go from job to job.\n\nThe age of the union is over. People are too isolated from their communities and from their ownership of their own lives.","code":3,"wordCount":81},{"source":"socialist.quora.com","author":"Nick—Green","title":"In the lower stage of communism (AKA Socialism), should workers be paid based on their labor time contributions or their output value?","text":"Both I’d presume","code":3,"wordCount":3},{"source":"socialist.quora.com","author":"James Martin","title":"Should low-wage workers prefer unionization or take steps as individuals to improve their bargaining power?","text":"As individuals, workers—especially “unskilled” workers—have little to no bargaining power. Their employers hold all the cards. This is why collective bargaining became a thing in the first place.\n\nThere are problems that individualism can’t solve. There are quite a lot of them, actually.","code":3,"wordCount":42},{"source":"socialist.quora.com","author":"Condor Mahjedas","title":"Should low-wage workers prefer unionization or take steps as individuals to improve their bargaining power?","text":"I work two low wage jobs while educationally I set up for my dream job. One job has a Union, the other doesn’t.\n\nPersonally, at least so far, I’ve found unions to be effectively useless. They’re good at existing and keeping corpos in check, so they’re good on a macro perspective and a community perspective.\n\nBut when it comes down to the individual worker, they might provide some benefits, but where I live, it’s useless, since the Government already has laws to keep them in check. Then again, those laws would not exist without the unions.\n\nI would say they’ve done their jobs, but we still need them around to keep corpos in check.","code":3,"wordCount":111},{"source":"socialist.quora.com","author":"Robert Wright","title":"If employers say they can't pay their workers a living wage, shouldn't they either revise their business model or admit their business has failed?","text":"First, it depends on who the workers are. If they are teenagers, or have no skills at all. e.g. ,they aren’t meant to be paid a “living wage”. Second, where did you get the strange notion that the measure of a business’s success is what wages it pays? A business isn’t a success or a failure based on whether it can pay a certain wage, but on whether it makes a profit. I hope you weren’t “educated” in America, but I have little of it.","code":3,"wordCount":85},{"source":"socialist.quora.com","author":"Trenton Davis","title":"The economic principle of socialism is, \"from each according to his ability, to each according to his contributions.\" If people must be paid according to their contributions in socialism, how would software engineers' contributions be measured?","text":"They would get paid however much the co-op they worked at paid them? The difference between a workers co-op and a traditional private firm isn't how the workers get paid, it's who runs the business.","code":3,"wordCount":35},{"source":"socialist.quora.com","author":"Jeff Greene","title":"Are you in favor of the heritage inherited from your parents or are you against it? What are the pros and cons?","text":"Original question: re you in favor of the heritage inherited (like houses, properties ecc.) from your parents or are you against it? What are the pros and cons?\n\nI have a younger brother so everything my parents have left is likely to be split between us. Having said that, I am neither for or against inheriting from your relatives.\n\nIf my parents choose to spend every penny that they have (meaning that they sell their property and use the money) on things that they want or want to do like vacations, then good for them. If they decide to save some for us, or the church then that is also great.\n\nThe problem with questions like this is that inheritance often includes things like family businesses. If my parents had operated a business all of my life and wanted me to take over because I had also worked in the business since graduating from college, should I be against inheriting the business simply because it is inheritance?\n\nMy father worked for a small business where the owner died and his relatives were forced to sell the business because there was not enough cash in the estate to pay the inheritance taxes on the value of the business. Is this a good thing.","code":3,"wordCount":208},{"source":"socialist.quora.com","author":"Breckenridge Caine III","title":"Are you in favor of the heritage inherited from your parents or are you against it? What are the pros and cons?","text":"23 million exemption, then 90% back in the pot. That seems to be more than reasonable.","code":3,"wordCount":16},{"source":"socialist.quora.com","author":"Zach Hall","title":"If employers say they can't pay their workers a living wage, shouldn't they either revise their business model or admit their business has failed?","text":"When I was in high school, I was paid $7/hour with no benefits to work at a batting cage. I lived with my parents and had no real expenses, the money I earned went to a combination of video games, food, and savings. I had very few responsibilities other than show up, answer the phone, clean up after customers, and do some minor cleaning once it was closed to the public. I also got to hit balls for free (usually it was $1 per 20 pitches) when customers weren’t around.\n\nAll the other employees were like me, high school or college kids who just needed a part-time job to pay for minor expenses, and the business relied on workers with no skills other than the ability to show up and have super minimal responsibility. I don’t think the business failed, and if that business had admitted it failed and closed down, I would have not only lost the money from wages there, but also lost an entry on my resume that I used to get my first job out of college that paid me well above a living wage.\n\nBut ok, maybe the questioner isn’t referring to jobs that employee high school kids, maybe just jobs that are mostly adults? What do you think will happen if they admit their business has failed and close up shop? Will higher-paying jobs magically appear? No the reality is if low-wage businesses closed up shop, they would likely be replaced with nothing. The government that many claim is subsidizing low-wage businesses would now be responsible for 100% of the living costs of the former low-wage workers and newly unemployed, rather than 20% or 30% or whatever it is. And the vast majority of minimum wage workers get raises shortly after gaining experience. If you take away their opportunity to get experience at less than a living wage, you’re actually making it more difficult for them to acquire the skills they need in order to earn a living wage.","code":3,"wordCount":333},{"source":"socialist.quora.com","author":"Scott Cohen","title":"If employers say they can't pay their workers a living wage, shouldn't they either revise their business model or admit their business has failed?","text":"What they say is utterly irrelevant. If they can't pay a living wage then they are already out of business. What they are referring to is the future wage necessities of the worker.\n\nBut what is a living wage anyhow? Nobody says. So how do they know if they can pay it?\n\nIn any case, a living wage is what we already have. So how can it be that they cannot afford it?\n\nEveryone deserves a marriage wage. But the pseudo left will continue to push the capitalist agenda.","code":3,"wordCount":86},{"source":"socialist.quora.com","author":"Ralf G. Gerler","title":"If employers say they can't pay their workers a living wage, shouldn't they either revise their business model or admit their business has failed?","text":"It SHOULD be a sign of a failed business model.\n\nIt WOULD be if unearned gains (e.g., cost shifting; wage theft; rent-seeking; unsustainable cost avoidance unsustainable; etc.) were recognized as such and excluded from “economic profit”.\n\nIt’s NOT, however, because (at least in the USA) corporate interests have drowned out common sense by completely monetizing the political system via insanely massive lobbying, direct and indirect campaign donations and support, and post-political career-rescues (the “revolving door”). The Supreme Court further cemented this corruption by its recent ruling that corporations are “people” and money is “speech”.","code":3,"wordCount":92},{"source":"socialist.quora.com","author":"Jeff Gib","title":"If employers say they can't pay their workers a living wage, shouldn't they either revise their business model or admit their business has failed?","text":"A living wage is extremely subjective. Governments want to define a living wage to dictate what people will pay employees. It really has nothing to do with a “living wage”. The amount of money required to live decently in Ponca City, OK is a galaxy removed from what is required in Los Angeles. And there is a ton of subjectivity.\n\nOften, immigrants come to the U.S. and figure out how to make it on less than minimum wage. I’m NOT saying this is right, but they do it because they have multi-generations in a single house - a situation that is NORMAL and COMMON in places like India. If you come from a poor part of Mexico and make $7 an hour here, and live with 4 people in a modest apartment, you are living FAR better than the situation you came from. It’s all relative.\n\nWhat you’re missing is that the equation is about what people will pay for your goods or services balanced with what people will work for money-wise. The market achieves equilibrium. If you cannot sell the goods your business produces whiling finding people to work for the money you pay and still make enough to take home yourself, then the market doesn’t want what you produce bad enough. The market will decide. Any artificial manipulation of this will hurt the economy. I could explain but that would be four more paragraphs.","code":3,"wordCount":234},{"source":"socialist.quora.com","author":"Ellison Lambo","title":"If employers say they can't pay their workers a living wage, shouldn't they either revise their business model or admit their business has failed?","text":"If a company does not pay minimum wage that is a crime.","code":3,"wordCount":12}]